Repository: irontec/ivozprovider
Catalog: web/admin/application/languages/*/*.po
Languages: ca_es, it_it

source: Local legislation may enforce to announce the call recording to both parties, act responsibly
ca_es: La legislació aposta per anunciar l'enregistrament de la trucada per totes parts, actuant responsablement
it_it: La legislazione locale può imporre l'obbligo di annunciare la registrazione delle chiamate a entrambe le parti, agire in modo responsabile

source: Local socket
ca_es: Dirección local
it_it: Socket locale

source: Local socket cannot be empty.
ca_es: La dirección local no puede estar vacía.
it_it: Il socket locale non può essere vuoto.

source: Locales
ca_es: Configuracions locals
it_it: Locali

source: Location
ca_es: Ubicació
it_it: Ubicazione

source: Locution
ca_es: Locució
it_it: Messaggio vocale

source: Locution periodically played to calls that are queued
ca_es: Locució enunciada periòdicament a les trucades que estan en cua
it_it: Messaggio periodicamente riprodotto per le chiamate che sono in coda

source: Login Info
ca_es: Informació de login
it_it: Informazioni di accesso

source: Low balance
ca_es: Balanç baix
it_it: Credito basso

source: Mail address shown as source when sending mails. MTA must allow this value.
ca_es: Adreça de correu d'origen per enviar correus electrònics. MTA ha d'acceptar-la.
it_it: Indirizzo di posta indicato come origine quando si inviano messaggi di posta elettronica. MTA deve consentire questo valore.

source: Mail address where this notification will be sent
ca_es: Adreça de correu electrònic on s'enviarà la noitificació
it_it: Indirizzo di posta dove verrà inviata questa notifica

source: Main Settings
ca_es: Configuracions principals
it_it: Impostazioni principali

source: Main operator
ca_es: Operador principal
it_it: Operatore principale

source: Main platform view
ca_es: Vista de plataforma principal
it_it: Vista principale piattaforma

source: Mark this option to regenerate all rules after saving.
ca_es: Marca aquesta opció per generar les regles després de guardar.
it_it: Contrassegna questa opzione per rigenerare tutte le regole dopo il salvataggio.

source: Mark yes to hide this destination calls in all lists
ca_es: Marcar sí para ocultar las llamadas a este destino en todos los listados
it_it: Seleziona Si per nascondere queste destinazioni in tutte le liste

source: Mask
ca_es: Màscara
it_it: Maschera

source: Match
ca_es: Coincidència
it_it: Corrispondenza

source: Match List
ca_es: Llista de coincidències
it_it: Lista corrispondenze

source: Match List Pattern
ca_es: Llista de coincidències de patró
it_it: Schema Lista corrispondenze

source: Match Value
ca_es: Valor de coincidència
it_it: Confronta Valore

source: Match expr
ca_es: Expressió de coincidència
it_it: Confronta expr

source: Matching handler
ca_es: Manipulador de coincidència
it_it: Confronta handler

source: Matching priority
ca_es: Prioritat de coincidència
it_it: Confronta priorità

source: Matching type
ca_es: Tipus de coincidència
it_it: Confronta tipo

source: Max calls
ca_es: Trucades màximes
it_it: Max Chiamate

source: Max daily Notification
ca_es: Notificació de Màxim diari
it_it: Notifica Consumo giornaliero

source: Max daily usage
ca_es: Màxim diari consum
it_it: Consumo giornaliero

source: Max digits
ca_es: Dígits màxims
it_it: Massimo Cifre

source: Max disk usage (in MB)
ca_es: Màxim ús de disc (en MB)
it_it: Utilizzo massimo del disco (in MB)

source: Max disk usage in megabytes this brand can use. When limit has been reached, oldest brand's recordings will be removed. Set to zero to allow unlimited disk usage.
ca_es: Espai d'ús màxim del disc que aquesta marca pot utilitzar. Quan s'arriba al límit, les últimes gravacions de la marca seran sobreescrites. Deixa a 0 per espai il·limitat.
it_it: Utilizzo massimo del disco in megabyte utilizzabile da questo Brand. Una volta raggiunto il limite,Le registrazioni del Brand più vecchia verranno rimosse. Impostare su zero per consentire uso del discoillimitato.

source: Max disk usage in megabytes this company can use. When limit has been reached, oldest recordings will be removed. Leave empty to allow unlimited disk usage.
ca_es: Espai d'ús màxim del disc que aquesta empresa pot utilitzar. Quan s'arriba al límit, les últimes gravacions de la empresa seran sobreescrites. Deixa a 0 per espai il·limitat.
it_it: Utilizzo massimo del disco in megabyte che questa Company può utilizzare. Quando il limite è statoraggiunto, le registrazioni più vecchie verranno rimosse. Lasciare vuoto per consentire uso del disco illimitato.

source: Max member
ca_es: Membres màxims
it_it: Massimo membro

source: Max number of digits the caller can enter. Set to 0 to disable.
ca_es: Número de dígits màxim que el trucant pot marcar. Deixa a 0 per deshabilitar.
it_it: Numero massimo di cifre che il chiamante può inserire. Impostare su 0 per disabilitare.

source: Max number of unattended calls that this queue can have. When this value has been reached, full queue logic will be activated on new calls. Leave empty to disable.
ca_es: Número màxim de trucades no ateses que pot tenir la cua. Quan s'arribi en aquest llindar, la lògica de cua total serà activada per a les noves trucades. Deixa en blanc per deshabilitar.
it_it: Numero massimo di chiamate non presidiate che questa coda può avere. Quando questo valore è stato raggiunto, la logica per la coda completa verrà attivata per le nuove chiamate. Lasciare vuoto per disabilitare.

source: Max queue length
ca_es: Màxima longitud de cua
it_it: Lunghezza massima della coda

source: Max wait time
ca_es: Temps d'espera màxim
it_it: Tempo di attesa massimo

source: Media relay
ca_es: Retransmisor de mitjà

source: Media relay Set
ca_es: Conjunt de retransmissió de mitjans
it_it: Set di Media relay

source: Media relay set
ca_es: Conjunt de retransmissors de mijtans

source: Member
ca_es: Membre
it_it: Membro

source: Member call seconds
ca_es: Segons de trucada a membre
it_it: Secondi chiamate dei membri

source: Member rest seconds
ca_es: Segons de descans de membre
it_it: Secondi rimanenti dei membri

source: Members configuration
ca_es: Configuració dels membres
it_it: Configurazione dei membri

source: Members of lower penalty will be called first. Higher penalty members will be contacted if no members of current penalty are available
ca_es: Els membres amb menys penalització seran trucats primer. Membres amb alta penalització seran trucats quan no hi hagi membres amb penalització
it_it: I membri con penalità più basse saranno chiamati per primi. Quelli con penalità maggioresaranno contattati quando non ci sono membri con penalità attuale disponibili.

source: Minimal length 10, including 3 uppercase letters, 3 lowercase letters, 3 digits and one character in '+*_-'
ca_es: Longitut mínima 10, inclou 3 lletres majúscules, 3 lletres minúscules, 3 dígits i almenys un dels següents caràcters '+*-_'
it_it: Lunghezza minima 10, tra cui 3 lettere maiuscole, 3 lettere minuscole, 3cifre e un carattere tra '+ * _-'

source: Minimal length: 2
ca_es: Longitud mínima: 2
it_it: Lunghezza minima: 2

source: Mobile Phone
ca_es: Teléfono Móvil

source: Monday
ca_es: Dilluns
it_it: Lunedi

source: Month
ca_es: Mes
it_it: Mese

source: Movement amount
ca_es: Quantitat moguda
it_it: Quantità movimento

source: Multimedia
ca_es: Multimèdia

source: Music on Hold
ca_es: Musica d'espera

source: Must start with '+' followed by zero or more digits.
ca_es: Ha de començar amb '+' continuant amb zero o més dígits.
it_it: Deve iniziare con '+' seguito da zero o più cifre.

source: Must start with sip or sips followed by colon
ca_es: Ha de començar amb sip o sips continuat per dos punts
it_it: Deve iniziare con sip o sips seguito da due punti

source: Name
ca_es: Nom
it_it: Nome

source: Name shown as source when sending mails (e.g. IvozProvider Notifications)
ca_es: El nom serà mostrat com a orígen quan s0enviin correus (exemple: Notificacions IvozProvider)
it_it: Nome visualizzato come origine quando si inviano mail (ad esempio notifiche IvozProvider)

source: National number length
ca_es: Longitud números nacionals
it_it: Lunghezza del numero nazionale

source: Need help?
ca_es: Necessites ajuda?
it_it: Hai bisogno di aiuto?

source: Next execution
ca_es: Següent execució
it_it: Prossima esecuzione

source: No Answer
ca_es: Sense resposta
it_it: Nessuna risposta

source: No Application Server available.
ca_es: No hi ha servidors d'aplicació disponibles.
it_it: Nessun Server Applicazioni disponibile.

source: No answer configuration
ca_es: Sense configuració de resposta
it_it: Configurazione senza risposta

source: No answer locution
ca_es: Sense locució de resposta
it_it: Messaggio su non risposta

source: No answer timeout
ca_es: Sense temps d'espera de resposta
it_it: Timeout Senza Risposta

source: No backup found.
ca_es: No trobo còpia de seguretat.
it_it: Non è stato trovato un backup.

source: No calls
ca_es: Ninguna llamada en curso
it_it: Non ci sono chiamate

source: No default template found
ca_es: No trobo plantilla per defecte
it_it: NOn è stato trovato un template di default

source: No input configuration
ca_es: Sense configuració d'entrada
it_it: Nessuna configurazione in input

source: No input locution
ca_es: Sense locució d'entrada
it_it: Nessun messaggio in input

source: No input target
ca_es: Sense objectiu d'entrada
it_it: Nessun target in input

source: No input target type
ca_es: Sense tipus d'objectiu d'entrada
it_it: Nessun tipo di target in input

source: No matching condition handler
ca_es: Sense coincidències del manipulador de condicions
it_it: Nessun gestore di condizioni corrispondente

source: No routing tag
ca_es: Sense etiqueta de ruta

source: None
ca_es: Cap
it_it: Nessuno

source: Notification Threshold
ca_es: Llindar de notificació
it_it: Soglia per notifica

source: Notification content
ca_es: Contingut de notificació
it_it: Contenuto della notifica

source: Notification options
ca_es: Opcions de notificació
it_it: Opzioni di notifica

source: Notification template
ca_es: Plantilla de notificació
it_it: Modello di notifica

source: Notification will be sent when the current balance is less that this value.
ca_es: S'enviarà una notificació quan el balanç econòmic estigui per sota d'aquest llindar.
it_it: La notifica verrà inviata quando il saldo corrente è inferiore a questo valore.

source: Number
ca_es: Número
it_it: Numero

source: Number data
ca_es: Data del número
it_it: Dati numerici

source: Numeric transformation
ca_es: Transformació numèriques
it_it: Trasformazione numerica

source: Ok
ca_es: D'acord

source: On-demand
ca_es: Sobre demanda
it_it: Su Richiesta

source: On-demand call recording
ca_es: Grabació sobre demanda
it_it: Registrazione delle chiamate su richiesta

source: Only if it's different from the Username
ca_es: Només si és diferent que el nom d'usuari
it_it: Solo se è diverso dal nome utente

source: Open extension
ca_es: Obrir extensió
it_it: Apri Interno

source: Opened
ca_es: Obert
it_it: Aperto

source: Optional Settings
ca_es: Configuracions opcionals
it_it: Impostazioni opzionali

source: Options
ca_es: Opcions
it_it: Opzioni

source: Origin
ca_es: Origen
it_it: Origine

source: Origins matching this list will call directly to the user.
ca_es: Els origen que figurin a la llista trucaran directe a l'usuari.
it_it: Le origini che corrispondono a questo elenco chiameranno direttamente l'utente.

source: Other Phone
ca_es: Otro Teléfono

source: Out
ca_es: Sortida

source: Out date
ca_es: Data de sortida
it_it: Data di Scadenza

source: Out of schedule configuration
ca_es: Configuració fora d'horari
it_it: Configurazione fuori orario

source: Out of schedule locution
ca_es: Locució fora d'horari
it_it: Messaggio fuori orario

source: Out of schedule target
ca_es: Destí fora d'horari
it_it: Destinazione fuori orario

source: Out of schedule target type
ca_es: Tipus de destí fora d'horari
it_it: Tipo di destinazione fuori orario

source: Outbound
ca_es: Sortida
it_it: In uscita

source: Outbound Proxy
ca_es: Intermediari de sortida
it_it: Proxy in uscita

source: Outbound Proxy IP value is not valid.
ca_es: Ip del intermediari de sortida no és vàlida.
it_it: Il valore IP del proxy in uscita non è valido.

source: Outbound configuration
ca_es: Configuració de sortida
it_it: Configurazione in uscita

source: Outgoing Configuration
ca_es: Configuració de sortida
it_it: Configurazione in uscita

source: Outgoing DDI
ca_es: DDI de sortida
it_it: DDI in uscita

source: Outgoing DDI Rule
ca_es: Regla sortida DDI
it_it: Regola DDI in uscita

source: Outgoing DDI Rule Pattern
ca_es: Patró de sortida DDI
it_it: Schema regole DDI in uscita

source: Outgoing route
ca_es: Ruta de sortida
it_it: Rotta in uscita

source: Owner
ca_es: Propietari
it_it: Proprietario

source: Page
ca_es: Pagina
it_it: Pagina

source: Parse file and import
ca_es: Analitza fitxer i importa
it_it: Analizza file e importa

source: Party
ca_es: Interlocutor

source: Password
ca_es: Contrasenya

source: Pattern
ca_es: Patró
it_it: Schema

source: Pdf file
ca_es: Fitxer PDF
it_it: File Pdf

source: Penalty
ca_es: Penalització
it_it: Penalità

source: Pending
ca_es: Pendent
it_it: In sospeso

source: Per minute rate
ca_es: Tarifa per minut
it_it: Tariffa al minuto

source: Periodic Annouce Locution
ca_es: Locució d'anunci periòdica
it_it: Messaggio Annuncio periodico

source: Periodic Announce Frequency
ca_es: Freqüència d'anunci periòdic
it_it: Frequenza periodica di annuncio

source: Personal data
ca_es: Dades personals
it_it: Dati personali

source: Phone number
ca_es: Número de telèfon
it_it: Numero di telefono

source: Phone number must be in E.164 format (prefixed by "+" symbol)
ca_es: El número de telèfon ha de ser en format E.164 (amb prefix "+")
it_it: Il numero di telefono deve essere in formato E.164 (preceduto dal simbolo "+")

source: Phones
ca_es: Teléfonos

source: Pick Up Groups
ca_es: Grups de captura
it_it: Gruppi di Pick Up

source: Pick up group
ca_es: Grup de captura
it_it: Gruppo Pick up

source: Pick up group id
ca_es: Id grup de captura
it_it: Id di Gruppo Pick up

source: Pin code
ca_es: Codi PIN
it_it: Codice PIN

source: Pin protected
ca_es: Protegit amb PIN
it_it: PIN protetto

source: Platform Portal
ca_es: Portal de platforma
it_it: Portale Piattaforma

source: Platform data
ca_es: Informació de plataforma
it_it: Dati Piattaforma

source: Please select only uninvoiced calls
ca_es: Selecciona només les trucades no facturades
it_it: Per favore, scegli solo chiamate non fatturate

source: Please, choose a file to import
ca_es: Selecciona un fitxer per importar
it_it: Per favore, scegli un file da importare

source: Please, type a duration in seconds
ca_es: Introdueix la durada en segons
it_it: Per favore, digita una durata in secondi

source: Please, type a phone number
ca_es: Introdueix un número de telèfon
it_it: Per favore, digita un numero di telefono

source: Policy
ca_es: Política

source: Postal address
ca_es: Adreça postal
it_it: Indirizzo postale

source: Postal code
ca_es: Codi postal
it_it: Codice postale

source: Postpaid
ca_es: Postpagament
it_it: Postpagato

source: Prefix must be '+' and numeric-only
ca_es: El prefixe ha de ser '+' i números
it_it: Il prefisso deve essere '+' e solo numerico

source: Prefix used for national out of area calls.
ca_es: Prefix utilitzat per trucades fora d'àrea.
it_it: Prefisso utilizzato per le chiamate nazionali fuori area.

source: Prepaid
ca_es: Prepagament
it_it: Prepagato

source: Prepaid Balance
ca_es: Saldo prepagament
it_it: Saldo prepagato

source: Prevent missed calls
ca_es: Evita les trucades perdudes
it_it: Prevenire le chiamate perse

source: Price
ca_es: Preu
it_it: Prezzo

source: Prices Help
ca_es: Ajuda de preus
it_it: Guida ai prezzi

source: Priority
ca_es: Prioritat
it_it: Priorità

source: Problems unbanning address
ca_es: Se produjo un error al desbloquedar la dirección

source: Processing
ca_es: Processant
it_it: Elaborazione

source: Proto
ca_es: Protocol

source: Provider filters
ca_es: Filtros de proveedor
it_it: Filtri provider

source: Providers
ca_es: Proveïdors

source: Province
ca_es: Província
it_it: Provincia

source: Provisioning Info
ca_es: Informació aprovisionament
it_it: Informazioni di provisioning

source: Pseudo-prepaid
ca_es: Pseudo-prepagament
it_it: Pseudo-prepagato

source: QR Code
ca_es: Codi QR

source: Quality measuring
ca_es: Mesura de qualitat
it_it: Misuratore qualità

source: Quantity
ca_es: Quantitat
it_it: Quantità

source: Queue
ca_es: Cua
it_it: Coda

source: Queue Member
ca_es: Membre de la cua
it_it: Membro coda

source: R-URI pattern
ca_es: Patró R-URI
it_it: Schema R-URI

source: RTP encryption
ca_es: Cifrar RTP

source: Random
ca_es: Aleatori

source: Random Contact Username
ca_es: Nom d'usuari de contacte aleatori
it_it: Nome utente contatto casuale

source: Rate
ca_es: Tarifa

source: Rating Plan
ca_es: Pla de preus

source: Rating Profile
ca_es: Perfil de preus
it_it: Profilo di tariffazione

source: Rating Profile Tester
ca_es: Provador de perfils de preus
it_it: Tester del profilo di tariffazione

source: Rating plan
ca_es: Pla de preus
it_it: Piano tariffario

source: Read
ca_es: Lectura
it_it: Lettura

source: Read Only Access
ca_es: Acceso de solo lectura
it_it: Accesso in sola lettura

source: Read access successfully granted.
ca_es: Acceso de solo lectura oportado
it_it: Accesso in lettura correttamente assegnato.

source: Realm
ca_es: Regne

source: Record call
ca_es: Grava la trucada
it_it: Registra chiamata

source: Record successfully saved.
ca_es: Registro salvado correctamente.

source: Recorded file
ca_es: Fitxer de gravació
it_it: File registrato

source: Recording data
ca_es: Data de gravació
it_it: Registrazione dei dati

source: Recording extension
ca_es: Extensió gravada
it_it: Interno di registrazione

source: Register
ca_es: Registre

source: Registrar Server URI
ca_es: URI Servidor de registre
it_it: URI server di registrazione

source: Registry data
ca_es: Informació de registre
it_it: Dati del Register

source: Regular Expression
ca_es: Expressió regular
it_it: Espressione regolare

source: Replace expr
ca_es: Expressió substituïda
it_it: Sostituisci expr

source: Rerate call
ca_es: Retarifica trucada
it_it: Rivaluta chiamata

source: Resend
ca_es: Reenvia
it_it: Invia di nuovo

source: Resend fax
ca_es: Reenvia fax
it_it: Invia di nuovo fax

source: Resend to
ca_es: Reenvia a
it_it: Invia di nuovo a

source: Reset default template?
ca_es: Reiniciar plantilla per defecte?
it_it: Azzera il template di default?

source: Residential
ca_es: Residencial

source: Residential Device
ca_es: Dispositiu residencial

source: Restore backup
ca_es: Restaura còpia de seguretat
it_it: Ripristina backup

source: Restore backup from
ca_es: Restaura còpia de seguretat des de
it_it: Riprostina backup da

source: Restore default template
ca_es: Restaura plantilla per defecte
it_it: Ripristina modello predefinito

source: Restore last backup
ca_es: Restaura última còpia de seguretat
it_it: Ripristina ultimo backup

source: Restricted
ca_es: Restringido
it_it: Limitato

source: Restricted administrators have read-only permissions by default. This privileges can be fine-tuned in <i>List of Administrator access privileges</i> subsection. <br><br><b>Global/Brand</b> restricted administrators have no web access and can only be used for API integrations. <br><br><b>Client</b> restricted administrators can be used both for API integrations and limited web access.
ca_es: Los administradores restringidos tienen permisos de solo lectura por defecto. Estos privilegios se pueden afinar en <i>Listado de Controles de acceso de administrador</i>. <br><br>Los administradores <b>globales/de marca</b> no tienen acceso web y solo se pueden utilizar para integraciones vía API. <br><br>Los administradores restringidos de <b>cliente</b> se pueden utilizar tanto para integraciones vía API como para acceso limitado al portal web.
it_it: Gli amministratori con limitazioni, hanno accesso in sola lettura di default. Questi diritti possono essere aggiustati nella sezione <i>Elenco dei privilegi di accesso dell'amministratore</i> . <br><br>Gli amministratori <b>Global/Brand</b> con restrizioni, non hannoaccesso web e possono essere usati solo per integrazioni API. <br><br> Gli amministratori <b>Client</b> possono essere usati sia per integrazioni API che per accesso limitato al web.

source: Results
ca_es: Resultats
it_it: Risultati

source: Retail specific
ca_es: Específic al detall
it_it: Account Retail

source: Revoke %s
ca_es: Revocar %s
it_it: Revoca %s

source: Revoke Access
ca_es: Revocar acceso
it_it: Revoca Accesso

source: Ring all
ca_es: Trucar a tots

source: Ring all timeout
ca_es: Temps d'espera trucada a tots
it_it: Timeout Ring all

source: Round Robin
ca_es: Robin rodó

source: Round Robin memory
ca_es: Memòria robin rodó
it_it: Round Robin con memoria

source: Route type
ca_es: Tipus de ruta
it_it: Tipo Rotta

source: Routes with higher priority won't be evaluated. Those with same priority will be evaluated.
ca_es: Las rutas con mayor prioridad no se aplicarán. Las rutas con la misma prioridad, sí.
it_it: Le rotte con priorità più alta non verranno valutate. Quelle con stessa priorità saranno valutate.

source: Routing
ca_es: Encaminament

source: Routing configuration
ca_es: Configuració d'encaminament
it_it: Configurazione del routing

source: Routing endpoints
ca_es: Punt final d'encaminament
it_it: Schema Routing

source: Routing tools
ca_es: Eines d'encaminament
it_it: Strumenti per Routing

source: Rule
ca_es: Regla
it_it: Regola

source: Rules to manipulate outgoingDDI when user directly calls to external numbers.
ca_es: Regles de manipulació de DDI de sortida quan l'usuari truqui directament a números externs.
it_it: Regole per manipolare il DDI in uscita quando l'utente chiama direttamente numeri esterni.

source: Run template
ca_es: Executa plantilla
it_it: Esegui modello

source: SIP Domain can't be empty
ca_es: Domini SIP no pot estar buit
it_it: Il dominio SIP non può essere vuoto

source: SIP Proxy
ca_es: Intermediari SIP

source: SIP address
ca_es: Adreça SIP
it_it: Indirizzo SIP

source: SIP domain
ca_es: Domini SIP

source: Saturday
ca_es: Dissabte
it_it: Sabato

source: Screen Extension
ca_es: Extensió de pantalla
it_it: Screen Interno

source: Seconds from the beginning of the call when this rate will be activated.
ca_es: Segons des del principi de la trucada en que la tarifa estarà activada.
it_it: Secondi dall'inizio della chiamata quando questa tariffa sarà attivata.

source: Security
ca_es: Seguretat
it_it: Sicurezza

source: Select Brand
ca_es: Selecciona marca
it_it: Seleziona Brand

source: Select Client
ca_es: Selecciona Client
it_it: Seleziona cliente

source: Select a country to allow all IPs. Leave it blank if you want to allow just specific IP/ranges.
ca_es: Selecciona un país para permitir todas sus IPs. No lo selecciones si quieres permitir solo algunas IPs o rangos.

source: Select destination group
ca_es: Selecciona grup de destinació
it_it: Seleziona il gruppo di destinazione

source: Select destination pattern
ca_es: Selecciona patró de destinació
it_it: Seleziona lo schema di destinazione

source: Select file to import
ca_es: Selecciona fitxer per importar
it_it: Seleziona il file da importare

source: Select the brand you want to emulate.
ca_es: Selecciona la marca que vols emular.
it_it: Seleziona il Brand che vuoi emulare.

source: Select the client you want to emulate
ca_es: Selecciona el client que vols emular
it_it: Seleziona il cliente che vuoi emulare

source: Selected weight is already in use
ca_es: El pes escollit està en ús

source: Send
ca_es: Envia
it_it: Invia

source: Send PAI
ca_es: Envia PAI
it_it: Invia PAI

source: Send RPID
ca_es: Envia RPID
it_it: Invia RPID

source: Send by email
ca_es: Envia per email
it_it: Invia per email
