Repository: irontec/ivozprovider
Catalog: web/admin/application/languages/*/*.po
Languages: ca_es, it_it

source: Email address that will be notified when 80% of the configured limit has been reached.
ca_es: Adreça de correu electrònic on es notificarà quan s'hagi consumit el 80% del límit.
it_it: Indirizzo email che verrà contattato quando l'80% del limite configurato sarà raggiunto.

source: Email already in use
ca_es: Adreça de correu ja en us
it_it: Email già in uso

source: Emulate %s
ca_es: Emular %s
it_it: Emula %s

source: Emulate Brand %s
ca_es: Emula marca %s
it_it: Emula Brand %s

source: Emulate Company %s
ca_es: Emula companyia %s
it_it: Emula Company %s

source: Emulate Residential Client %s
ca_es: Emula client residencial %s
it_it: Emula il Residential Client %s

source: Emulate Retail Client %s
ca_es: Emula client al detall %s
it_it: Emula Client Retail %s

source: Emulate Wholesale Client %s
ca_es: Emula client a l'engròs %s
it_it: Emula Client Wholesale %s

source: Enable T.38 passthrough
ca_es: Habilita passarel·la T.38
it_it: Abilita passthrough T.38

source: Enable calling from non-granted IP addresses for this user. It limits the number of outgoing calls to avoid toll-fraud. 'None' value makes outgoing calls unlimited as long as company IP policy is fulfilled.
ca_es: Permet a aquest usuari trucar des d'IPs no autoritzades. Es limita el número de trucades sortints per evitar frau. Seleccionant 'Cap' es permet un número il·limitat de trucades sempre i quan es compleixi la política de restricció d'IPs de l'empresa.
it_it: Abilita la chiamata da indirizzi IP non assegnati a questo utente. Limita ilnumero di chiamate in uscita per evitare frodi. Il valore 'None' rende illimitate le chiamate fintanto che la Company policy IP è soddisfatta.

source: Enable this option to display billing details in Client's portal (e.g. invoices, prices, etc.).
ca_es: Habilite esta opción para mostrar detalles de factura en el portal de cliente (e.g. facturas, precio de llamadas, etc.)

source: Enable this option to display delete button in Client's portal call recordings section.
ca_es: Activa aquesta opció per mostrar el botó d’eliminació a la secció d’enregistrament de trucades al portal del client.
it_it: Abilitare questa opzione per visualizzare il pulsante Elimina nella sezione registrazioni chiamate del portale del cliente.

source: Enable to force audio encryption. Call won't be established unless it is encrypted.
ca_es: Activar para forzar el cifrado del audio. La llamada no se establecerá en caso de no ser posible cifrar su audio.

source: Enable to force numeric transformation on numbers in Extensions or numbers matching any Friend regexp. Otherwise, those numbers won't traverse numeric transformations rules.
ca_es: Habilitar para forzar las tranformaciones numéricas para los números considerados internos.

source: Enabled
ca_es: Habilitat
it_it: Abilitato

source: Enabled (SIP INFO + DTMFs)
ca_es: Habilitat (SIP INFO + DTMFs)
it_it: Abilitato (SIP INFO + DTMFs)

source: Enabled (SIP INFO)
ca_es: Habilitat (SIP INFO)
it_it: Abilitato (SIP INFO)

source: End date
ca_es: Data fi
it_it: Data Fine

source: End date must be later or equal than start date.
ca_es: 'Data final' ha de ser igual o més gran que la 'data inici'.
it_it: Data Fine non valida; deve essere uguale o maggiore di Data Inizio.

source: Endpoint id
ca_es: Dispositiu final Id

source: Endpoint type
ca_es: Tipus dispositiu final
it_it: Tipo Endpoint

source: Ensure the preview below is right before you proceed
ca_es: Assegura que la previsualització és correcte abans de procedir
it_it: Assicurati che l'anteprima sotto sia corretta prima di procedere

source: Enter number patterns in E.164 format (plus symbol must be escaped).
ca_es: Entra patrons de numeració en format E.164 (el símbol + cal ignorar-lo).
it_it: Inserisci i pattern numerici nel formato E.164 (il simbolo più deve essere preceduto dal carattere di escape).

source: Entity
ca_es: Entidad
it_it: Voce

source: Entry
ca_es: Entrada
it_it: Voce

source: Entry information
ca_es: Entrada d'informació
it_it: Informazioni sulla voce

source: Error configuration
ca_es: Error de configuració
it_it: Errore di configurazione

source: Error reloading modules. Please reload modules manually.
ca_es: Error re-carregant mòduls. Si et plau re-carrega'ls manualment.
it_it: Errore nel ricaricare i moduli. Ricarica i moduli manualmente.

source: Error saving record
ca_es: Error salvando el registro

source: Error target
ca_es: Error d'objectiu
it_it: Errore target

source: Error target type
ca_es: Error de tipus d'objectiu
it_it: Tipo Errore target

source: Event date
ca_es: Data de l'esdeveniment
it_it: Data evento

source: Exact URL that will be accessed.
ca_es: Direcció URL exacte per on s'accedirà.
it_it: URL esatto a cui si accederà.

source: Excluded Extension
ca_es: Extensió excloses
it_it: Interno escluso

source: Expire
ca_es: Expira
it_it: Scade

source: Export to CSV
ca_es: Exporta a CSV
it_it: Esporta in CSV

source: Extension
ca_es: Extensió
it_it: Interno

source: Extension dialing
ca_es: Marcatge d'extensió
it_it: Interno chiamante

source: External
ca_es: Externa
it_it: Esterno

source: External call
ca_es: Trucada externa
it_it: Chiamata esterna

source: External call filter
ca_es: Filtre trucada externa
it_it: Filtro chiamate esterne

source: Externally rated
ca_es: Tarificació externa
it_it: Tariffate esternamente

source: Externally rated cannot be disabled as some DDIs wants to bill inbound calls.
ca_es: No es pot deshabilitar la tarifació externa ja que hi ha alguns DDI amb tarificació entrant.
it_it: La tariffazione esterna non può essere disabilitata poiché alcuni DDI richiedono fatturazione delle chiamate in entrata.

source: Externally rater custom options
ca_es: Opcions personalitzades de tarifació externa
it_it: Opzioni personalizzate Tariffatore Esterno

source: Externally rater options
ca_es: Opcions de tarifació externa
it_it: Opzioni tariffarore esterno

source: Extra Configuration
ca_es: Configuració addicional
it_it: Configurazione extra

source: Extra Information
ca_es: Informació addicional
it_it: Ulteriori Informazioni

source: Failover and load-balancing
ca_es: Contingència i balanceig de càrrega
it_it: Failover e bilanciamento del carico

source: Fallback Outgoing DDI
ca_es: DDI de sortida de alternatiu
it_it: DDI in uscita di Riserva

source: Fax Notification
ca_es: Notificació de fax
it_it: Notifica Fax

source: Fax resent
ca_es: Fax reenviat
it_it: Fax re-inviato

source: Faxfile
ca_es: Fitxer de Fax
it_it: File fax

source: Features
ca_es: Característiques
it_it: Funzionalità

source: Fewest calls
ca_es: Menys ateses
it_it: Meno Chiamate

source: Fields with * are required
ca_es: Els camps amb * son obligatoris
it_it: I campi con * sono obbligatori

source: File
ca_es: Fitxer

source: File for play
ca_es: Fitxer per reproduir
it_it: File da riprodurre

source: File imported
ca_es: Fitxer importat
it_it: File importato

source: File imported successfully
ca_es: Fitxer importat correctament
it_it: File importato correttamente

source: File partially imported
ca_es: Fitxer parcialment importat
it_it: File parzialmente importato

source: Filter by IP address
ca_es: Filtrar per adreça IP
it_it: Filtra per indirizzo IP

source: Filter fields
ca_es: Filtrado de elementos
it_it: Filtra campi

source: Filter's Out of schedule Locution
ca_es: El filtre es fora de l'horari de locució
it_it: Messaggio per Filtro fuori orario

source: Filter's Out of schedule Routing
ca_es: El filtre es fora de l'horari d'enrutament
it_it: Routing per Filtro fuori orario

source: Filtering info
ca_es: Informació de filtreig
it_it: Informazioni sul filtro

source: Filters
ca_es: Filtros
it_it: Filtri

source: Filters data
ca_es: Filtres de dates
it_it: Dati filtri

source: Fixed cost
ca_es: Cost fix
it_it: Costo fisso

source: For instance:
ca_es: Per la instància:
it_it: Ad esempio:

source: Force Clid
ca_es: Forçar CLid
it_it: Forza Clid

source: Force DDI
ca_es: Forçar DDI
it_it: Forza DDI

source: Forced DDI
ca_es: DDI forçat
it_it: DDI Forzato

source: Forward Fax
ca_es: Re-enviament de fax
it_it: Inoltra Fax

source: Frequency
ca_es: Freqüència
it_it: Frequenza

source: Friday
ca_es: Divendres
it_it: Venerdì

source: Friend
ca_es: Amic
it_it: Amico

source: Friend Pattern
ca_es: Patró amic
it_it: Schema amico

source: Friend value
ca_es: Valor d'amic
it_it: Valore amico

source: From 1 to 3 digits ended by # symbol
ca_es: D'1 a 3 dígits acabat amb el símbol '#'
it_it: Da 1 a 3 cifre, terminato dal simbolo #

source: From 1 to 3 digits ended by * symbol
ca_es: D'1 a 3 dígits acabat amb el símbol '*'
it_it: Da 1 a 3 cifre, terminato dal simbolo *

source: From address
ca_es: Des de la direcció
it_it: Indirizzo From

source: From configuration
ca_es: Des de la configuració
it_it: Configurazione From

source: From domain
ca_es: Domini originari
it_it: Dominio From

source: From name
ca_es: Nom originari
it_it: Nome From

source: From optional customization
ca_es: From personalització opcional
it_it: Personalizzazione From

source: From pattern
ca_es: From patró
it_it: Schema From

source: From user
ca_es: From usuari
it_it: Utente From

source: Full Queue configuration
ca_es: Configuració de cua completa
it_it: Configurazione Coda Piena

source: Full queue Locution
ca_es: Locució cua completa
it_it: Messaggio per Coda Piena

source: Full queue route
ca_es: Ruta cua completa
it_it: Rotta per Coda Piena

source: Future brands will have services enabled with this codes by default
ca_es: Les marques futures utilitzaran aquest codis de servei per defecte
it_it: Brand futuri avranno servizi abilitati con questo codice per impostazione predefinita

source: Generate %s
ca_es: Genera %s
it_it: Genera %s

source: Generate Transformation Rules automatically
ca_es: Genera regles de transformació automàticament
it_it: Genera automaticamente le regole di trasformazione

source: Generate invoice
ca_es: Genera factura
it_it: Genera fattura

source: Generic Match List
ca_es: Llista de coincidències
it_it: Match List generica

source: Generic Music on Hold
ca_es: Música d'espera genèrica
it_it: Music on Hold Generica

source: Generic Service
ca_es: Servei genèric

source: Generic URL Pattern
ca_es: Patró URL genèric
it_it: Pattern URL generico

source: Generic template
ca_es: Pantilla genèrica
it_it: Modello generico

source: GeoIP allowed countries
ca_es: GeoIP países permitidos

source: Geographic Configuration
ca_es: Configuració geogràfica
it_it: Configurazione geografica

source: Global Configuration
ca_es: Configuració global
it_it: Configurazione Globale

source: Global Special Number
ca_es: Número especial Global
it_it: Numero Speciale Globale

source: God
ca_es: Déu
it_it: Super Utente

source: Grant Read Only %s
ca_es: Dar acceso de solo lectura %s
it_it: Concedi Solo Lettura %s

source: Grant Write %s
ca_es: Dar acceso de escritura %s
it_it: Concedi Scrittura %s

source: Group
ca_es: Grup
it_it: Gruppo

source: Group belonging
ca_es: Pertinença a grups
it_it: Appartenenza al gruppo

source: Hash based
ca_es: Basat en Hash
it_it: Basato su Hash

source: Historic external call
ca_es: Històric de trucade externe
it_it: Cronologia chiamata esterna

source: Holiday date
ca_es: Festiu
it_it: Data festività

source: Holiday date range
ca_es: Rango de festivo

source: Holiday importer system
ca_es: Sistema d'importació de festius
it_it: Sistema di importazione festività

source: Holiday locution
ca_es: Locució en festiu
it_it: Messaggio festività

source: Holiday target
ca_es: Destí en festiu
it_it: Destinazione Holiday

source: Holiday target type
ca_es: Tipus de destí de festiu
it_it: Tipo destinazione Holiday

source: Holidays configuration
ca_es: Configuració de festius
it_it: Configurazione delle festività

source: Host
ca_es: Amfitrió

source: How long are the normal phone numbers called inside this country?
ca_es: Quanta estona seran trucats els telèfons dins d'aquest país?
it_it: Quanto sono lunghi i numeri di telefono chiamati in questo paese?

source: Hunt Group
ca_es: Grup de salt
it_it: Gruppo di Chiamata

source: IP Address
ca_es: Adreça IP

source: IP address
ca_es: Adreça IP

source: IP filter blocked address
ca_es: Bloqueo filtrado por IP
it_it: Indirizzo bloccato dal filtro IP

source: IP or domain name (port with ':')
ca_es: IP o nom de domini (port amb ':')
it_it: IP o nome di dominio (porta con ':')

source: IVR entry
ca_es: Entrada IVR
it_it: Voce IVR

source: Id not found
ca_es: Id no trobat
it_it: ID non trovato

source: If caller matches any selected matchlist, this criteria is considered fulfilled.
ca_es: Si el llamante cumple alguna de las listas de coincidencia seleccionadas, el criterio se considera superado.
it_it: Se il chiamante corrisponde ad una qualsiasi delle matchlist selezionate, questo criterio è considerato soddisfatto.

source: If calling date is marked as holiday in any selected calendar, this criteria is considered fulfilled. Calendar periods are not taken into account.
ca_es: Si la fecha está marcada como festiva en alguno de los calendarios seleccionados, el criterio se considera superado. Los eventos de horario no se tendrán en cuenta.
it_it: Se la data della chiamata è segnata come festivo in uno dei calendari selezionati, questo criterio è soddisfatto. I periodi del calendario non sono considerati.

source: If calling time is included in any selected schedules, this criteria is considered fulfilled.
ca_es: Si la hora está incluida en alguno de los horarios seleccionados, el criterio se considera superado.
it_it: Se l'ora chiamata è inclusa in una delle pianificazioni selezionate, questo criterio è considerato soddisfatto.

source: If no queue member answers before time this seconds, the timeout queue logic will be activated. Leave empty to disable.
ca_es: Quan cap membre atengui a cap trucada durant aquest temps, el temps d'espera de la cua lògica serà activat. Deixar en blanc per deshabilitar.
it_it: Se nessun membro della coda risponde entro il tempo in secondi, la logica della coda di timeout sarà attivata. Lasciare vuoto per disabilitare.

source: If one of selected route locks is open, this criteria is considered fulfilled.
ca_es: Si uno de los candados seleccionados está abierto, el criterio se considera superado
it_it: Se uno dei blocchi rotta selezionati è aperto, questo criterio è considerato soddisfatto.

source: If set to 'Yes', set destination (R-URI and To) to called DDI when calling to this residential device.
ca_es: Si activado, se utilizará el DDI llamado como destino de las llamadas a este dispositivo residencial (cabeceras R-URI y To).
it_it: Se impostato a 'Si', imposta il DDI chiamato come destinazione (R-URI e To) per le chiamate verso questo residential device.

source: If set to 'Yes', set destination (R-URI and To) to called DDI when calling to this retail account.
ca_es: Si activado, se utilizará el DDI llamado como destino de las llamadas a esta cuenta retail (cabeceras R-URI y To).
it_it: Se impostato a 'Si', imposta il DDI chiamato come destinazione (R-URI e To) per le chiamate verso questo account retail.

source: If set to 'Yes', set destination (R-URI and To) to called DDI/number when calling to this friend.
ca_es: Si activado, se utilizará el DDI llamado como destino de las llamadas a este friend (cabeceras R-URI y To).
it_it: Se impostato a 'Si', imposta il DDI chiamato come destinazione (R-URI e To) per le chiamate verso questo friend.

source: Ignore
ca_es: Ignora
it_it: Ignora

source: Ignore first line.
ca_es: Ignora la primera línia.
it_it: Ignora la prima riga.

source: Import %s
ca_es: Importa %s
it_it: Importa %s

source: Import file
ca_es: Importar fitxer
it_it: Importa file

source: Import process enqueued
ca_es: Procés d'importació en cua
it_it: Processo Importazione accodato

source: Imported
ca_es: Importat
it_it: Importato

source: Imported file
ca_es: Fitxer importat
it_it: File importato

source: Importer status
ca_es: Estat de l'importació
it_it: Stato dell'importatore

source: In
ca_es: Entrada

source: In Progress
ca_es: En curs
it_it: In corso

source: In case of colliding prefixes, destination rate with highest weight will be used.
ca_es: En cas que hi hagi prefixes coincidents, es tarifarà d'acord amb la tarifa amb més pes.
it_it: In caso di prefissi collidenti, la tariffa di destinazione sarà quella con il peso più elevato.

source: In date
ca_es: Data inicial
it_it: Data In

source: In progress
ca_es: En procés
it_it: In corso

source: Inbound
ca_es: Entrada
it_it: In entrata

source: Inbound Calls cannot be billed as DDI Provider is not externally rated.
ca_es: Trucades entrants no poden ser facturats ja que el proveïdor de DDI no està facturant externament.
it_it: Le chiate in entrata non possono essere contabilizzate poichè il Provider DDI non è tariffato esternamente

source: Inbound configuration
ca_es: Configuració d'entrada
it_it: Configurazione in entrata

source: Incoming numbers that match this lists will be always ACCEPTED without checking this filter configuration.
ca_es: Les trucades entrants amb número coincident en aquesta llista seran SEMPRE ACCEPTADES sense verificar aquest filtre en la configuració.
it_it: I numeri in entrata che corrispondono a questi elenchi saranno sempre ACCETTATI senza verificare questa configurazione del filtro.

source: Incoming numbers that match this lists will be always REJECTED without checking this filter configuration.
ca_es: Les trucades entrants amb número coincident en aquesta llista seran SEMPRE REBUTJADES sense verificar aquest filtre en la configuració.
it_it: I numeri in entrata che corrispondono a questi elenchi saranno sempre RESPINTI senza verificare questa configurazione del filtro.

source: Inconditional
ca_es: Incondicional
it_it: Incondizionato

source: Infrastructure
ca_es: Infraestructura
it_it: Infrastruttura

source: Insert your username
ca_es: Introdueix el teu nom d'usuari
it_it: Inserisci il tuo nome utente

source: Instead of getting the caller from PAI/RPID headers, this clid will be used (and will be adapted using carrier's numeric transformations).
ca_es: En comptes d'obtenir l'origen de les capçaleres PAI/RPID, es forçarà aquest origen (i s'adaptarà utilitzant transformacions numèriques de l'operador).
it_it: Invece di recuperare il chiamante dall'header PAI/RPID, verrà usato il seguente clid (e verrà modificato secondo lo schema di trasformazione del Carrier)

source: Inter vPBX
ca_es: Intra vPBX
it_it: Tra vPBX

source: Internal
ca_es: Interna
it_it: Interno

source: International Code
ca_es: Codi internacional
it_it: Codice internazionale

source: Interval in seconds to increase call cost.
ca_es: Interval en segons que incrementa el preu de la trucada.
it_it: Intervallo in secondi di incremento del costo delle chiamate.

source: Interval start
ca_es: Inici de l'interval
it_it: Inizio intervallo

source: Invalid IP address, discarding value.
ca_es: Adreça IP no vàlida, descartant el valor.
it_it: Indirizzo IP non valido, valore scartato.

source: Invoice
ca_es: Factura
it_it: Fattura

source: Invoice Notification
ca_es: Notificació de factura
it_it: Notifiche Fattura

source: Invoice data
ca_es: Dades de facturació
it_it: Dati della fattura

source: Invoice has been enqueued. It will be generated as soon as posible.
ca_es: La factura està en cua. Serà generada el més aviat possible.
it_it: La fattura è stata accodata e verrà generata non appena possibile.

source: Invoice number sequence
ca_es: Seqüència de numero factura
it_it: Sequenza numerica fattura

source: Invoice scheduler
ca_es: Planificador de factura
it_it: Pianificazione fatture

source: Invoice template
ca_es: Plantilla de factura
it_it: Modello di fattura

source: Invoice template tester
ca_es: Provador de plantilla de factures
it_it: Tester modello di fattura

source: Invoice(s) enqueued
ca_es: Factura/es encarregades
it_it: Fattura(e) accodata(e)

source: Invoiced calls can't be metered again
ca_es: Les trucades facturades no poden ser retarificades
it_it: Le chiamate fatturate, non possono essere ricalcolate

source: Invoices have been enqueued. They will be generated as soon as posible.
ca_es: S'han encarregat les factures. Es generaran el més aviat possible.
it_it: Le fatture sono state accodate e verranno generate non appena possibile.

source: Invoicing
ca_es: Factures
it_it: Fatturazione

source: Ip addr
ca_es: Adreça IP
it_it: Indirizzo IP

source: Is boss
ca_es: Administrador

source: Is sent in the username of Contact header in generated REGISTER.
ca_es: S'envia al nom d'usuari de la capçalera Contact al REGISTER generat.
it_it: Inviato nel nome utente del Contact header nel REGISTER generato.

source: Iteration
ca_es: Iteració
it_it: Iterazione

source: Keep Original DDI
ca_es: Mantén DDI original
it_it: Mantieni DDI originale

source: Language
ca_es: Idioma
it_it: Lingua

source: Last execution
ca_es: Última execució
it_it: Ultima esecuzione

source: Last notification sent on
ca_es: Última notificació enviada
it_it: Ultima notifica inviata il

source: Last provision date
ca_es: Última data de provisió
it_it: Ultima data provisioning

source: Last time banned
ca_es: Último bloqueo
it_it: Ultima volta che è stato bannato

source: Lastname
ca_es: Cognom
it_it: Cognome

source: Latest value
ca_es: Últim valor
it_it: Ultimo valore

source: Least recent
ca_es: Menys recent
it_it: Meno recente

source: Leave empty if no mail is needed (just generate CSV).
ca_es: Deixa en blanc si no fa falta enviar per correu (només genera CSV).
it_it: Lasciare vuoto se non è necessaria alcuna email (solo generazione CSV).

source: Leave empty to send to Host field
ca_es: Deixa en blanc per enviar al camp Amfitrió
it_it: Lasciare vuoto per inviare al campo Host

source: Leave empty to use the suggested default
ca_es: Deixa en blanc per utilitzar els valors per defecte suggerits
it_it: Lasciare vuoto per usare l'impostazione predefinita suggerita

source: Limit max daily usage.
ca_es: Limita l'ús màxim diari.
it_it: Limitare il consumo giornaliero

source: Limits external incoming and outgoing calls to this value (0 for unlimited).
ca_es: Limita les trucades entrants i sortints a aquest valor (0 per il·limitades).
it_it: Limita le chiamate esterne entranti e uscenti a questo valore (0 per illimitate).

source: Limits received calls when already handling this number of calls. Set 0 for unlimited.
ca_es: Limita el número de trucades entrants quan se superi. Introdueix 0 per infinit.
it_it: Limita chiamate ricevute quando raggiunto questo numero di chiamate. 0 per illimitate.

source: List %s %2s
ca_es: Llista %s %2s
it_it: Elenco %s %2s

source: List of %s
ca_es: Llista de %s
it_it: Elenco di %s

source: List of %s %2s
ca_es: Llista de %s %2s
it_it: Elenco di %s %2s

source: List of Incoming %s %s
ca_es: Llista d'entrada %s %s
it_it: Elenco delle Entranti %s %s

source: List of Outgoing %s %s
ca_es: Llista de sortida %s %s
it_it: Elenco delle Uscenti %s %s

source: Listen to File
ca_es: Escoltar fitxer
it_it: Ascolta file

source: Listen to MoH
ca_es: Escoltar MoH
it_it: Ascolta MoH

source: Load file
ca_es: Carrega fitxer
it_it: Carica file

source: Loading
ca_es: Carregant
it_it: Caricamento

source: Local address used in SIP signalling with this DDI Provider.
ca_es: IP local utilizada en la señalización SIP con este proveedor de DDIs.
it_it: Indirizzo locale usato nella segnalazione SIP con questo DDI Provider.

source: Local address used in SIP signalling with this carrier.
ca_es: IP local utilizada en la señalización SIP con este operador.
it_it: Indirizzo locale usato nella segnalazione SIP con questo Carrier.
