Repository: irontec/ivozprovider
Catalog: web/admin/application/languages/*/*.po
Languages: ca_es, it_it

source: Send new %s
ca_es: Envia nous %s
it_it: Invia nuovo %s

source: Send to IP[:PORT] instead of SIP Proxy address
ca_es: Envia a IP[:PORT] enlloc de l'adreça intermediària del Proxy
it_it: Invia a IP [: PORT] invece di SIP Proxy address

source: Sent to
ca_es: Envia a
it_it: Inviato a

source: Sequence length
ca_es: Longitud de seqüència
it_it: Lunghezza della sequenza

source: Service
ca_es: Servei
it_it: Servizio

source: Service Information
ca_es: Informació de servei
it_it: Informazioni di servizio

source: Service has extra arguments
ca_es: El servei té arguments extres
it_it: Il servizio ha argomenti extra

source: Set column configuration and continue.
ca_es: Configura les columnes i continua.
it_it: Imposta la colonna di configurazione e continua.

source: Set to 'No' to call only to latest registered SIP device instead of making all registered devices ring.
ca_es: Configurar a 'No' para recibir las llamadas solamente en el último dispositivo SIP que se haya registrado. En caso contrario, sonarán todos los dispositivos con registro activo de forma simultánea.

source: Settings
ca_es: Configuracions
it_it: Impostazioni

source: Simulate a call
ca_es: Simula una trucada
it_it: Simula una chiamata

source: Source
ca_es: Origen
it_it: Sorgente

source: Source number header
ca_es: Capçalera de número d'origen
it_it: Intestazione numero sorgente

source: Special Number
ca_es: Número especial
it_it: Numero Speciale

source: Special treatments
ca_es: Tratamientos especiales
it_it: Trattamento Speciale

source: Specific
ca_es: Específico
it_it: Specifico

source: Specific Template
ca_es: Plantilla específica
it_it: Modello specifico

source: Specific URL Pattern
ca_es: Patró especific URL
it_it: Specifica schema URL

source: Start date
ca_es: Data d'inici
it_it: Data Inizio

source: Start time
ca_es: Temps d'inici
it_it: Ora di inizio

source: Static
ca_es: Estàtic
it_it: Statico

source: Status
ca_es: Estat
it_it: Stato

source: Strategy
ca_es: Estrategia
it_it: Strategia

source: Subject
ca_es: Tema
it_it: Oggetto

source: Substitution variables
ca_es: Variables de substitució
it_it: Variabili di sostituzione

source: Success locution
ca_es: Locucions d'èxit
it_it: Messaggio per Successo

source: Sunday
ca_es: Diumenge
it_it: Domenica

source: Symbol
ca_es: Símbol
it_it: Simbolo

source: Tag
ca_es: Etiqueta

source: Target
ca_es: Objectiu
it_it: Destinazione

source: Target type
ca_es: Tipus d'objectiu
it_it: Tipo Destinazione

source: Target type value
ca_es: Valor de tipus d'objectiu
it_it: Valore Tipo Destinazione

source: Tarificate Calls?
ca_es: Tarifar trucades?
it_it: Tariffare chiamate?

source: Tarificator Job started
ca_es: Tasca de tarifació inicia
it_it: Tariffazione iniziata

source: Tax rate
ca_es: Taxa d'impost
it_it: Aliquota fiscale

source: Template Type
ca_es: Tipus de plantilla
it_it: Tipo di modello

source: Template field can not be null.
ca_es: Camp de plantilla no pot ser nul.
it_it: Il campo Modello non può essere nullo.

source: Template footer
ca_es: Peu de plantilla
it_it: Modello piè di pagina

source: Template header
ca_es: Capçalera de plantilla
it_it: Intestazione del modello

source: Template headers and footers help
ca_es: Ajuda de capçalera i peu de plantilla
it_it: Aiuto per intestazioni e piè di pagina del modello

source: Template testing
ca_es: Provar plantilla
it_it: Test modello

source: Templates help
ca_es: Ajuda de plantilles
it_it: Aiuto modelli

source: Terminal manufacturer
ca_es: Fabricant de terminal
it_it: Produttore terminale

source: Test
ca_es: Prova

source: Test the code
ca_es: Prova el codi
it_it: Prova il codice

source: The terminal model must be saved before you can test the code
ca_es: El model de terminal ha d'estar guardat abans que puguis provar el codi
it_it: Il modello del terminale deve essere salvato prima di poter testare il codice

source: There are invoices in the same range of date.
ca_es: Hi ha factures en el mateix període.
it_it: Ci sono fatture nello stesso intervallo di date.

source: There are unbilled calls after out date.
ca_es: Hi ha trucades no facturades després de la data sortint.
it_it: Ci sono chiamate non fatturare dopo la data di scadenza.

source: There are unbilled calls before in date.
ca_es: Hi ha trucades no facturades abans de la data inicial.
it_it: Ci sono chiamate non fatturare prima di data.

source: There are unmetered calls.
ca_es: Hi ha calls que no han sigut tarifades.
it_it: Ci sono chiamate non valorizzate.

source: There is a call forward with that call type. You can't add this call forward
ca_es: Ja hi ha un desviament del mateix tipus. No pots afegir aquest desviament
it_it: C'è un inoltro di chiamata per questo tipo di chiamata. Non è possibile aggiungere questo trasferimento

source: There is already a busy call forward with that call type.
ca_es: Ja hi ha un desviament quan estigui Ocupat actiu.
it_it: Esiste già una trasferimento su occupato per questo tipo di chiamata.

source: There is already a friend with that name.
ca_es: Ja hi ha un amic amb el mateix nom.
it_it: Esiste già una destinazione amica per questo nome.

source: There is already a inconditional call forward with that call type.
ca_es: Ja hi ha un desviament incondicional actiu.
it_it: Esiste già una trasferimento incondizionato per questo tipo di chiamata.

source: There is already a noAnswer call forward with that call type.
ca_es: Ja hi ha un desviament quan no hi hagi resposta actiu.
it_it: Esiste già una trasferimento su non risposto per questo tipo di chiamata.

source: There is already a residential device with that name.
ca_es: Ja existeix un dispositiu residencial amb aquest nom.
it_it: Esiste già un Residential Device con questo nome.

source: There is already a retail account with that name.
ca_es: Ja existeix una compte a l'engròs amb el mateix nom.
it_it: Esiste già un Account Retail con questo nome.

source: There is already a terminal with that name.
ca_es: Ja existeix un dispositiu amb aquest nom.
it_it: Esiste già un Terminale con questo nome.

source: There is already a userNotRegistered call forward with that call type.
ca_es: Ja hi ha un desviament quan el dispositiu no estigui registrat activat.
it_it: Esiste già una trasferimento su non registrato per questo tipo di chiamata.

source: There was an error
ca_es: Hi ha hagut un error
it_it: Si è verificato un errore

source: There was an error: %s
ca_es: Hi ha hagut un error: %s
it_it: Si è verificato un errore: %s

source: This DDI will be used if presented DDI doesn't match any of the company DDIs
ca_es: El DDI serà utilitzat si el DDI presentat no correspon a cap dels DDI de la companyia
it_it: Questo DDI verrà utilizzato se viene presentato DDI non corrisponde a nessuno deiCompany DDIs

source: This assignment has no functional purpose, it is just for DDI Provider <-> DDI navigation in some brand level sections.
ca_es: Aquesta assignació no te un valor funcional, només és per als proveidors de DDI <-> navegació DDI en alguns nivells de la marca.
it_it: Questa impostazione non ha uno scopo funzionale, è utile solo per la navigazione DDI Provider <-> DDI in alcuni livelli del Brand.

source: This importer expects values to be within quotation marks and separated by semicolons.
ca_es: L'importador espera que els valors estiguin entre cometes i separat per punt i coma.
it_it: Questo importatore richiede che i valori siano tra virgolette e separati dapunto e virgola.

source: This may take some minutes
ca_es: Esto podría tardar algunos minutos
it_it: Può richiedere alcuni minuti

source: This prefix will be added to the callee after carrier's numeric transformations.
ca_es: Aquest prefix serà afegit al trucat després de la transformació numèrica del transportista.
it_it: Questo prefisso verrà aggiunto al chiamatodopo l'esecuzione della trasformazione numerica applicata al Carrier.

source: This template is going to be tested
ca_es: Aquesta plantilla serà provada
it_it: Verrà testato questo template

source: This value will be displayed in the called terminals
ca_es: Aquest valor serà mostrat en els dispositius trucats
it_it: Questo valore verrà visualizzato nei terminali chiamati

source: Thursday
ca_es: Dijous
it_it: Giovedi

source: Time Information
ca_es: Informació del temps
it_it: Informazioni di servizio

source: Time in
ca_es: Temps de durada
it_it: Ora in

source: Time in seconds queue calls will ring members
ca_es: Temps en segons per el qual els membres de la cua seran trucats
it_it: Tempo in secondi per cui squilleranno i membri della coda

source: Time in seconds that member won't be disturbed after attending a queue call
ca_es: Temps en segons per el qual els membres no seran molestats després d'atendre una trucada de la cua
it_it: Tempo in secondi per cui un membro non sarà contattato dopo aver partecipato a una chiamata in coda

source: Time in seconds the IVR will wait after playing the welcome locution or dialing a digit
ca_es: Temps en segons que l' IVR esperarà per reproduir una locució o pel marcatge de dígits
it_it: Tempo in secondi per cui l'IVR attenderà dopo aver eseguito il messaggio di benvenuto ocomposizione di una cifra

source: Time out
ca_es: Temps d'espera esgotat

source: Timeout
ca_es: Temps d'espera

source: Timeout configuration
ca_es: Configuració del temps d'espera
it_it: Configurazione timeout

source: Timeout route
ca_es: Ruta de temps d'espera esgotat
it_it: Rotta di Timeout

source: Timeout target type
ca_es: Objectiu de temps d'espera esgotat
it_it: Destinazione Timeout

source: Timeout time
ca_es: Temps de temps d'espera
it_it: Tempo di Timeout

source: Timezone
ca_es: Fus horari
it_it: Fuso orario

source: Timing type
ca_es: Tipus de temporització

source: To address
ca_es: Adreça destí
it_it: Indirizzo To

source: Today usage
ca_es: Consum d'avui
it_it: Consumo odierno

source: Toggle extension
ca_es: Commuta extensió
it_it: Attiva / disattiva estensione

source: Total with tax
ca_es: Total amb impostos
it_it: Totale ivato

source: Town
ca_es: Poble
it_it: Città

source: Trademark registration information of the mark that is included in the invoices issued: eg 'registered in the commercial register of bizkaia, tome xxxx, book and, folio zzz, sheet aa-bbbb'
ca_es: El registre de marca comercial és inclòs a la factura com a: ' registrat en el registre comercial de Manresa, capítol XXX, llibre XXX, pàgina XXX, full aa-bbbb'
it_it: Informazioni sulla registrazione del marchio per il marchio incluso nelle fatture emesse: ad esempio 'registrate nel registro commerciale della bizkaia, tome xxxx, book and, folio zzz, sheet aa-bbbb'

source: Transformation Rule
ca_es: Transformació numèrica
it_it: Regola di trasformazione

source: Trunk Prefix
ca_es: Prefix trunk
it_it: Prefisso Trunk

source: Trusted IP address
ca_es: Adreça IP de confiança
it_it: Indirizzo IP affidabile

source: Tuesday
ca_es: Dimarts
it_it: Martedì

source: Type
ca_es: Tipus
it_it: Tipo

source: URI scheme
ca_es: Esquema URI
it_it: Schema URI

source: URL type
ca_es: Tipus URL
it_it: Tipo di URL

source: Unassigned
ca_es: No adscrit
it_it: Non assegnato

source: Unban address
ca_es: Desbloquear dirección
it_it: Sblocca indirizzo

source: Unbanned address
ca_es: Dirección desbloqueda
it_it: Indirizzo sbloccato

source: Unconditional Call Forward
ca_es: Desvío incondicional

source: Unit
ca_es: Unitat
it_it: Unità

source: Unreachable
ca_es: Inabastable
it_it: Irraggiungibile

source: Update
ca_es: Actualizar
it_it: Aggiorna

source: Update CallerID?
ca_es: Actualitzar ID del trucant?
it_it: Aggiorna CallerID?

source: Update values.
ca_es: Actualitza valors.
it_it: Aggiorna valori.

source: Upload file
ca_es: Envia fitxer
it_it: Carica file

source: Uploaded file
ca_es: Fitxer carregat
it_it: File caricato

source: Use <strong>$this->terminalModel</strong> to access model data, <strong>$this->terminal</strong> to access terminal data, <strong>$this->user</strong> for the user and <strong>$this->company</strong> for the company.
ca_es: Utilitza <strong>$this->terminalModel</strong> per accedir al model de dades, <strong>$this->terminal</strong> per accedir a les dades del terminal, <strong>$this->user</strong> per a l'usuari final <strong>$this->company</strong> per la companyia.
it_it: Usa <string> $this->terminalModel </strong> per accedere ai dati del modello, <strong>$this->terminal </strong> per accedere ai dati del terminale, <strong> $this->user </strong> per l'utente e <strong> $this-> company </strong> per l'azienda.

source: Use <strong>$this->terminalModel</strong> to access the model data.
ca_es: Utilitza <strong>$this->terminalModel</strong> per accedir a les dades del model.
it_it: Usa <strong> $this->terminalModel </strong> per accedere ai dati del modello.

source: Use address or hostname
ca_es: Utilitza una adreça o un nom d'amfitrió
it_it: Usa indirizzo o nome host

source: Use generic template
ca_es: Utilitza plantilla genèrica
it_it: Usa modello generico

source: Use point as decimal delimiter - e.g. 0.02
ca_es: Utilitza un punt com a indicador decimal - e.x. 0.002
it_it: Usa punto come delimitatore decimale - ad es. 0.02

source: Use this instead in From header domain
ca_es: Utilitza aquest enlloc de la Capçalera Origen del domini
it_it: Usa questo nel From header domain

source: Use this instead in From header username
ca_es: Utilitza aquest enlloc de la Capçalera d'origen de l'usuari
it_it: Usa questo nel From header username

source: Used as voicemail reception and user portal credential
ca_es: Utilitzat com a recepció de correu de veu i com a credencial del portal d'usuari
it_it: Utilizzato per la ricezione Voicemail e come credenziali del portale utente

source: Used to notify if max daily usage has been reached
ca_es: Empleado para notificar cuando se alcanza el máximo consumo diario

source: Used to notify if max daily usage has been reached. Leave empty to avoid notification.
ca_es: Empleado para notificar cuando se alcanza el máximo consumo diario. Dejar vacío para desactivar notificación.

source: User
ca_es: Usuari
it_it: Utente

source: User configuration
ca_es: Configuració d'usuari
it_it: Configurazione Utente

source: Username
ca_es: Nom d'usuari
it_it: Nome utente

source: View %s %2s
ca_es: Veure %s %2s
it_it: Visualizza %s %2s

source: View Incoming %s %s
ca_es: Veure entrada %s %s
it_it: Visualizza in entrata %s %s

source: View Outgoing %s %s
ca_es: Veure sortida %s %s
it_it: Visualizza in uscita %s %s

source: Views
ca_es: Vistes
it_it: Visualizza

source: Voicemail
ca_es: Bústia de veu

source: Voicemail Locution
ca_es: Locució de bústia de veu
it_it: Messaggio Voicemail

source: Voicemail Notification
ca_es: Notificació bústia de veu
it_it: Notifica Voicemail

source: Voicemail attach sound
ca_es: Adjunta àudio bústia de veu
it_it: Suono collegata alla Voicemail

source: Voicemail enabled
ca_es: Bústia de veu habilitada
it_it: Voicemail abilitato

source: Voicemail send mail
ca_es: Envia notificació per correu de la bústia de veu
it_it: Voicemail invia posta

source: Waiting
ca_es: Esperant
it_it: Attesa

source: Wednesday
ca_es: Dimecres
it_it: Mercoledì

source: Week
ca_es: Setmana
it_it: Settimana

source: Weight
ca_es: Pes
it_it: Peso

source: Welcome locution
ca_es: Locució de benvinguda
it_it: Messaggio di Benvenuto

source: When 'Yes', Users call forward settings will be followed.
ca_es: Al activarlo, los desviós de llamada serán aplicados.
it_it: Quando 'Si', verranno seguite le configurazioni di inoltro dell'Utente.

source: When 'Yes', calls will never generate a missed call. When 'No', missed calls will be prevented only for RingAll huntgroups if someone answers.
ca_es: 'Sí' evita de forma incondicional la generació de trucades perdudes. 'No' evita les trucades perdudes nomésp els grups de salt RingAll si algú contesta.
it_it: Quando 'Sì', le chiamate non generano mai una chiamata persa. Quando 'No', le chiamate persesaranno evitate solo per i gruppi di suoneria RingAll se qualcuno risponde.

source: When 'Yes', calls will never generate a missed call. When 'No', missed calls will be prevented only for RingAll queues if someone answers.
ca_es: 'Sí' evita de forma incondicional la generació de trucades perdudes. 'No' evita les trucades perdudes nomésp els cues de salt RingAll si algú contesta.
it_it: Quando 'Sì', le chiamate non generano mai una chiamata persa. Quando 'No', le chiamate persesaranno evitate solo per i code RingAll se qualcuno risponde.

source: When Outbound Proxy is used, SIP Proxy must not include a port.
ca_es: Quan s'utilitza Proxy de sortida, el Proxy SIP no ha d'incloure port.
it_it: Quando viene utilizzato il proxy in uscita, il proxy SIP non deve includere una porta.

source: When one member is part of multiples queues, calls from queues with higher weight will be attended first
ca_es: Quan un membre és part de varies cues, les trucades amb més pes seran ateses primer
it_it: Quando un membro fa parte di code multiple, saranno processaqte per prime le chiamate dalle code con il peso maggiore

source: White Lists
ca_es: Llista blanca

source: Whole day event
ca_es: Esdeveniment de tot un dia
it_it: Eventi del giorno

source: Wholesale specific
ca_es: Específic a l'engròs

source: Will be shown on page footer
ca_es: Es mostrarà al peu de pàgina
it_it: Verrà mostrato a piè di pagina

source: Work Phone
ca_es: Teléfono Trabajo

source: Write Access
ca_es: Acceso de escritura
it_it: Accesso in scrittura

source: Write access successfully granted.
ca_es: Acceso de escritura otorgado satisfactoriamente.
it_it: Accesso in scrittura correttamente assegnato.

source: Wrong mask, discarding value.
ca_es: Màscara de xarxa invàlida, s'ignorarà el valor.
it_it: Maschera sbagliata, valore scartato.

source: Year
ca_es: Any
it_it: Anno

source: Yes
ca_es: Sí
it_it: Sì

source: Yes, continue!
ca_es: Sí, continua!
it_it: Sì, continua!

source: You can call this extension from any company terminal to close this lock
ca_es: Pots trucar a aquesta extensió des de qualsevol dispositiu de la companyia per tancar aquest bloqueig
it_it: Puoi chiamare questo interno da qualsiasi terminale Company per chiudere questo blocco

source: You can call this extension from any company terminal to open this lock
ca_es: Pots trucar aquesta extensió des de qualsevol dispositiu de la companyia per obrir aquest bloqueig
it_it: Puoi chiamare questo interno da qualsiasi terminale Company per aprire questo blocco

source: You can call this extension from any company terminal to record this locution
ca_es: Pots trucar aquesta extensió des de qualsevol dispositiu de la companyia per enregistrar aquesta locució
it_it: Puoi chiamare questa estensione da qualsiasi terminale Company per registrare questa locuzione

source: You can call this extension from any company terminal to toggle this lock status
ca_es: Pots trucar a aquesta extensió des de qualsevol terminal de companyia per invertir l'estat del candau
it_it: Puoi chiamare questa estensione da qualsiasi terminale Company per attivare/diattivare questo blocco.

source: You can optionally prepend the terminal model or any other subpath to the url before the MAC address for verbosity/debugging purposes. If a extension is given (e.g. {mac}.cfg), requested file must have that extension too. Otherwise, only requested filename will be checked.
ca_es: De forma opcional pots repetir el model de terminal o un altre subcamí a la url abans de l'adreça MAC per propòsits de verbositat/depuració. Si es crida una extensió (e.g {mac}.cfg), el fitxer requerit també ha de tenir l'extensió. D'altre forma, només es comprovarà el fitxer requerit.
it_it: Puoi opzionalmente anteporre il modello terminale o qualsiasi altro sotto percorso allaurl prima dell'indirizzo MAC per scopi di tipo verbosità / debug. Se un internoviene fornito (ad esempio {mac} .cfg), il file richiesto deve avere anche quell'estensione.Altrimenti, verrà selezionato solo il nome file richiesto.

source: You can use regular expressions to define values this entry will match.
ca_es: Pots utilitzar expressions regulars per definir els valors.
it_it: Puoi usare le espressioni regolari per definire valori che corrisponderanno a questa voce.

source: You can't create a pricing plan that starts in de past
ca_es: No pots crear un pla de preus que comenci en el passat
it_it: Non è possibile creare un piano tariffario che inizi nel passato

source: You have to emulate a brand to be able to emulate a client
ca_es: Has d'emular una marca per poder emular a un client
it_it: Devi emulare un Brand per poter emulare una Company

source: allow
ca_es: permet
it_it: consenti

source: deny
ca_es: denega
it_it: nega

source: e.g. 8.8.8.8
ca_es: ex. 8.8.8.8
it_it: ad esempio 8.8.8.8

source: encoding
ca_es: codificació
it_it: codifica

source: ignore
ca_es: ignora
it_it: ignora

source: is a required field
ca_es: és un camp requerit
it_it: è un campo obbligatorio

source: oversized
ca_es: sobredimensionat
it_it: sovradimensionato

source: pending
ca_es: pendent
it_it: In sospeso

source: ready
ca_es: a punt
it_it: pronto

source: sec
ca_es: seg

source: seconds
ca_es: segons
it_it: secondi

source: shared
ca_es: compartit
it_it: condiviso

source: unlimited
ca_es: il·limitat
it_it: illimitato

source: Client
it_it: Cliente

source: Cost
it_it: Costo

source: Error
it_it: Errore

source: Exec
it_it: Esegui

source: Increment
it_it: Incremento

source: International
it_it: Internazionale

source: Linear
it_it: Lineare

source: National
it_it: Nazionale

source: Nif
it_it: IVA

source: Outgoing Routing
it_it: Routing in uscita

source: Outgoing routing
it_it: Routing in uscita

source: PDF File
it_it: File PDF

source: Pick up rel user
it_it: Utente Pick up

source: Port
it_it: Porta

source: Prefix
it_it: Prefisso

source: Recording
it_it: Registrazione

source: Residential Client
it_it: Cliente Residential

source: Retail Account
it_it: Account Retail

source: Retail Client
it_it: Cliente Retail

source: Route Lock
it_it: Blocco rotta

source: Routing pattern
it_it: Schema Routing

source: Routing pattern group
it_it: Gruppo Schema Routing

source: Routing pattern groups rel pattern
it_it: Schema relativo a Gruppi Schema Routing

source: Schedule
it_it: Pianificazione

source: Target client
it_it: Client destinazione

source: Template
it_it: Modello

source: Terminal
it_it: Terminale

source: Terminal model
it_it: Modello terminale

source: Theme
it_it: Tema

source: Total
it_it: Totale

source: Transport
it_it: Trasporto

source: Wholesale Address
it_it: Indirizzo Wholesale

source: Wholesale Client
it_it: Cliente Wholesale

source: Wholesale admin
it_it: Amministratore Wholesale

source: error
it_it: errore
