Repository: irontec/ivozprovider
Catalog: web/admin/application/languages/*/*.po
Languages: ca_es, it_it

source: %s emulated
ca_es: %s emulat
it_it: %s emulato

source: %s successfully deleted.
ca_es: %s esborrat satisfactòriament.
it_it: %s eliminato con successo.

source: 'Out date' must be equal or greater than 'In date'.
ca_es: 'Data final' ha de ser igual o més gran que la 'data inici'.
it_it: 'Data non valida' deve essere uguale o maggiore di 'In data'.

source: 'Valid From' must be earlier than 'Valid to'
ca_es: 'Vàlid des de' ha de ser abans que 'vàlid fins'
it_it: 'Valido da' deve essere precedente a 'Valido a'

source: 'https://' URLs valid only (without trailing '/')
ca_es: Només s'accepten adreces 'https://' (sense '/' al final)
it_it: 'https: //' URL validi solo (senza '/' alla fine)

source: 0 disables if more available, 2 gets double calls than 1, 3 gets triple calls than 1, etc.
ca_es: 0 desactiva si més disponible, 2 rep trucades dobles d' 1, 3 rep trucades triples d' 1, etc.
it_it: 0 disabilita se più disponibili, 2 ottiene il doppio delle chiamate di 1, 3 il triplo

source: ACL data
ca_es: Dades ACL
it_it: Dati ACL

source: Accept
ca_es: Accepta
it_it: Accetta

source: Access
ca_es: Acceso
it_it: Accesso

source: Access denied
ca_es: Accés denegat
it_it: Accesso negato

source: Access privileges
ca_es: Control de acceso
it_it: Accesso con privilegi di amministratore

source: Access successfully revoked.
ca_es: Acceso revocado satisfactoriamente
it_it: Accesso eliminato con successo.

source: Action
ca_es: Acció
it_it: Azione

source: Action Configuration
ca_es: Configuració de l'acció
it_it: Configurazione Azione

source: Activation time
ca_es: Data d'activació
it_it: Data attivazione

source: Active
ca_es: Actiu
it_it: Attivo

source: Active call
ca_es: Llamada en curso
it_it: Chiamata attiva

source: Active calls
ca_es: Llamadas en curso
it_it: Chiamate attive

source: Active pricing plan does not allow to call introduced phone number
ca_es: El pla de preus actiu no permet trucar al número desitjat
it_it: Il piano tariffario attivo non consente di chiamare il numero di telefono inviato

source: Add %s
ca_es: Afegeix %s
it_it: Aggiungi %s

source: Add %s %2s
ca_es: Afegeix %s %2s
it_it: Aggiungi %s %2s

source: Add IPs or network if enabled. Otherwise all calls will be rejected.
ca_es: Afegeix IPs o IPs de xarxa si està habilitat. D'altre forma totes les trucades seran rebutjades.
it_it: Aggiungi IP o rete se abilitato, altrimenti tutte le chiamate saranno rifiutate.

source: Add QR Code to user portal to provision GS Wave mobile softphone
ca_es: Afegeix codi QR al portal d'usuari per a aprovisionar un telefon de software GS Wave mòbil
it_it: Aggiungi codice QR al portale utente per configurare il softphone mobile GS Wave

source: Add balance
ca_es: Afegeix balanç
it_it: Aggiungi al saldo

source: Add balance operation to <strong>%s</strong>
ca_es: Afegeix operacions de balanç a <strong>%s</strong>
it_it: Aggiungi operazione saldo a <strong>%s</strong>

source: Add of %s %2s
ca_es: Afegeix a %s %2s
it_it: Aggiunta di %s %2s

source: Add pattern to %2s
ca_es: Afegeix patró a %2s
it_it: Aggiungi pattern a %2s

source: Address Book
ca_es: Agenda

source: Address successfully unbanned
ca_es: Dirección desbloqueada con éxito

source: Admin
ca_es: Administrador
it_it: Amministratore

source: Administrator
ca_es: Administrador
it_it: Amministratore

source: Administrator access privilege
ca_es: Control de acceso de administrador
it_it: Accesso con privilegio Amministratore

source: Advanced Configuration
ca_es: Configuració avançada
it_it: Configurazione avanzata

source: Advanced Setting, read carefully
ca_es: Configuració avançada, llegeix amb cura
it_it: Impostazioni avanzate, leggi attentamente

source: All
ca_es: Tots
it_it: Tutti

source: All Countries
ca_es: Todos los paises

source: Allow Call Forwards
ca_es: Permet desviament de trucada
it_it: Consenti deviazioni di Chiamata

source: Allow Client to remove recordings
ca_es: Permet al client eliminar les gravacions
it_it: Consenti al cliente di rimuovere le registrazioni

source: Allow all outgoing calls
ca_es: Permet totes les trucades sortints
it_it: Consenti tutte le chiamate in uscita

source: Allow dialing extensions
ca_es: Permet marcar extensions
it_it: Consenti chiamate agli interni

source: Allowed audio codecs
ca_es: Còdecs d'àudio permesos
it_it: Codec audio consentiti

source: Allowed characters are 0-9, * and #
ca_es: Caràcters permesos son 0-9, * i #
it_it: I caratteri consentiti sono 0-9, * e #

source: Allowed characters: a-z, A-Z, 0-9, underscore and '*'
ca_es: Caràcters permesos: a-z,A-Z,0-9, _ i '*'
it_it: Caratteri consentiti: a-z, A-Z, 0-9, underscore e '*'

source: Allowed characters: a-z, A-Z, 0-9, underscore and '-'
ca_es: Caràcters permesos: a-z,A-Z,0-9, _ i '-'
it_it: Caratteri consentiti: a-z, A-Z, 0-9, underscore e '-'

source: Allowed video codecs
ca_es: Còdecs de vídeo permesos
it_it: Codec video consentiti

source: Always
ca_es: Sempre
it_it: Sempre

source: Always apply transformations
ca_es: Aplicar siempre transformaciones numéricas

source: Amount
ca_es: Quantitat
it_it: Quantità

source: An error occurred
ca_es: Hi ha hagut un error
it_it: Si è verificato un errore

source: An error occurred: check files format and content.
ca_es: Hi ha hagut un error: comprova el format i contingut dels fitxers.
it_it: Si è verificato un errore: controlla il formato e il contenuto dei file.

source: Announce
ca_es: Anuncia
it_it: Annuncio

source: Announce Queue position
ca_es: Anuncio posición de cola

source: Announce Queue position frequency
ca_es: Frecuencia de anuncio posición

source: Announce queue position to waiting users when they enter the queue and after defined frequency
ca_es: Anunciar posición cuando los usuarios entran en cola o tras la frecuencia definida

source: Antiflood banned IP
ca_es: IP bloqueada antiflood

source: Any
ca_es: Qualsevol
it_it: Qualunque

source: Application Server
ca_es: Servidor d'aplicació
it_it: Server Applicativo

source: Apply connect fee only if call cost does not reach connect fee (minimal cost, read documentation for further information).
ca_es: Aplicar coste de establecimiento solo si el coste de la llamada no alcanza el coste del establecimiento (coste mínimo, leer documentación).
it_it: Applica connect fee solo se il costo chiamata è inferiore al connect fee (costo minimo, leggere la documentazione per ulteriori informazioni).

source: Apply to all clients
ca_es: Aplica a tots els clients
it_it: Applica a tutti i clienti

source: Are you sure that you want to emulate the %s "%2s"?
ca_es: Estàs segur que vols emular a %s "%2s"?
it_it: Sei sicuro di voler emulare %s "%2s"?

source: Are you sure you want to generate the invoice?
ca_es: Estàs segur que vols generar la factura?
it_it: Sei sicuro di voler generare la fattura?

source: Area code
ca_es: Codi d'àrea
it_it: Prefisso

source: Assistant
ca_es: Assistent
it_it: Assistente

source: Audio Transcoding
ca_es: Transcodificació de so
it_it: Transcodifica audio

source: Auth needed
ca_es: Autentificació necessaria
it_it: Autenticazione necessaria

source: Auth password
ca_es: Contrasenya d'autentificació
it_it: Password di autenticazione

source: Auth user
ca_es: Usuari d'autentificació
it_it: Utente autenticazione

source: Auth username
ca_es: Nom d'usuari d'autentificació
it_it: Nome utente di autorizzazione

source: Authentication Settings
ca_es: Configuracions d'autentificació
it_it: Impostazioni di autenticazione

source: Authorized source
ca_es: Font d'origen autoritzada
it_it: Sorgente Autorizzata

source: Automatic creation of rules
ca_es: Creació de les regles automàtica
it_it: Creazione automatica di regole

source: Avoid PCRE regular expressions here: use [0-9] instead of \d.
ca_es: Evita expressions regulars PCRE aquí: utilitza [0-9] enlloc de \d.
it_it: Qui, evita PCRE regular expressions : usa [0-9] invece di \d.

source: Balance
ca_es: Balanç
it_it: Saldo

source: Balance Movement
ca_es: Moviment de balanç
it_it: Movimento Saldo

source: Balance Notification
ca_es: Notificació de balanç
it_it: Notifica Saldo

source: Balance modified successfully
ca_es: Balanç modificat satisfactòriament
it_it: Saldo modificato correttamente

source: Balance operations
ca_es: Operacions de balanç
it_it: Operazioni sul Saldo

source: Banned IP address
ca_es: Dirección IP bloqueda

source: Basic Configuration
ca_es: Configuració bàsica
it_it: Configurazione di base

source: Basic Info
ca_es: Informació bàsica
it_it: Informazioni di base

source: Basic Information
ca_es: Informació bàsica
it_it: Informazioni di base

source: Billing
ca_es: Facturació
it_it: Fatturazione

source: Billing Information
ca_es: Informació de facturació
it_it: Informazioni di fatturazione

source: Billing method
ca_es: Mètode de facturació
it_it: Metodo di fatturazione

source: Black Lists
ca_es: Llista negra

source: Block
ca_es: Bloquejar
it_it: Blocco

source: Blocker
ca_es: Bloqueador
it_it: Bloccante

source: Body
ca_es: Cos
it_it: Corpo

source: Body type
ca_es: Tipus de cos
it_it: Codifica Corpo della mail

source: Boss Whitelist
ca_es: Llista blanca del Cap
it_it: Whitelist Boss

source: Boss-Assistant
ca_es: Assistent Cap
it_it: Assistente Boss

source: Both
ca_es: Ambdós
it_it: Entrambi

source: Brand
ca_es: Marca

source: Brand Configuration
ca_es: Configuració de marca
it_it: Configurazione Brand

source: Brand Portal
ca_es: Portal de marca
it_it: Portale Brand

source: Brand is not set
ca_es: La marca no està seleccionada
it_it: Brand non impostato

source: Brand operator
ca_es: Operador de marca
it_it: Operatore Brand

source: Brand service
ca_es: Servei de marca
it_it: Servizio Brand

source: Brute-force attack
ca_es: Ataque de fuerza bruta
it_it: Attacco brute-force

source: Busy
ca_es: Ocupat
it_it: Occupato

source: CIDR notation (e.g. 8.8.8.0/24) or specific IP address (e.g. 8.8.8.8)
ca_es: Format CIDR (ex. 8.8.8.0/24) o amfitrió específic (ex. 8.8.8.8)
it_it: Notazione CIDR (ad esempio 8.8.8.0/24) o indirizzo IP specifico (ad esempio 8.8.8.8)

source: Calculate cost?
ca_es: Calcula cost?
it_it: Calcolare il costo?

source: Calendar
ca_es: Calendari
it_it: Calendario

source: Calendar Period
ca_es: Període de calendari
it_it: Periodo Calendario

source: Call
ca_es: Trucada
it_it: Chiamata

source: Call ACL
ca_es: ACL de trucada
it_it: ACL Chiamata

source: Call ACL MatchList
ca_es: ACL de trucada: llista de coincidències
it_it: Lista ACL per Match Chiamata

source: Call ACL Pattern
ca_es: Patró d'ACL de trucada
it_it: Pattern ACL Chiamata

source: Call CSV
ca_es: CSV de trucada
it_it: Tabulato

source: Call CSV Notification
ca_es: Notificació de trucades CSV
it_it: Notifica Tabulati

source: Call CSV report
ca_es: Informe de trucades CSV
it_it: Report Tabulati

source: Call CSV scheduler
ca_es: Planificador de CSV de trucades
it_it: Pianificazione Tabulati

source: Call Details
ca_es: Detalls de trucada
it_it: Dettagli chiamata

source: Call ID
ca_es: ID de trucada

source: Call destination
ca_es: Destí de trucada
it_it: Destinazione chiamata

source: Call forward setting
ca_es: Configuració desviament de trucada
it_it: Impostazioni di inoltro chiamate

source: Call forward type
ca_es: Tipus de desviament de trucada
it_it: Tipo inoltro chiamata

source: Call recording
ca_es: Enregistrament de trucades

source: Call registry
ca_es: Registre de trucades
it_it: Registro chiamate

source: Call rejection method
ca_es: Método de rechazo de llamadas

source: Call type
ca_es: Tipus de trucada
it_it: Tipo di chiamata

source: Call waiting
ca_es: Trucada en espera
it_it: Chiamata in Attesa

source: Calldate
ca_es: Data de trucada
it_it: Data chiamata

source: Called DDI
ca_es: DDI llamado

source: Callee
ca_es: Receptor
it_it: Chiamato

source: Callee In transformations
ca_es: Transformacions d'entrada del receptor
it_it: Trasformazione Chiamato In

source: Callee Out transformations
ca_es: Transformacions de sortida del receptor
it_it: Trasformazione Chiamato Out

source: Caller
ca_es: Emissor
it_it: Chiamante

source: Caller In transformations
ca_es: Transformacions d'entrada del trucant
it_it: Trasformazione Chiamante In

source: Caller Out transformations
ca_es: Transformacions de sortida del trucant
it_it: Trasformazione Chiamante Out

source: CallerID update header
ca_es: Capçalera d'actualització del CallerID
it_it: Aggiorna header CallerID

source: CallerID update method
ca_es: Mètode d'actualització del CallerID
it_it: Metodo aggiornamento CallerID

source: Callid
ca_es: Identificador trucada

source: CallidHash
ca_es: Hash identificador trucada

source: Calling a number within the same Area can omit Area Code
ca_es: Trucar a un número de la mateixa àrea pot ometre el codi d'Àrea
it_it: Chiamando un numero all'interno della stessa area si può omettere il prefisso

source: Calls
ca_es: Trucades
it_it: Chiamate

source: Calls from non-granted IPs
ca_es: Trucades des d'IP no garantides
it_it: Chiamate da IP non concessi

source: Cancel
ca_es: Cancel·la
it_it: Annulla

source: Cancel call in all devices
ca_es: Cancelar llamada en todos los dispositivos

source: Cancel call only in current device
ca_es: Cancelar llamada solo en el dispositivo actual

source: Cannot invoice calls from today in the future.
ca_es: No es poden facturar trucades d'avui en el futur.
it_it: Impossibile fatturare le chiamate da oggi in data futura.

source: Carrier
ca_es: Proveïdor

source: Carrier server
ca_es: Servidor del proveïdor
it_it: Server Carrier

source: Charge period
ca_es: Període de càrrec
it_it: Periodo di addebito

source: Check documentation for this section
ca_es: Consulta la documentació per aquesta secció
it_it: Controlla la documentazione per questa sezione

source: Client Configuration
ca_es: Configuració del client
it_it: Configurazione Cliente

source: Client Portal
ca_es: Portal del client
it_it: Portale clienti

source: Client Type
ca_es: Tipo de cliente
it_it: Tipo Cliente

source: Client admin
ca_es: Administrador del client
it_it: Amministratore Client

source: Client filters
ca_es: Filtros de cliente
it_it: Filtri Cliente

source: Client's Max Calls setting
ca_es: Configuración Limite de llamadas de Cliente

source: Client's default
ca_es: Per defecte del client
it_it: Impostazione predefinita del client

source: Close
ca_es: Tanca
it_it: Chiudi

source: Close extension
ca_es: Tanca extensió
it_it: Chiudi interno

source: Closed
ca_es: Tancat
it_it: Chiuso

source: Code
ca_es: Codi
it_it: Codice

source: Code used for internationals calls, usually 00.
ca_es: Codi utilitzat per a les trucades internacionals, normalment 00.
it_it: Il codice utilizzato per le chiamate internazionali, di solito 00.

source: Company Portal
ca_es: Portal de companyia
it_it: Portale Clienti

source: Company service
ca_es: Servei de companyia
it_it: Servizio Company

source: Completed
ca_es: Completat
it_it: Completato

source: Condition
ca_es: Condició
it_it: Condizione

source: Conditional Route
ca_es: Ruta condicional
it_it: Rotta condizionale

source: Conference room
ca_es: Sala de conferències

source: Connecting
ca_es: Conectando
it_it: Collegamento

source: Connection Info
ca_es: Informació de connexió
it_it: Informazioni di connessione

source: Connection fee
ca_es: Cost de connexió
it_it: Costo Connessione

source: Connectivity mode
ca_es: Mode de connectivitat
it_it: Modalità Connessione

source: Contact
ca_es: Contacto

source: Contact Settings
ca_es: Configuracions del contacte
it_it: Impostazioni contatto

source: Contact Username
ca_es: Nom d'usuari del contacte
it_it: Nome utente contatto

source: Contents configuration
ca_es: Configuració dels continguts
it_it: Configurazione dei contenuti

source: Continue
ca_es: Continua
it_it: Continua

source: Control Panel
ca_es: Panell de control
it_it: Pannello di controllo

source: Copy callid
ca_es: Copiar callid
it_it: Copia il callid

source: Country
ca_es: País
it_it: Paese

source: Country code
ca_es: Codi de País
it_it: Prefisso Internazionale

source: Create
ca_es: Crear
it_it: Crea

source: Created
ca_es: Creat
it_it: Creato

source: Created on
ca_es: Creat a
it_it: Creati il

source: Currency
ca_es: Moneda
it_it: Valuta

source: Current Day Usage
ca_es: Consum dia en curs
it_it: Consumo del giorno corrente

source: Custom
ca_es: Personalitzat
it_it: Personalizzato

source: DDI In
ca_es: DDI entrada

source: DDI Provider
ca_es: Proveïdor de DDI

source: DDI Provider Address
ca_es: Adreça del proveïdor de DDI
it_it: Indirizzo DDI Provider

source: DDI Provider Registration
ca_es: Registre del proveïdor de DDI
it_it: Regsitrazione DDI Provider

source: DDIs Match mode
ca_es: Coincidència DDI

source: DDIs NOT from client's country
ca_es: DDIs de paises distintos al cliente

source: DDIs from %s (%s)
ca_es: DDIs de %s (%s)

source: DDIs from any country
ca_es: DDIs de cualquier país

source: DDIs from client's country
ca_es: DDIs del paises del cliente

source: Day
ca_es: Dia
it_it: Giorno

source: Deductible Connection Fee
ca_es: Coste de establecimiento deducible
it_it: Connection Fee detraibile

source: Deductible Connection Fee cannot be changed
ca_es: El valor de Coste de establecimiento deducible no es editable
it_it: La Connection Fee detraibile non può essere modificato

source: Default Action
ca_es: Acció per defecte
it_it: Azione predefinita

source: Default Invoice template
ca_es: Plantilla de factura per defecte
it_it: Modello di fattura predefinito

source: Default behaviour cancels call in all devices for 600/603 response code and only in current device for 480/486. Choose whether you want to force one behaviour or another no matter response codes.
ca_es: Por defecto un 600/603 cancela la llamada en todos los dispositivos del usuario y un 480/486 la cancela solo en el dispositivo actual. Elige si quieres forzar uno de estos dos comportamientos independientemente del código de respuesta.

source: Default currency
ca_es: Moneda per defecte
it_it: Valuta predefinita

source: Default holiday routing
ca_es: Ruta de vacances per defecte
it_it: Routing festivo predefinito

source: Default notification template
ca_es: Plantilla de notificació per defecte
it_it: Modello di notifica predefinito

source: Default outgoing DDI. This can be overriden in accounts's edit screen.
ca_es: DDI d'origen de trucada per defecte. Es pot sobreescriure a la pantalla d'edició de comptes.
it_it: DDI in uscita predefinito. Può essere sovrascritto nella schermata di modifica degli account.

source: Default outgoing DDI. This can be overriden in caller's edit screen.
ca_es: DDI d'origen de trucada per defecte. Es pot sobreescriure a la pantalla d'edició de l'usuari.
it_it: DDI in uscita predefinito. Può essere sovreascritto nella schermata di modifica del chiamante.

source: Default policy
ca_es: Política per defecte

source: Default timezone
ca_es: Zona horària per defecte
it_it: Fuso orario predefinito

source: Delete
ca_es: Borrar
it_it: Elimina

source: Delete %s
ca_es: Esborra %s
it_it: Elimina %s

source: Delete file
ca_es: Esborra fitxer
it_it: Elimina file

source: Depending on response code
ca_es: Dependiendo del código de respuesta

source: Description
ca_es: Descripció
it_it: Descrizione

source: Destination
ca_es: Destí
it_it: Destinazione

source: Destination IP address
ca_es: Adreça IP destí
it_it: Indirizzo IP di destinazione

source: Destination prefix
ca_es: Prefix destinació

source: Destination rate
ca_es: Tarifa destinació
it_it: Tariffa di destinazione

source: Destination rate group
ca_es: Grup de tarifes de destinació
it_it: Gruppo tariffe di destinazione

source: Destination rate not found
ca_es: Tarifa de destinació no trobada
it_it: Tariffa di destinazione non trovata

source: Determines the order current priority members will be called
ca_es: Determina l'orde de prioritat dels membres que seran trucats
it_it: Determina l'ordine con cui i membri prioritari verranno chiamati

source: Determines the order users will be called
ca_es: Determina l'ordre en que els usuaris seran trucats
it_it: Determina l'ordine con cui gli utenti saranno chiamati

source: Direct
ca_es: Directe
it_it: Diretto

source: Direct connectivity
ca_es: Connexió directa
it_it: Connettività diretta

source: Direction
ca_es: Direcció
it_it: Direzione

source: Disable CDR
ca_es: Deshabilitar CDR
it_it: Disabilita CDR

source: Disabled
ca_es: Deshabilitat
it_it: Disabilitato

source: Disallowed audio codecs
ca_es: Còdecs d'àudio no admesos
it_it: Codec audio non consentiti

source: Disk usage
ca_es: Ús del disc
it_it: Utilizzo disco

source: Disk usage notification email
ca_es: Notificació d'ús de disc
it_it: Email di notifica su uso disco

source: Display billing details to client
ca_es: Mostrar detalles de facturación al cliente

source: Display name
ca_es: Text en pantalla
it_it: Nome visualizzato

source: Distribute method
ca_es: Mètode de distribució
it_it: Metodo di distribuzione

source: Do NOT select any codec before reading <a href=/doc/en/administration_portal/brand/clients/retail.html target=_blank>documentation</a>.
ca_es: No seleccionar ningún codec sin leer la <a href=/doc/en/administration_portal/brand/clients/retail.html target=_blank>documentacion</a>.

source: Do NOT select any codec before reading <a href=/doc/en/administration_portal/brand/clients/wholesale.html target=_blank>documentation</a>.
ca_es: No seleccionar ningún codec sin leer la <a href=/doc/en/administration_portal/brand/clients/wholesale.html target=_blank>documentacion</a>.

source: Do not disturb
ca_es: No molestar
it_it: Non disturbare

source: Do you really want to grant read access to selected entities?
ca_es: ¿Realmente desea dar acceso de lectura a las entidades seleccionadas?
it_it: Vuoi davvero consentire l'accesso in lettura alle voci selezionate?

source: Do you really want to grant write access to selected entities?
ca_es: ¿Realmente desea dar acceso de escritura a las entidades seleccionadas?
it_it: Vuoi davvero consentire l'accesso in scrittura alle voci selezionate?

source: Do you really want to revoke access to selected entities?
ca_es: ¿Realmente desea denegar el acceso a las entidades seleccionadas?
it_it: Vuoi davvero revocare l'accesso alle voci selezionate?

source: Do you really want to unban selected item?
ca_es: ¿Realmente desea desbloquear el elemento seleccionado?
it_it: Vuoi davvero sbloccare la voce selezionata?

source: Do you want revoke access to this %s?
ca_es: ¿Desea denegar el acceso a %s?
it_it: Vuoi revocare l'accesso a %s?

source: Do you want to delete this %s?
ca_es: Vols esborrar %s?
it_it: Vuoi eliminare questo %s?

source: Do you want to grant read access to this %s?
ca_es: ¿Desea dar acceso de lectura a %s?
it_it: Vuoi consentire i diritti di lettura a %s?

source: Do you want to grant write access to this %s?
ca_es: ¿Desea dar acceso de escritura a %s?
it_it: Vuoi consentire i diritti di scrittura a %s?

source: Do you want to rerate selected calls?
ca_es: Vols tornar a tarifar les trucades seleccionades?
it_it: Vuoi ricalcolare il costo delle chiamate selezionate?

source: Domain
ca_es: Domini
it_it: Dominio

source: Download
ca_es: Descarrega

source: Download file
ca_es: Descarrega fitxer
it_it: Scarica il file

source: Downloading
ca_es: Descarregant

source: Duplicated prefix
ca_es: Prefix duplicat
it_it: Prefisso duplicato

source: Duplicated priority
ca_es: Prioritat duplicada
it_it: Priorità duplicata

source: Duration
ca_es: Duració
it_it: Durata

source: Edit %s
ca_es: Edita %s
it_it: Modifica %s

source: Edit %s %2s
ca_es: Edita %s %2s
it_it: Modifica %s %2s

source: Edit pattern of %s
ca_es: Edita els patrons de %s
it_it: Modifica schema di %s

source: Edition/creation tabs will be closed.
ca_es: Les fitxes d'edició/creació seran tancades.

source: Email
ca_es: Correu electrònic
