Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/basics.po
Languages: es

source: IvozProvider has multiple elements that are not exposed to the *external world* but play a crucial task.
es: IvozProvider cuenta con multiples elementos que no están *expuestos al mundo* pero juegan un papel crucial.

source: The most remarkable profile is **database profile** that gathers all the information of the platform and shares it between the majority of software packaged. IvozProvider uses `MySQL database engine <https://www.mysql.com/>`_ for this task.
es: El perfil mas significativo es el de **data** que reune toda la informacion de la plataforma and la distribuye entre la mayoría de los softwares restantes. IvozProvider utiliza `MySQL <https://www.mysql.com/>`_ para esta tarea.

source: Another remarkable task is **asychronous tasks handler**: CDR must be parsed, calls must be billed, recordings must be encoded, etc.
es: Otro proceso menos crucial son **los gestores de tareas asíncronas**: el CDR ha de ser parseado, la llamadas tarificadas, las grabaciones codificadas, etc.

source: Sessions initiated by SIP signalling protocol imply media streams shared by involved entities.
es: La sesiones iniciadas por el protocolo de señalizacion SIP implican la compartición de flujos de multimedia entre las entidades implicadas.

source: This media streams use `RTP <https://tools.ietf.org/html/rfc3550>`_ to send and receive the media itself, usually using UDP as a transport protocol.
es: Estos flujos emplean `RTP <https://tools.ietf.org/html/rfc3550>`_ para enviar y recibir el propio media, generalmente empleando el protocolo de transporte UDP.

source: **External entities** involved in RTP sessions can be divided in:
es: Las **entidades externas** involucradas en las sesiones RTP se pueden dividir en

source: Users.
es: Usuarios.

source: Carriers.
es: Proveedores.

source: Both entities exchanges RTP with the same IvozProvider entity: *media-relays*.
es: Ambas entidades intercambian RTP con el mismo servicio de IvozProvider: *los servidores media*.

source: IvozProvider implements *media-relays* using both `RTPengine <https://github.com/sipwise/rtpengine>`_ and `RTPproxy <http://www.rtpproxy.org/>`_.
es: IvozProvider implementa *servidores media* usando tanto `RTPengine <https://github.com/sipwise/rtpengine>`_ como `RTPproxy <http://www.rtpproxy.org/>`_.

source: Similar to SIP, these *media-relays* exchanges RTP when is needed with *Application Servers*, but **external entities never talk directly to them**.
es: Al igual que ocurre con SIP, estos *servidores de media* intercambian RTP cuando es necesario con los *Servidores de aplicación*, pero **nunca permiten que los extremos externos a la plataforma hablen entre ellos directamente**.

source: **Aux profile** runs software that, even though is not vital for calls placing, makes IvozProvider mantainer's life much more easier.
es: El perfil **auxiliar** ejecuta programas, que aún no siendo vitales para el flujo de las llamadas, facilitan mucho las tareas para los mantenedores de las plataformas IvozProvider.

source: In fact, without them, debugging problems would be much harder and the quality of given service would be damaged.
es: De hecho, sin ellos, sería muchísimo más dificil debugear los problemas y la calidad del servicio proporcionado se vería afectada.

source: IvozProvider ships:
es: IvozProvider incluye:

source: **Homer SIP capture**: This amazing software lets us capture all the SIP traffic for later analysis, for obtaining statistics, call quality measuring, etc. Visit `SIP Capture website <http://sipcapture.org/>`_ for more information.
es: **Homer SIP capture**: Este fabuloso software nos permite capturar todo el tráfico SIP para ser analizado posteriormente y obtener estadísticas, métricas de calidad de la llamada, etc. Visite `SIP Capture website <http://sipcapture.org/>`_ para más información.

source: **Graylog log viewer**: All logs of all IvozProvider profiles are stored and shown with `Graylog <https://www.graylog.org/>`_ and divied in brands.
es: **Visor de logs Graylog**: Todos los logs de la plataforma IvozProvider se almacenan y muestran con `Graylog <https://www.graylog.org/>`_ divido en marcas.

source: **Grafana graph dashboard**: `Grafana <http://grafana.org/>`_ lets us graph everything. Literally.
es: **Panel de gráficas Grafana**: `Grafana <http://grafana.org/>`_ nos permite tener gráficas de todo. Literalmente.

source: Following diagram shows the global architecture of IvozProvider solution, with all its components:
es: Este esquema refleja la arquitectura global de la solución IvozProvider, con todos los elementos que la componen.

source: This is a more conceptual diagram:
es: Este es otro esquema más conceptual:

source: Platform general architecture
es: Arquitectura general de la plataforma

source: General diagram
es: Esquema general

source: SIP signalling flow
es: Flujo señalización SIP

source: The first diagram shows the SIP signalling traffic involved in the establishment, modification and termination of sessions following the SIP `RFC 3261 <https://tools.ietf.org/html/rfc3261>`_ and any `related RFCs <https://www.packetizer.com/ipmc/sip/standards.html>`_.
es: El primer diagrama muestra el tráfico de señalización SIP que ocurre en el establecimiento, modificación y finalización de sesiones acorde al `RFC 3261 <https://tools.ietf.org/html/rfc3261>`_ y otros `RFCs relacionados <https://www.packetizer.com/ipmc/sip/standards.html>`_.

source: These are the **external SIP entities** involved:
es: Estas son las **entidades SIP externas** involucradas:

source: UACs: users hardphones, softphones, SIP-capable gadget.
es: UACs: teléfonos de usuarios, softphones, dispositivos compatibles con SIP.

source: SIP carriers: carriers used to interconnect IvozProvider with external SIP networks (and, probably, with PSTN).
es: Proveedores SIP: proveedores usados para la interconexión de IvozProvider con redes externas SIP (y, probablemente, con la PSTN).

source: All the SIP traffic (in any of the supported transports: TCP, UDP, TLS, WSS) they send/receive is to/from this two **internal SIP entities** of IvozProvider:
es: Todo el tráfico SIP (en cualquiera de los transportes soportados: TCP, UDP, TLS, WSS) que se envia/recibe desde la plataforma se hará deste las siguiente dos **entidades SIP internas** de IvozProvider:

source: Users SIP Proxy (running `Kamailio <https://www.kamailio.org>`_).
es: Proxy SIP de Usuarios (ejecutando `Kamailio <https://www.kamailio.org>`_).

source: Trunks SIP Proxy (running `Kamailio <https://www.kamailio.org>`_).
es: Proxy SIP Proveedores (running `Kamailio <https://www.kamailio.org>`_).

source: In fact, users UACs only talks to *Users SIP Proxy* and 'SIP carriers' only talks to *Trunks SIP Proxy*.
es: De hecho, los UACs de usuario solo se comunican con el *Proxy SIP de usuarios* y los 'Proveedores SIP' solo se comunican con el *Proxy SIP de Proveedores*.

source: Inside IvozProvider these two proxies talk to *Application Servers* running `Asterisk <http://www.asterisk.org/>`_, but **no external element is allowed to talk to Application Servers directly**.
es: Dentro de IvozProvider estos dos proxies hablan a los *Servidores de Aplicación* que ejecutan `Asterisk <http://www.asterisk.org/>`_, ya que **ningun elemento externo puede hablar con los Servidores de Aplicación directamente**.

source: RTP audio flow
es: Flujo audio RTP

source: HTTPS traffic
es: Tráfico HTTPS

source: HTTPS is the third traffic type exchanged between IvozProvider and *external world*.
es: HTTPS es el tercer tipo de tráfico que interncambian

source: HTTPS traffic is used for:
es: El tráfico HTTPS se emplea para:

source: **Terminal provisioning**: several hardphones ask for their configuration when they wake up and this configuration files can be served through HTTPS.
es: **Provisión de terminales**: Muchos teléfonos piden su configuracion al iniciarse y esta puede ser enviada a través de HTTPS.

source: **Web portals**: IvozProvider has 4-level web portals for all the :ref:`platform roles <operation_roles>`.
es: **Portales web**: IvozProvider cuenta con 4 portales de web para los diferentes :ref:`platform roles <operation_roles>`.

source: Both of these traffics are handled by *Web portals* IvozProvider entity.
es: Estos dos tipos de tráfico son gestionados por los *Portales web* de IvozProvider.

source: Additional elements
es: Elementos adicionales

source: Auxiliar elements
es: Elementos auxiliares

source: Automatic ISO CD image
es: CDs automáticos de instalación

source: You can download one of the `IvozProvider Automatic ISO CD images <https://github.com/irontec/ivozprovider>`_ (generated using `simplecdd <https://wiki.debian.org/Simple-CDD>`_) in stable or nighly versions:
es: Puedes descargar uno de los `CDs automáticos de instalación de IvozProvider <https://github.com/irontec/ivozprovider>`_ (generados mediante `simplecdd <https://wiki.debian.org/Simple-CDD>`_) en su versión estable o en una de las builds nocturnas:

source: IMPORTANT: Automatic install CDs will format target machine disk!
es: IMPORTANTE: Los CDs de instalación formatearán automáticamente el disco de la máquina.

source: Configure the target machine to boot from CD. It will display the Debian GNU/Linux installation menu.
es: Configure la máquina para iniciar desde CD, mostrará el menú de instalación de Debian GNU/Linux.

source: You can use graphic installation if you prefer, but the following screenshots show the standard installation.
es: Si lo desea puede emplear la instalación gráfica del CD, pero los pantallazos a continuación se muestran con la instalaciónestándar.

source: Choose installation language:
es: Seleccione el idioma de la instalación:

source: Choose location:
es: Seleccione la ubicación:

source: Choose date and time configuration:
es: Seleccione la configuración de hora:

source: At this point, a generic network configuration and disk partitioning will be performed, and also a installation of base system.
es: En este punto se realizará la configuración automática de red y particionado de disco, así como la instalación del sistema base.

source: As mentioned in :ref:`Minimum requirements` is required at least one public IP address for User and Trunk SIP proxies. Remember that if you use only one, KamTrunks will use different SIP ports to avoid collision.
es: Como se mencionó en :ref:`Requisitos mínimos` se requiere al menos una dirección IP pública para los proxies de Usuarios y Troncales. Recordar que en caso de utilizar una única dirección IP, los puertos SIP del proxy de salida se cambiarán para evitar la colisión entre ambos.

source: You can set its addresses right now and configure the interfaces properly when the system is fully installed. This menu can be displayed anytime after the installation.
es: Puede asignar sus valores ahora y configurar sus interfaces mas tarde, o bien puede mostar el siguiente menu para configurar estos valoresmás adelante.

source: You can also configure default root MySQL password right now.
es: También puede configurar el valor por defecto para acceder a MySQL en este momento.

source: If you don't configure MySQL password, default password will be used (changeme). You can still change it later.
es: Si no configura contraseña para el administrador de MySQL, se empleará la de por defect (changeme). Puede cambiarla más adelantesi lo desea.

source: And default language for portals:
es: Y el idioma por defecto de los portales web:

source: It is not require to configure all settings during initial installation. In case any setting has been left without configuration a warning dialog will be displayed.
es: No es preciso configurar todas estas cosas durante la instalación.En caso de que algún dato esté sin configurar se mostará un dialogode aviso:

source: At last, select where the GRUB boot loader will be installed.
es: Por último, seleccione el disco donde se instalará el cargador de arranque GRUB.

source: After the reboot, you are ready to access using the web portals!
es: Una vez reiniciada la máquina podrá entrar y acceder a través de los portales web!

source: Any of the public IP addresses configured during the installation will work to acces the web portal. Default credentials are **admin / changeme**.
es: Cualquiera de las IPs públicas configuradas en la instalación servirá para acceder al panel web. Las credenciales por defecto son **admin / changeme**.

source: Debian packages install
es: Instalación por paquetes Debian

source: IvozProvider is designed to be installed and updated using Debian packages. More exactly, the current release is ready to be installed on `Debian Stretch 9 <https://www.debian.org/releases/stretch>`_.
es: IvozProvider está diseñado para instalarse y actualizarse mediante paquetes Debian. En concreto, la release actual esta pensada para funcionar sobre `Debian Stetch 9 <https://www.debian.org/releases/stretch>`_.

source: It's recommended to use one of the `official installation guides <https://www.debian.org/releases/stretch/installmanual>`_ to install the minimum base system. The rest of required dependencies will be installed automatically with IvozProvider meta packages.
es: Se recomienda emplear las `guias oficiales de instalación <https://www.debian.org/releases/stretch/installmanual>`_ para obtener un sistema base mínimo, ya que toda dependencia que necesite posteriormente será instalada automaticamente.

source: No matter if you are installing a :ref:`StandAlone install` or a :ref:`Distributed install`, it's required to configure Irontec debian repositories.
es: Tanto si deseas realizar una :ref:`instalación standalone` o una :ref:`instalación distribuida`, es preciso configurar los repositorios de paquetes debian de Irontec.

source: APT Repository configuration
es: Configurar repositorios APT

source: Right now, two different repositories are used for the latest IvozProvider release (called oasis) and it's frontend Klear release (called chloe).
es: Actualmente se emplean dos repositorios diferentes tanto para la última release de IvozProvider (oasis) como para la de Klear (chloe)

source: Optionally, we can add the repository key to check signed packages:
es: Opcionalmente, añadimos la clave publica del repositorio:

source: Installing profile package
es: Instalar el paquete del rol

source: Once the repositories are configured, it will be required to select the proper metapackage depending on the type of installation.
es: Una vez configurados los repositorios será preciso seleccionar el paquete acorde al perfil que queramos instalar:

source: For a :ref:`StandAlone install`:
es: Para una :ref:`instalación standalone`:

source: For a :ref:`Distributed install`: one of the profile packages depending on the role the machine will perform.
es: Para una :ref:`instalación distribuida` uno de los paquetes en función rol se desee que desempeñe la máquina

source: Finish the installation
es: Completar instalación

source: Distributed installation require a couple manual configuration based on the roles that are performing. Check `finishing role configuration <https://github.com/irontec/ivozprovider/issues/271>`_ for more information.
es: Las instalaciones distribuidas requieren multiples configuraciones en funcion del rol que se haya instalado. Consulte `completar la instalción de un rol <http://github.com/irontec/ivozprovider>`_ para más información.

source: Standalone installation have a menu that can be used to configure the basic services used in IvozProvider. Most of the services are automatically configured to work in the same machine with the default values.
es: Las instalaciones standalone cuentan con un menú que ayuda a configurar los datos básicos de los servicios empleados en IvozProvider. Puesto que todos los servicios se ejecutan en la misma máquina, muchos de los procesos vienen configurados automáticamente con los valores por defecto.

source: This menu allows:
es: El menú permite, entre otros:

source: Configure IP address(es) for SIP proxies
es: Configurar la(s) IP(s) pública(s) de los proxies SIP

source: Default platform language
es: El lenguaje por defecto que empleará la plataforma

source: Administrator MySQL database password
es: Las contraseñas para acceder a las bases de datos

source: It's possible to change any of this values anytime by running:
es: Es posible cambiar cualquiera de estos valores una vez instalado IvozProvider volviendo a ejecutar:

source: Extra components
es: Componentes extra

source: In some countries, you might have to pay royalty fees in order to use G.729 codec to their patent holders. We're not legal advisors regarding active or withdrawn world patents.
es: En algunos paises, es posible que tenga que pagar derechos a los titulares de las patentes de G.729. No somos asesores legales al respecto de las patentes activas o retiradas.

source: You can use G.729 with IvozProvider, but installation must be done manually. G.729 codec is optimized for each CPU type and version of asterisk, so each installation may require a different codec module.
es: Puede emplear G.729 con IvozProvider, pero la instalación debe ser realizada manualmente. El codec G.729 esta optimizado para cada tipo de CPU y versión de asterisk, por lo que cada instalación puede requerir un módulo de codec diferente.

source: You can download codec from `here <http://asterisk.hosting.lv/>`_ under the section Asterisk 13.
es: Puede descargar el codec `aqui <http://asterisk.hosting.lv/>`_ bajo la sección Asterisk 13.

source: Once downloaded, move the `.so` file to **/usr/lib/asterisk/modules/** and rename it to **codec_g729.so**
es: Una vez descargado, mueva el fichero `.so` a la ruta **/usr/lib/asterisk/modules/** y renómbrelo a **codec_g729.so**

source: You can check the codec is valid by restarting asterisk and printing the available codec translations using:
es: Puede comprobar si el codec es válido reiniciado asterisk y mostrando la lista de traducciones de codes disponibles:

source: Initial Installation
es: Instalación inicial

source: Installation Types
es: Tipos de instalación

source: Distributed Install
es: Instalación distribuida

source: IvozProvider software is designed to run distributed between multiple systems in what we call profiles:
es: IvozProvider está diseñado para que la mayor parte del software trabaje de manera distribuida en lo que llamamos perfiles.

source: Each profile is in charge of performing one of the platform functionalities:
es: Cada perfil es encargado de realizar una de las funciones de la plataforma:

source: Data storage
es: Base de Datos

source: SIP Proxy
es: Proxy SIP

source: Application Server
es: Servidor Aplicaciones

source: Web portal
es: Portal Web

source: For each of this profiles, there's a virtual package that will install all the required dependencies (see :ref:`Installing profile package`).
es: Para cada uno de estos perfiles existe un paquete virtual que instalará todas las dependencias necesarias (ver :ref:`Instalar el paquete del rol`).

source: You can install as many instances as you want for each profile, but take into account, that while some of them are designed to scale horizontally (for example: asterisk or media-relays) others will require aditional software so the systems that have the same profile are syncronized (for example: database replication or http request balancing).
es: Puedes instalar cuantas instancias desees de cada perfil, pero ten en cuenta que, mientras algunos estan pensados para escalar horizontalmente de manera nativa (por ejemplo: asterisk o media-relays) otros requerirán software adicional para que las máquinas del mismo perfil esten coordinadas (por ejemplo: replicación de bases de datos o balanceo de peticiones web).

source: StandAlone Install
es: Instalación standalone

source: If you want a small installation to make a couple of tests or give a basic service, we have designed all this configuration so they can work in a single machine.
es: Pero si lo que deseas es tener una plataforma pequeña para realizar tus pruebas o dar un servicio básico, hemos diseñado todas las configuraciones para que puedan convivir en una sola máquina.

source: We have called this kind of installations **StandAlone** and we have also created :ref:`Automatic ISO CD image` so you can install in a couple of minutes.
es: Hemos bautizado este tipo de instalaciones como **StandAlone** y hemos creado :ref:`CDs automáticos de instalación` para que puedas instalarlos en un par de minutos.

source: Minimum requirements
es: Requisitos mínimos

source: System requirements
es: Requisitos de sistema

source: IvozProvider is designed to be installed using Debian GNU/Linux APT package system.
es: IvozProvider está diseñado para funcionar e instalarse a través del sistema de paquetes APT de Debian GNU/Linux.

source: It's recommended to install IvozProvider in a dedicated server for the platform. Many of the installed software may not work properly with other pre-installed services (like MySQL or DNS servers).
es: Es recomendable instalar IvozProvider en una máquina dedicada para la plataforma. Muchos de los software instalados podrían hacer malfuncionar otros software pre-instalados (por ejemplo MySQL o servidores DNS).

source: For a StandAlone installation, we recommend at least:
es: Para una instalación standalone, se requiere al menos:

source: 4 CPUs (x86_64 or i386)
es: 4 CPUs (x86_64 o i386)

source: 4 Gb memory
es: 4 Gb memoria

source: 30GB HDD
es: 30GB Disco Duro

source: 1/2 public IP Addresses (read note behind)
es: 1/2 IPs públicas (leer nota)

source: Since version 1.2 it is possible to make both KamUsers and KamTrunks share a unique public IP address. If so, **KamTrunks ports will be changed from 5060 (TCP/UDP) to 7060 (TCP/UDP) and from 5061 (TCP) to 7061 (TCP)**.
es: Desde la versión 1.2 is posible hacer que el proxy de usuarios y el proxy de salida utilicen la misma direción IP pública. En este caso, **se cambiarán los puertos del proxy de salida de 5060 (TCP/UDP) a 7060 (TCP/UDP) y de 5061 (TCP) a 7061 (TCP)**.

source: If you're not using a :ref:`Automatic ISO CD image` you will also need:
es: Si no está empleando la :ref:`CDs automáticos de instalación` también será necesario:

source: Debian Jessie 8.0 base install
es: Instalación base de Debian Jessie 8.0

source: Internet access
es: Acceso a Internet

source: About this document
es: Sobre este documento

source: This document describes the process of installation and usage of IvozProvider, the multi-tenant telephony platform for providers developed by `Irontec <http://irontec.com>`_.
es: Este documento describe el proceso de instalación y de utilización de IvozProvider, la plataforma de telefonía multinivel orientada a operadores desarrollada por `Irontec <http://irontec.com>`_.

source: This should be the starting point for anyone interested in this solution, both from the technical point of view and the user one and it's divided in four blocks:
es: Es el punto de partida para todo aquel interesado en esta solución, tanto desde el punto de vista técnico como desde el punto de vista de uso y consta de cuatro bloques:

source: The first block is about :ref:`concepts` where each element of the product and its main function is decscribed.
es: El primer bloque expone unos :ref:`concepts` que desglosan los elementos del producto y su función.

source: The second block describes the :ref:`installation` process with a fresh installed platform, leaving the deep configuration details for the next block.
es: El siguiente bloque se describe el proceso de :ref:`installation` con la plataforma recién instalada, dejando de lado detalles que describirán en profundidad en el siguiente bloque.
