Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/basics.po
Languages: es

source: The third block goes deeper into the most :ref:`advanced` features like **trarification, billing, PBX advanced options and every call details** that were omitted in the previous block.
es: El tercer bloque es el que profundiza en aspectos de :ref:`advanced` como **tarificación, facturación, funcionalidades de PBX y todos los detalles** que en el bloque anterior se obviaron.

source: The fourth and last block describes the :ref:`security` measures that implements the solution.
es: En el cuarto y último, se describen los mecanismos de :ref:`security` queimplementa la solución.

source: Getting help
es: Obtener ayuda

source: IvozProvider is an alive and highly developed project. There are multiple channels to get information or report bugs:
es: IvozProvider es un proyecto vivo y en continua evolución. Existen múltiples canales para obtener información o reportar errores:

source: Users mailing list: users@lists-ivozprovider.irontec.com
es: Listas de correo para usuarios: users@lists-ivozprovider.irontec.com

source: Developers mailing list: dev@lists-ivozprovider.irontec.com
es: Listas de correo para desarrolladores: dev@lists-ivozprovider.irontec.com

source: email: vozip@irontec.com
es: Dirección de correo: vozip@irontec.com

source: IRC Channel `#ivozprovider <https://webchat.freenode.net/?channels=ivozprovider>`_ at irc.freenode.net
es: Canal IRC `#ivozprovider <https://webchat.freenode.net/?channels=ivozprovider>`_ enirc.freenode.net

source: Don't hesitate to contact us for any kind of feedback :)
es: No dudes en contactarnos cualquiera que sea el motivo :)

source: Introduction to IvozProvider
es: Introducción a Ivozprovider

source: The following sections will serve as general introduction to IvozProvider:
es: Las siguientes secciones servirán como introducción general a IvozProvider:

source: Who should use IvozProvider?
es: ¿Quién debería de usar IvozProvider?

source: IvozProvider is a good option for those insterested in having a telephony platform that can provide service to **thousands concurrent calls**.
es: IvozProvider es un buen candidato para todo aquel que esté interesado en disponer de una plataforma de telefonía para poder dar servicios a **miles de llamadas de forma concurrente**.

source: The greatest strengths of IvozProvide can help to decide if the solution feeds your needs:
es: Las grandes fortalezas de IvozProvider pueden servir para saber si IvozProvider encaja en tu caso concreto:

source: Multilevel, multitenant
es: Multinivel, multimarca.

source: Horizontal scaling
es: Escalado horizontal.

source: PseudoSBC: open to Internet
es: PseudoSBC: abierto a Internet.

source: PBX Features
es: Funcionalidades de PBX.

source: The installation process is so simple, that the best way to test if IvozProvider fullfills yout needs is to test it!
es: El proceso de instalación es tan simple, que la mejor forma de saber si IvozProvider es para ti, ¡es probarlo!

source: What is inside IvozProvider?
es: ¿Qué hay dentro de IvozProvider?

source: IvozProvider uses well-known and stable `Free Software <https://www.gnu.org/philosophy/free-sw.en.html>`_ projects to fullfill the different required task of the platform.
es: IvozProvider incluye proyectos de `Software Libre <https://www.gnu.org/philosophy/free-sw.es.html>`_ de reconocido prestigio y larga trayectoria para cumplir las tareas de diversa índole que necesita la plataforma.

source: Nothing better than an image to show all the software that its integrated into IvozProvider:
es: Nada como una imagen para ilustrar los distintos proyectos que integra IvozProvider:

source: We can not stress enough our gratitude to the developers and communities of this projects.
es: Nuestro más sincero agradecimiento a los desarrolladores de todos estos proyectos, así como a las comunidades de usuarios.

source: The task of each of this software will be deeply detailed in the block :ref:`architecture`.
es: La función que cumple cada una de estas piezas se detallará con mayor profundidad en el bloque titulado :ref:`architecture`.

source: What is IvozProvider?
es: ¿Qué es IvozProvider?

source: IvozProvider is a :ref:`provider oriented <operator_oriented>` :ref:`multilevel <multilevel>` :ref:`IP telephony <voip>` solution :ref:`exposed to the public network <exposed>`.
es: IvozProvider es una solución de :ref:`telefonía IP <voip>` :ref:`multinivel <multinivel>` :ref:`orientada a operador <operator_oriented>` :ref:`expuesta a la red pública <exposed>`.

source: IP Telephony
es: Telefonía IP

source: IvozProvider supports telephony systems that use *Session Initialitation Protocol*, **SIP**, described in `RFC 3261 <https://tools.ietf.org/html/rfc3261>`_ and any `related RFCs <https://www.packetizer.com/ipmc/sip/standards.html>`_ independent of manufacturers.
es: IvozProvider es compatible con los sistemas de telefonía que utilicen el protocolo *Session Initiation Protocol*, **SIP**, descrito en el `RFC 3261 <https://tools.ietf.org/html/rfc3261>`_ y todos los `RFCs relacionados <https://www.packetizer.com/ipmc/sip/standards.html>`_, independientemente del fabricante.

source: This allows total freedom to choose *softphones*, *hardphones* and the rest of elements that interact with IvozProvider, without any kind of binding with a manufacturer.
es: Esto implica libertad total a la hora de elegir *softphones*, *hardphones* y el resto de elementos que interactúan con IvozProvider, sin ningún tipo de ataduras a ningún fabricante.

source: Right now, IvozProvider supports the following **transport protocols** for SIP:
es: En lo relativo a los **protocolos de transporte** para transportar SIP, actualmente IvozProvider soporta:

source: This last transport protocol described in `RFC 7118 <https://tools.ietf.org/html/rfc7118>`_ supports web intregrated softphones, using the `WebRTC <https://webrtc.org/>`_ standard allowing browsers to establish real-time *peer-to-peer* connections.
es: Este último protocolo de transporte descrito en el `RFC 7118 <https://tools.ietf.org/html/rfc7118>`_ permite la utilización de softphones desde la web, utilizando el estándar `WebRTC <https://webrtc.org/>`_ de los navegadores web para establecer comunicaciones en tiempo real *peer-to-peer*.

source: The **supported audio codec** list is:
es: En lo relativo a los **codecs de audio soportados**, la lista sería la siguiente:

source: Multilevel
es: Multinivel

source: The web portal design of IvozProvider allows **multiple actors within the same infrastructure**:
es: El esquema de portales y diseño de IvozProvider permite que **múltiples actores cohabiten en una misma infraestructura**:

source: In :ref:`operation_roles` section, the different roles are deeply described, but to sum up:
es: En la sección :ref:`operation_roles` se describen los distintos roles en profundidad, pero se puede resumir en:

source: **God Admin**: The administrator and maintainer of the solution. Provides access to multiple brand operators.
es: **Nivel God**: instalador y mantenedor de la solución. Da acceso a n operadores de marca.

source: **Brand Operator**: Responsible of giving access, tarificate and bill to multiple company operators.
es: **Nivel Brand Operator**: Responsable de dar acceso, tarificar y facturar a n operadores de empresa.

source: **Company Operator**: Responsible of its own PBX configuration and to manage the final platform users.
es: **Nivel Company Operator**: Responsable de configurar el comportamiento de su centralita y dar de alta n usuarios finales.

source: **Users**: The last link of the chain, has SIP credentials and can access its own portal for custom configurations.
es: **Nivel de Usuario**: Dispone de unas credenciales para sus terminales SIP y otra para el acceso a su panel web.

source: **Each one** of this roles **has its own portal** that allows them to fullfill their tasks. Each portal can be customized in the following ways:
es: Cabe destacar que **cada uno** de estos niveles **dispone de un acceso web** que le permite realizar sus funciones. Los acceso web se pueden personalizar a nivel de:

source: Themes and *skins* for corporative colours.
es: Temas y *skins* con los colores corporativos.

source: Company Logos.
es: Logo de la empresa.

source: Customized URLs with the Brand or Company domain.
es: URLs personalizadas con el dominio de la marca/empresa.

source: Provider oriented
es: Orientada a operador

source: IvozProvider is a telephony solution **designed with horizontal scaling in mind**, what allows handling a great amount of **traffic and users** only by increasing the machines and resources of them.
es: IvozProvider es una solución de telefonía **diseñada con el escalado horizontal en mente**, lo que la permite adecuarse a **altos volúmenes de tráfico y de usuarios** sin más que adaptar el número de máquinas y los recursos de éstas.

source: This are the main ideas that makes this product provider oriented:
es: Estas son las ideas principales que lo hacen un producto orientado a operador:

source: Despite the fact that all machine profiles can run in the same host, whatmakes it easier for the initial testing, each profile of IvozProvider can be splitted from the rest to make it run in its own machine.
es: A pesar de que todas las piezas pueden correr en una misma máquina, lo que facilita las pruebas iniciales, cada elemento de IvozProvider se puede separar del resto y correr en su propio hardware.

source: A **distributed installation** allows to distribute the correct amount of resources to each task, but also:
es: Una **instalación distribuida** permite asignar máquinas con recursos adecuados a cada tarea, pero también posibilita:

source: Geographic distribution of elements to warranty high availability in caseof CPD failure.
es: Separación geográfica de los elementos para garantizar una disponibilidad a prueba de fallo de CPD.

source: Setup of key elements near the final users, to minimize the communication latencies.
es: Instalación de elementos clave cerca de los usuarios finales, para minimizar latencias en sus comunicaciones.

source: Horizontal scaling of key profiles to handle hundred of thousands concurrent calls.
es: Escalado horizontal de los elementos clave para dar servicios a cientos de miles de llamadas concurrentes.

source: The resource consuming elements that limit the service of VoIP solutions use to be:
es: Los elementos que limitan la capacidad de servicio de las soluciones VoIPsuelen ser:

source: Already established calls audio management.
es: Gestión del audio de las llamadas establecidas.

source: Managing configuration for each company administrator (IVRs, conference rooms, external call filters, etc.)
es: Gestión de las lógicas programadas por cada administador de empresa (IVRs, salas de conferencias, filtros de horario, etc.)

source: Databases of configuration and records.
es: Bases de datos de almacenamiento de configuraciones y registros.

source: IvozProvider was designed always keeping in mind the **horizontal scaling** of each of its elements, so it **can handle hundred of thousands concurrent calls** and what is more important, **adapt the platform resources to the expected service quality**:
es: IvozProvider ha sido diseñado con la idea de mantener el **escalado horizontal** de cada uno de estos elementos, **para así poder llegar a poder gestionar cientos de miles de llamadas concurrentes** y, lo que es más importante, poder **adaptar los recursos de la plataforma al nivel deservicio que se espera en cada momento**:

source: **Media-relay** servers handle audio frames for the already established calls:
es: Los **Media-relays** se encargan de reenviar las tramas de audio de las sesiones establecidas:

source: You can use as many media-relays as you need.
es: Se pueden poner tantos media-relays como sean necesarios.

source: You can join media-relay in groups, and force some companies to use a group if you want.
es: Se pueden crear grupos de media-relays y hacer una asignación estática a las empresas deseadas.

source: You can setup media-relays near the final users, to minimize network latencies in the calls.
es: Se pueden poner los media-relays cerca de los usuarios finales, para evitar latencias en las llamadas.

source: **Application servers** are in charge of processing the configurad logics:
es: Los **Servidores de Aplicación** se encargan de la fase previa de toda llamada: hacer que siga la lógica programada. Este rol:

source: They scale horizontally: new Application Serves can be installed and added to the pool if you feel the need.
es: Se puede escalar horizontalmente: que los Servidores de Aplicación empiezan a estar saturados, se instalan más y se añaden al pool.

source: Every call is handled by the least busy Appliction Server
es: Una llamada acaba en el Servidor de Aplicación que menos cargado esté en cada momento.

source: By default, there is no static assigment * between Companies and Application Servers. This way failure of any Application Server is not critical: the platform will ignore the faulty Application Server while distributing calls.
es: En la configuración por defecto no existe asignación estática * que envíe las llamadas de una empresa a un Servidor de Aplicación concreto, de modo que la caída de cualquier Servidor de Aplicación no es crítica: el sistema dejará de contar con él a la hora de distribuir las llamadas.

source: Exposed to the public network
es: Expuesta a la red pública

source: As showed in the installation proces, **IvozProvider is designed to serve users directly from Internet**. Although it can be used in local enviroments, IvozProvider is designed to use public IP addresses for its services, removing the need of VPN or IPSec tunnels that connect the infrastructure with the final users
es: Tal y como se verá en el proceso de instalación, **IvozProvider está diseñado para servir a usuarios directamente desde Internet**. Aunque pueda utilizarse en entornos locales, IvozProvider se ha diseñado para disponer de direcciones IPs públicas para dar servicio sin necesidad de túneles VPN o IPsec que te conecten con la infraestructura.

source: Highlights:
es: Cabe destacar:

source: Only the required services will be exposed to Internet.
es: Solo los elementos imprescindibles están expuestos a Internet.

source: The unstrusted origins access can be filtered out by integrated firewall
es: Los accesos desde países de dudosa confianza se cortan en el firewall incorporado.

source: Access from IP addresses or networks can be filtered to avoid any kind of phishing.
es: Se puede filtrar el acceso desde IPs/redes autorizadas para evitar fraudes.

source: There is also an anti-flood mechanism to avoid short-life Denial of Service attacks.
es: Existe un mecanismo anti-flood para evitar grandes consumos en poco tiempo.

source: Each company concurrent calls can be limited to a fixed amount.
es: Existe un mecanismo de control de llamadas concurrentes por empresa.

source: IvozProvider supports connection from terminals behind `NAT <https://es.wikipedia.org/wiki/Traducci%C3%B3n_de_direcciones_de_red>`_.
es: IvozProvider soporta la conexión desde terminales tras `NAT <https://es.wikipedia.org/wiki/Traducci%C3%B3n_de_direcciones_de_red>`_.

source: IvozProvider keep track of those NAT windows and keep them alive with *nat-piercing* mechanisms.
es: IvozProvider se encarga de mantener activas dichas ventanas de NAT con mecanismos de *nat-piercing*.

source: The global administrator can assign Application Servers to companies but this feature is more designed as a temporal debug and troubleshoot measure.
es: El administrador global puede asignar Servidores de Aplicación estáticamente a empresas, pero esta funcionalidad está pensada como herramienta de *troubleshooting* puntual.

source: Brand operator can access a portal with less sections available compared to the previous role. The general (God) administrator is in charge of providing an URL with credentials for its brand portal.
es: El operador de marca utiliza la plataforma con un acceso y una visibilidad menor que el rol anterior. En concreto, el operador global le facilita una URL y unas credenciales y ese portal web de operador de Marca es su único interfaz con IvozProvider.

source: The most important task for brand operator can be managed through this portal: **create and configure companies so they can work properly**.
es: No obstante, este portal le permite desempeñar su función más importante,que es **crear empresas y configurar todo lo necesario para que éstas desempeñen su función**.

source: Due to brand operators are also resposible of billing their companies and make sure the external cals are properly setup, it must also manage:
es: Dado que el operador de marca es el encargado de facturar a sus empresas y de hacer que sus llamadas salgan al exterior, también tiene que gestionar:

source: Peering contracts with other IP providers for PSTN interconectivity.
es: Contratos de Peering con otros operadores IP para conectar con la PSTN.

source: Include all required company information for the billing process.
es: Incluir en los datos de la empresa toda información necesaria para las facturas.

source: Pricing plans that will offer to their companies, that will determine how match they pay for each call.
es: Planes de Precio que ofertarán a sus empresas, qué determinarán cuánto pagan por cada tipo de llamada.

source: Setup the routes for each outgoing call types based on their final destination
es: Configurar por dónde sale cada tipo de llamada de cada empresa, en función del destino.

source: Create the invoices for each billing period and send them to their clients.
es: Generar las facturas en cada período de facturación y emitarlas al cliente.

source: As you can see, the task of brand operator has little in common with the global operator, but their importance is vital so the final users can use all the features includes in IvozProvider
es: Como se puede ver, las tareas del operador de marca poco tienen que ver con las del operador global, pero son vitales para que los usuarios finales puedan hacer uso de las funcionalidades de IvozProvider.

source: **To sum up**, the brand operators **grant access** to the **company** administrators they serve and **configure the platform to route, tarificate and bill their calls**.
es: **En resumen**, los operadores de marca **dan acceso a** los administradores de las **empresas** a las que den servicio **y configuran la plataforma para poder enrutar, tarificar y facturar sus llamadas**.

source: The company administrator has access to the portal supplied by the brand operator.
es: El administrador de empresa dispone del acceso web que le proveé el administrador de marca.

source: From its point of view, it has a virtual pbx in the cloud that must configure for its users.
es: Desde su perspectiva, dispone de una centralita virtual en la nube que tiene que configurar para que la utilicen sus usuarios.

source: To accomplish that, it's required:
es: Para ello, tendrá que:

source: Configure terminals, extensions and users.
es: Dar de alta terminales, extensiones y usuarios.

source: Configure the DDI incoming process with the proper logic:
es: Configurar el tratamiento de los DDIs de entrada, para que se comporten como quieran:

source: Directly to an user
es: Directos a usuario

source: Hunt groups
es: Grupos de Salto

source: Give access to the final users to their web portal, so they can configure their profile options:
es: Dar acceso a los usuarios finales a su portal web, para que configuren a su gusto aspectos como:

source: Call forward
es: Desvíos

source: Do not disturb
es: No molestar

source: Call waiting
es: Llamada en espera

source: To sum up, the company administrators are resposible for **configuring the telephony system and make use of all the features available in IvozProvider**.
es: En resumen, los administradores de empresa son los responsables de **configurar su sistema de telefonía a su gusto y de utilizar todas las funcionalidades que proveé IvozProvider**.

source: The global administator role (operator in the image) is usually done by the installation responsible.
es: El rol de administrador global (operador en la imagen) lo desempeña habitualmente instalador de IvozProvider.

source: All options and platform features are visible to this role and usually is in charge of its maintenance.
es: Tiene visibilidad total de todos los aspectos de la plataforma y suele ser el encargado del mantenimiento de la misma.

source: Their most important task is to **create Brands** and configure them so they have the enough autonomy to properly use the platform:
es: Su **función más importante es crear Marcas** y hacer todo lo necesario para que dispongan de la autonomía necesaria para usar la plataforma:

source: Configure their web access.
es: Configurar sus accesos web.

source: Configure their brand portal look and feel: themes, colors, etc.
es: Configurar el aspecto de su portal de administración de marca: tema, colores, etc.

source: Appart from their main task, their global visibility and total access makes them responsible of:
es: Aparte de esta función principal, su visibilidad global y acceso total le hacen responsable de:

source: Monitor the platform so it keeps always UP & RUNNING
es: Monitorizar la plataforma para que esté siempre UP & RUNNING.

source: Analyze platform logs to track possible errors.
es: Analizar los logs de la plataforma en busca de posibles errores.

source: Polish the security mechanisms to avoid external attacks.
es: Afinar los mecanismos de seguridad para evitar ataques externos.

source: Obtain global statistics of calls audio quality.
es: Obtener estadísticas globales de calidad de llamada.

source: Increase the available resources of the platform as long as is needed:
es: Ir aumentando los recursos de la plataforma a medida que se vaya necesitando:

source: Increasing resources available in a standalone installation
es: Aumentando los recursos de la instalación standalone.

source: Migrating, whenever required, to a distributed installation with multiple AS, media relays, etc.
es: Migrando, llegado el momento, a una instalación distribuida con múltiples AS-es, media relays, etc.

source: To sum up, **this role is the only one that has no limits within the platform**, thats why *God* is a term used in multiple places along this documentation.
es: En resumen, **es el único rol que no tiene límites dentro de la plataforma**, de ahí la denominación *God* que se utilizará en múltiples lugares de esta documentación.

source: *This role is responsible of maintain the platform**, configuring it for the correct behaviour. This role **doesn't have any kind of limit** and **grants access** to the **brand operators**.
es: **Este rol se encarga de mantener la plataforma**, adaptándola a las necesidades de cada momento. Su rol **no tiene ningún tipo de límite y** es el que **da acceso a** los *n* **operadores de marca**.

source: Platform roles
es: Roles de la plataforma

source: IvozProvider is a multilevel role provider solution.
es: Ivozprovider es una solución orientada a operador con múltiples niveles de usuarios.

source: The following images shows the different available levels and the relation between them:
es: La siguiente imagen ilustra los niveles que existen, así como la relación entre ellos:

source: This section will explain each of the available roles, describing their responsibilities and more important tasks.
es: En esta sección se explicará cada uno de estos roles, describiendo sus responsabilidades y sus funciones más importantes.

source: Global administator role
es: Rol de administrador global

source: Brand andministator role
es: Rol de operador de marca

source: Company administator role
es: Rol de administrador de empresa

source: Final user role
es: Rol de usuario final
