Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/brand.po
Languages: es

source: Email sent when a new fax is received
es: Correos electrónicos enviados cuando se recibe un fax nuevo.

source: When no custom notification is configured, default ones will be used
es: Si no se configuran notificaciones, se emplearán notificaciones genéricas

source: Notifications are created in two steps: Create a notification type and add contents to the notification for each required language.
es: Las plantillas de notificaciones son creadas en dos pasos: Crear una tipo de notificación y añadir contenido a la notificación para cada lenguaje necesario.

source: Creating a new notification
es: Crear una nueva notificación

source: Brand administrators can create new notification templates in **Brand configuration** > **Notification templates**:
es: Los administradores de marca puede crear nuevas plantillas de notificacion en **Configuración de marca** > **Plantillas de notificación**

source: Fields are nearly self-explanatory:
es: Los campos son auto-explicativos

source: Name
es: Nombre

source: Used to identify this notification template
es: Empleado para identificar esta plantilla de notificación

source: Type
es: Tipo

source: Determine the notification type. Each notification type has its own substitution variables avaiable to replace the contents of the subject and body.
es: Determina el tipo de notificación. Cada tipo de notificación tiene sus propias variables de sustitución disponibles para poder replazar en los contenidos del asunto y cuerpo.

source: Adding Notification contents
es: Añadiendo contenidos a la notificación

source: Once the notification has been created, you can add different language contents. IvozProvider will automatically use the proper language based on the destination:
es: Una vez la notificación ha sido creada, se pueden añadir contenidos para los diferentes languages. IvozProvider eligirá automáticamente el lenguaje en función del destino:

source: For Voicemails, the user language will be used
es: Para buzones de voz, el lenguaje del usuario del buzón será empleado

source: For Faxes, the company language will be used.
es: Para faxes, el lenguaje de la compañía será empleado.

source: Configurable fields of each content:
es: Campos configurables para cada contenido:

source: Language
es: Lenguaje

source: Language of the contents.
es: Lenguaje de los contenidos

source: From Name
es: Nombre origen

source: The from name used while sending emails (p.e. IvozProvider Voicemail Notifications)
es: Nombre mostar al enviar correos electrónicos (p.e. Notificaciones Buzón de voz IvozProvider)

source: From Address
es: Dirección origen

source: The from address used while sending emails (p.e. no-reply@ivozprovider.com)
es: Dirección origen mostrado al enviar corros electrónicos (p.e. no-reply@ivozprovider.com)

source: Substitution variables
es: Sustitución de variables

source: Avaialble variables that can be used in subject and body that will be replaced before sending the email. Each notification type has its own variables.
es: Variables disponibles que pueden emplearse en el asunto y cuero y serán remplazadas antes de enviar el correo electrónico. Cada notificacion cuenta con sus propias variables de sustitución.

source: Subject
es: Asunto

source: Subject of the email to be sent. You can include Substitution variables here.
es: Asunto del email que se enviará. Puede emplear variables de sustitución aquí.

source: Body
es: Cuerpo

source: HTML Body of the email to be sent. You can include Substitution variables here.
es: Cuerpo HTML del email que se enviará. Puede emplear variables de sustitución aquí.

source: There is no need to create all content languages. If custom notification has some languages not defined the default contents will be used for that notification type.
es: No es neceario crear contenidos para todos los lenguajes. Si una notificación no tiene un lenguaje definido, se emplearán los contenidos por defecto para ese lenguaje y tipo de notificación.

source: Assigning templates to companies
es: Asignar plantillas a compañías.

source: Once the notification has been configured for the desired languages, Brand administrator must assign it to the Company or Retail Client that will use it. This can be done in the Notification configuration section of Company and Retail Client edit screen.
es: Una vez configurada la notificación para los idiomas deseados, los administradores de Marca deben asignarlas a las Compañias o Clientes Retail que las emplearán. Esta asignación se realiza en la sección Configuración de Notificaciones de las pantallas de edición de Compañía y Cliente Retail.

source: A **Peer Server** is a SIP server associated to an IP Provider. In order to add some Peer Servers for the Peer Contract that have just created, we only have to use the following section:
es: El concepto de **PeerServer** se refiere a los distintos servidores SIP que puede tener un Operador IP para servir su dominio SIP. Para definir los PeerServers del OPERADOR que acabamos de definir, hay que pulsar este botón:

source: As displayed by the zero counter, no Peer Serve has been created yet:
es: Tal y como indica el 0, no hay ningún PeerServer definido, por lo que añadimos uno:

source: Used to identify this Peer Server
es: Se utilizará para referencia a este PeerServer.

source: Description
es: Descripción

source: Optional field with any required extra information.
es: Un campo adicional para escribir algún detalle.

source: IP address (or DNS registry) of the Peer Server. You can also specify a port if it's different from 5060.
es: Dirección IP (o registro DNS) del PeerServer. Si utiliza un puerto distinto a 5060, se puede indicar con ':'.

source: URI Scheme
es: Esquema URI

source: Supported schemes are sip and sips. Use 'sip' in case of doubt.
es: Los esquemas soportados son sip y sips. Dejar en 'sip' en caso de duda.

source: Transport
es: Transporte

source: Supported transport protocols. Use 'udp' in case of doubt.
es: Los protocolos de transporte SIP soportados. En caso de duda, dejar 'udp'.

source: Outbound Proxy
es: Proxy saliente

source: Usually this is left empty. It can be filled with the IP address of the **SIP Proxy** domain (to avoid DNS resolution, but keeping the domain in the SIP messages). It works like a web proxy: instead of sending the SIP messages to destination **SIP Proxy**, they will be sent to the IP:PORT of this field.
es: Normalmente se deja vacío o se pone la IP del dominio indicado en **SIP Proxy** (para evitar resolución de dominios y hacer que el mensaje SIP contenga el dominio en lugar de una IP). Funciona como un proxy web:en lugar de enviar los mensajes SIP al destino de **SIP Proxy**, los envía a la IP:PUERTO de este campo.

source: Requires Authentication
es: Requiere autenticación

source: Some Peering contracts validate our platform by IP, others require each session that we want to establish. For this last case, this section allows to configure user and password for this authentication.
es: Existen contratos de Peering que nos validarán por IP, otros necesitarán que nos autentiquemos en cada sesión que queramos establecer. En caso de ser del último grupo, este selector nos permite introducir un usuario y una contraseña para responder a esa autenticación.

source: Call Origin Header
es: Cabecera de origen de llamada

source: Some Providers get origin from SIP From header. Others use the From header for accounting and need extra headers to identify the origin. In case of doubt leave **PAI** checked.
es: Algunos operadores recogen el origen del From. Otros utilizan el From para validar la cuenta de cliente y necesitan cabeceras adicionales para recoger el origen. En caso de duda, marcar **PAI**.

source: R-URI Transformations before numeric transformations
es: Transformaciones R-URI previas a las transformaciones numéricas

source: This setting allow static changes to the destination of the calls before applying numeric transformation rules mentioned in :ref:`Numeric Transformations`. Some digits can be stripped from the begining, add a prefix, or even, add extra parameters to the URI followinging the given format. In case of doubt, leave empty.
es: Permiten realizar cambios estáticos al destino de la llamada antes de aplicar las reglas de transformación numéricas mencionadas en :ref:`Transformaciones Numéricas`. Se pueden quitar unos dígitos del comienzo, añadir un prefijo después e, incluso, añadir parámetros a la URI siguiendo el formato indicado. En caso de duda, dejar todo el bloque en blanco.

source: From header customization
es: Personalización de la cabecera From

source: For those providers that show origin in other headers (PAI/RPID), it is possible that request that From User have the account code being used and from domain their SIP domain. In case of doubt, leave empty.
es: Los operadores que muestren el origen en otras cabeceras (PAI/RPID), es posible que nos soliciten que el From User sea el número de cuenta de cliente y el From Domain (por ejemplo), su dominio SIP. En caso de duda, dejar en blanco.

source: There are many fields to establish *peering* with multiple kind of providers, but usually with the name and SIP Proxy will be enough (for those that validate our platform by IP) and Authentication (for those that won't).
es: Existen muchos campos para poder establecer *peering* con operadores de todo tipo, pero lo habitual será poner solo nombre y SIP Proxy (para los operadores que nos validen por IP) o nombre, SIP Proxy y Autenticación.

source: In case of defining multiple Peering Servers for a single Peering Contract, IvozProvider will balance and failover using all of them. Like with Application Servers, it will disable those who doesn't respond to our requests.
es: En caso de definir múltiples PeerServers para un PeeringContract, IvozProvider hará balanceo y failover utilizando todos. Es decir, a veces hablará a uno y otras veces a otro. En caso de que uno no le conteste, lo intentará con el resto hasta dar con uno que conteste.

source: Peering contracts
es: Contratos de Peering

source: These are the basic information of a Peering contract:
es: Analicemos los campos de un Contrato de Peering de ejemplo:

source: If we edit it, well see something like this:
es: Si entramos a editar este Contrato de Peering concreto:

source: Used to reference this Peering contract.
es: Se utilizará para referencia a este Contrato de Peering.

source: Numeric Transformation
es: Transformación numérica

source: Transformation that will be applied to the origin and destination of the incoming and outgoing numbers that use this Peering contact (see :ref:`Numeric transformations`).
es: Transformaciones que se aplicarán al origen y al destino a lasnumeraciones que entren o salgan por este contrato de peering (ver :ref:`Transformaciones Numéricas`).

source: External tarification
es: Tarificación externa

source: This setting requires the external tarification module and allows tarification on special numbers. This module is not standard so don't hesitate in :ref:`contact us <getting_help>` if you are interested.
es: Requiere del módulo de tarificación externa y permite tarificar llamadas entrantes a numeraciones especiales. Consultar a los :ref:`desarrolladores de la solución <getting_help>` en caso de estar interesados.

source: Fields marked with a red start are mandatory.
es: Los campos marcados con una estrella roja son obligatorios.

source: SIP Register
es: Registro SIP

source: Some providers require a `SIP Register <https://tools.ietf.org/html/rfc3261#section-10>`_ active in order to receive incoming calls to our DDIs. Some of them, even require this register in order to process our outgoing calls through their services.
es: Hay operadores que exigen que tengamos un `Registro SIP <https://tools.ietf.org/html/rfc3261#section-10>`_ activo para que nos metan las llamadas de nuestras numeraciones. Es más, existen operadores que exigen un registro activo para poder sacar llamadas a través de ellos.

source: IvozProvider supports any kind of *peering*, but we highly recomend *peer to peer peerings*: without authentication, without registry and validated by IP. This will avoid unnecessary traffic (authentication in each session and preriodic registers) and simplifies its configuration, just by leaving most of the fields by default.
es: IvozProvider soporta *peerings* de todo tipo, pero recomendamos acordar *peerings de tú a tú*: sin autenticación, sin registro y validados por IP. Esto evita tráfico innecesario (autenticación en cada sesión y registros periódicos) y simplifica la configuración, quedándose casi todo con los valores por defecto.

source: For this reason, IvozProvider allows periodic SIP register configuration in the following section:
es: Por este motivo IvozProvider permite configurar registros SIP periódicos por medio del siguiente botón:

source: If we create a new one, the following screen will be displayed:
es: Si creamos uno nuevo, nos encontramos con la siguiente ventana:

source: Username
es: Nombre de usuario

source: Account number or similar provider by the provider that requires SIP register.
es: Número de cuenta de cliente o similar proporcionada por el operador que exige registro SIP.

source: Domain
es: Dominio

source: Domain or IP of the registar server. Usually the same as the SIP proxy of the Peer server.
es: Dominio o IP del servidor de registros. Habitualmente el mismo que sirve de Proxy SIP en el PeerServer.

source: This will be sent in the SIP Contact header and must be unique in all the platform. For Peering contracts with an associated DDI, it is recommended to enter that DDI. In case of multiples DDI for the same Peering Contract, use any of them. If no DDI is associated with this Peering Contract just enter an unique numeric value.
es: Se envía en la cabecera Contact y tiene que ser único a nivel de toda laplataforma. En PeeringContracts con un DDI asociado, se recomienda meter ese DDI. En caso de múltiples DDIs asociados, se recomienda meter uno de ellos. En caso de ningún DDI asociado, se recomienda meter un valor único (cualquier valor que te deje guardar).

source: User
es: Usuario

source: Authentication user. Most of the time it's the same as username, so it's recommended to leave empty.
es: Usuario de autenticación, prácticamente siempre es igual al "Nombre de usuario" por lo que se recomienda dejar en blanco.

source: Register server URI
es: URI Servidor de registro

source: Usually this can be left empty, as it can be obtained from the Domain. If it is not the case, enter the IP address with the 'sip:' prefix.
es: Normalmente se puede dejar en blanco ya que se deduce del Dominio introducido. Si no fuera así, poner una dirección IP con 'sip:' por delante.

source: Leave empty to accept the authentication realm proposed by the provider. Define only if you are familiar to the authentication mechanism used in SIP.
es: Dejar en blanco para aceptar el propuesto por el extremo contrario.Definir solo si de estar familiarizado el mecanismo de autorización de SIP y saber lo que este campo implica.

source: Default suggested register expire time.
es: Tiempo que IvozProvider sugerirá como tiempo de expiración del registro.

source: Similar to the Peer Servers, there are lots of fields in the screen. You must have into account that most of the provider doesn't require register , and those who does, will only use user, domain and password.
es: Al igual que ocurre con los PeerServers, existen múltiples campos. Hay que tener en cuenta, no obstante, que la mayoría de operadores no deberían de exigir registro y, los que lo hagan, habitualmente solo requerirán de usuario, dominio y contraseña.

source: Portals URLS
es: URL Portales

source: This section allows configuration of client portals:
es: Esta sección permite configurar los portales de clientes:

source: **Company**: Administration portal for all company types
es: **Compañía**: Portal de administración para todos los tipos de compañías

source: **User**: Special portal for Virtual PBXs users
es: **Usuario**: Portal especial para usuarios de PBXs virtuales

source: URLs MUST be HTTPS
es: Las URLs deben ser HTTPS.

source: URLs MUST not end with slash /
es: Las URLs no deben terminar con barra /

source: Each URL can also configure a logo per URL, a theme and a phrase to use as the title of the portal allowing creation of corporative portals per company.
es: Cada URL puede también configurar un logo, un tema y titlo para emplear en en el portal, permitiendo la creación de portales por cada compañía.

source: For more information about each portal options see below menu sections.
es: Para más información de cada opción del portal vea el menú de secciones a continuación.

source: Retail are designed to provider DDI routing service to clients with self hosted PBXs..
es: Los clientes retail están diseñados para ofrecer servicio de enrutado de DDIs a clientes con PBXs propias.

source: Some fields described below may not be visible depending on enabled features.
es: Algunos de los campos descritos a continuación podrían ser invisibles en función de las funcionalidades habilitadas en el cliente.

source: Sets the name for this client.
es: Configura el nombre del cliente.

source: Allow configuration of avaialble features for this client. Related sections are hidden consequently and the client cannot use them.
es: Permite elegir las features del cliente. Esto habilitará o deshabilitará las diferentes secciones del menú del cliente.

source: Billing method
es: Método de tarificación

source: When billing feature is enabled determines when calls will be priced. See :ref:`Billing` section.
es: Cuando la tarificación esté habilitada, determina como serán tarificadas las llamadas. Ver sección :ref:`Tarificación`.

source: Geographic Configuration
es: Configuración geográfica

source: General client configuration for language and timezones. Most of the settings in the section can be configured per user if required.
es: Configuración geral del lenguaje y zona horaria. La mayoría de las opciones en esta sección se pueden configurar por usuario si es necesario.

source: Security
es: Seguridad

source: Limits the external concurrent calls and source of calls for this client.
es: Limita el número de llamadas externas concurrentes y origenes de llamadas de este cliente.

source: Invoice data
es: Datos de facturación

source: Data included in invoices created by this brand.
es: Información incluida en las facturas creadas por esta marca.

source: Externally rated options
es: Opciones adicionales tarificación externa

source: For :ref:`Peering contracts` with externally rated enabled, this field can be used to store specific information for this client.
es: Para :ref:`Contratos de peering` con tarificación externa habilitada, este campo puede emplearse para información específica de este cliente.

source: Notifications
es: Notificationes

source: Configure the email :ref:`notification templates` to use for this company.
es: Configurar las :ref:`Plantillas de notificaciones` a emplear en esta compañía.

source: Outgoing DDI
es: DDI saliente

source: Selects a DDI for outgoing calls of this client, if it is no overridden in a lower level.
es: Introducido en 1.3, esta opción permite elegir el DDI saliente para las llamadas de este cliente, si no son especificadas en un nivel inferior.

source: Media relay set
es: Servidores de Media

source: As mentioned above, media-relay can be grouped in sets to reserve capacities or on a geographical purpose. This section lets you assign them to companies.
es: Como se ha mencionado, los servidores de media pueden ser agrupados para reservar capacidades o para una distribución geográfica. Esta sección le permite asignarlos a las compañías.

source: Distribute Method
es: Método de distribución

source: 'Hash based' distributes calls hashing a parameter that is unique per client, 'Round robin' distributes calls equally between AS-es and 'static' is used for debugging purposes.
es: 'Basado en hash' distribuye las llamadas en base a un parámetro único por cliente, 'Round robin' distribuye las llamadas uniformemente entre todos los AS-es y 'estático' se utiliza solo para *testing*.

source: Application Server
es: Servidores de aplicación

source: If 'static' *distribute method* is used, select an application server here.
es: Si se utiliza 'estático', selecciona un AS aquí.

source: Recordings
es: Grabaciones

source: Configures a limit for the size of recordings of this client. A notification is sent to configured address when 80% is reached and older recordings are rotated when configured size is reached.
es: Configure el límite de tamaño de las grabaciones de este cliente. Se enviará una notificación a la dirección configurada cuando se alcance el 80% y se rotarán las grabaciones más antiguas cuando se alcance el límite.

source: Outgoing Call Routing
es: Enrutado saliente

source: Outgoing Routing
es: Rutas salientes

source: Priority
es: Prioridad

source: If a call matches several routes, it will be placed using the outgoing route with lower priority, as long as it is available.
es: Si una llamada concreta encaja con rutas de distinta prioridad, la llamada se sacará por la que menor prioridad tenga siempre y cuando esté disponible.

source: Metric
es: Métrica

source: If a call matches several routes with equal priority, metric will determine the proportion of calls that will use one route or another.
es: Si una llamada concreta encaja con rutas con la misma prioridad, la métrica determina cuántas se sacarán por una ruta y cuántas por otra.

source: This are the key parameters to achieve two interesting features: **load-balancing** and **failover-routes**.
es: Estos dos parámetros son clave para conseguir dos funcionalidades muy interesantes: **load-balancing** y **failover-routes**.

source: Load balancing
es: Balanceo de carga

source: *Load-balancing* lets us distribute calls matching the same pattern using several valid outgoing routes.
es: El balanceo de carga o *load-balancing* nos permite sacar un porcentaje de llamadas por una ruta y otro porcentaje de llamadas por otra ruta, es decir, nos permite repartir las llamadas entre dos o más rutas igualmente válidas.

source: Example 1
es: Ejemplo 1

source: Route A: priority 1, metric 1
es: Ruta A: prioridad 1, métrica 1

source: Route B: priority 1, metric 1
es: Ruta B: prioridad 1, métrica 1

source: Call matching these routes will use route A for %50 of the calls and route B for %50 of the calls.
es: Las llamadas que encajen en ambas rutas se sacaran el 50% por una ruta y el 50% por la otra.

source: Example 2
es: Ejemplo 2

source: Route B: priority 1, metric 2
es: Ruta B: prioridad 1, métrica 2

source: Call matching these routes will use route A for %33 of the calls and route B for %66 of the calls.
es: Las llamadas que encajen en ambas rutas se sacaran el 33% por la Ruta A y el 66%por la Ruta B (el doble por B que por A).

source: Failover routes
es: Conmutación por error

source: Failover route lets us use another route whenever the main route fails.
es: Las rutas en caso de fallo o *failover-routes* nos permite disponer de una ruta adicional en caso de que la ruta preferida falle.

source: Example
es: Ejemplo

source: Route B: priority 2, metric 1
es: Ruta B: prioridad 2, métrica 1

source: All calls matching these routes will try to use route A. In case the call fails, the call will be placed using route B.
es: Las llamadas que encajen en ambas rutas se intentarán sacar siempre por la Ruta A. En caso de no error (operador caído, etc.), se intentará sacar por la Ruta B.
