Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/brand.po
Languages: es

source: Balances
es: Saldos

source: This section displays the balance status for :ref:`Prepaid billing` and :ref:`Pseudo-prepaid billing` clients.
es: Esta sección muestra el estado de saldos para clientes con :ref:`Tarificación prepago` y :ref:`Tarificación pseudo-prepago`

source: Following sections are available for each client:
es: Las siguientes secciones estan disponibles para cada cliente:

source: Balance Movements List
es: Listado de movimientos de saldo

source: Brand administators can keep track the balance movements (increase or decrease) on this account and their status after the movement.
es: Los administadores de marca pueden comprar el registro de movimientos (aumentos y decrementos) de cada cuenta y el estado tras el movmiento.

source: Billable Calls List
es: Listado llamadas facturables

source: List of calls that have decreased the balance, like the one described in the section :ref:`Billable calls`.
es: Listado de llamadas que han decrementado el saldo, como el que se describe en la sección :ref:`Llamadas facturables`.

source: Balance Notifications
es: Notificaciones de saldo

source: Brand administrators can configure email notifications when the balance is below a given threshold. See :ref:`Notification templates` to customize the sent email.
es: Los administradores pueden conifgurar notifiaciones vía correo electrónico cuando el saldo se encuentra por debajo de un límite pre-establecido. Ver :ref:`Plantillas de Notificaciones` para parametrizar los correos enviados.

source: Call billing
es: Tarificación de llamadas

source: Billing a call is the **action of setting a price** to a call that implies cost.
es: Tarificar una llamada es la **acción de poner precio** a una llamada que implica coste.

source: Automatic billing
es: Tarificación automática

source: As exposed previously, billing calls depends upon an automatic process:
es: Tal y como se ha explicado con anterioridad, el proceso de tarificación es automático:

source: When a call is about to be established, IvozProvider verifies that it will be able to bill it.
es: En el momento en el que una llamada se va a establecer, se verifica que se vaya a poder tarificar.

source: If with the current configuration (active and applicable rating plans for a given company and for the specific destination) it won't be possible to bill the call, IvozProvider will prevent its establishment.
es: Si no se va a poder tarificar atendiendo a los planes de precios activos para la empresa, la llamada no se cursará.

source: Once a call that implies cost is hung up, it is listed in :ref:`billable_calls`.
es: En el momento en el que una llamada que implique coste se cuelga, aparece en el listado de :ref:`billable_calls`.

source: Postpaid billing
es: Tarificación postpago

source: Call tarification is done after the call ends
es: La tarificación de llamadas se realiza tras el colgado

source: No configurable limit or balances involved
es: No existe saldo ni límite de gasto configurable

source: Prepaid billing
es: Tarificación prepago

source: Call trarification is done during the call
es: La tarificación de la llamada se hace durante la llamada

source: Clients with prepaid have a preconfigured balance that will be decrement during the call
es: Los clientes con prepago tienen un saldo preconfigurado que ira decrementando durante la llamada

source: When the balance reaches zero, all established calls for the client will hang up
es: Cuando el saldo llega a cero, todas las llamadas establecidas del cliente serán colgadas

source: Clients can not place new calls with zero or below balance
es: Los clientes no pueden realizar nuevas llamadas con saldo cero o inferior.

source: Low balance email notifications can be configured
es: Es posible configurar notifaciones de correo para saldos bajos

source: Pseudo-prepaid billing
es: Tarificación pseudo-prepago

source: Clients with pseudo-prepaid have a preconfigured balance that will be decrement after the call ends
es: Los clientes con pseudo-prepago tienen un saldo preconfigurado que ira decrementando cuando las llamada finalice

source: Billable calls
es: Llamadas facturables

source: **Billable calls** sections only list **calls that imply cost**.
es: Los listados de llamadas de las secciones **Llamadas facturables** muestran solo las **llamadas que implican coste**.

source: :ref:`call_registry` sections, on the other hand, show all calls, even the ones that do not imply cost, such as internal calls, incoming calls, etc.
es: La gran diferencia respecto a las llamadas del :ref:`call_registry` es que todas las que aparecen aquí implican coste (no aparecen, por tanto, llamadas internas, etc.)

source: These lists therefore include the price of each call (once it is calculated). Since companies are notified about its call's price via invoices issued by **brand operator**, this section is only available at two levels:
es: Se muestra el coste asociado a las llamadas (una vez calculado) y, dado que las empresas son notificadas de sus llamadas por medio de facturas emitidas por el *operador de marca*, solo se existe a dos niveles:

source: Main level (god level)
es: A nivel global (*god*).

source: Brand level
es: A nivel de marca.

source: Each entry shows this information:
es: Estos listados muestran la siguiente información:

source: Date
es: Fecha

source: Date and time of the call establishment.
es: Fecha y hora del establecimiento de la llamada.

source: Brand
es: Marca

source: Only visible for *god*, shows the brand of each call.
es: Solo visible a nivel *god*, indica la marca de la empresa en cuestión.

source: Company
es: Compañía

source: Visible for *god* and *brand operator*, show the company of each call.
es: Empresa responsable de la llamada.

source: Destination
es: Destino

source: External number dialed.
es: Número externo al que se ha llamado.

source: Duration
es: Duración

source: Shows how long the call lasted.
es: Indica cuánto ha durado la llamada.

source: Price
es: Precio

source: The cost of the call.
es: Coste calculado para la llamada.

source: Peering contract
es: Contrato de peering

source: Shows which :ref:`Peering contract <peering_contracts>` was used for each call.
es: Indica por qué :ref:`Contrato de peering <peering_contracts>` ha salido la llamada.

source: Invoice
es: Factura

source: Show if a call is already included in any :ref:`Invoices`.
es: Indica si la llamada está incluida en alguna :ref:`Facturas`.

source: As soon as the call is hung up, they appear in this list. In some minutes time the asynchronous process will set *Metered* to 'yes' and will assign a **price**.
es: Las llamadas aparecen en este listado en cuanto se cuelgan. Pasados unos minutos, el proceso que pone precios a las llamadas habrá tarificado la llamada (*Tarificado* igual a 'Sí') y tendremos disponible el **Precio** calculado.

source: Destination Rates
es: Precios destino

source: A Destination rate groups some prefixes with their cost details:
es: Los **precio destino** agrupan los prefijos y sus costes:

source: Cost per minute
es: Precio por minuto

source: Call establishment cost
es: Establecimiento de llamada

source: Bill by seconds, by minutes, etc.
es: Facturación por segundos / minutos /etc.

source: At this point, the future brand operator may have noticed that creating thousands of pricing patterns would be a really annoying and time consuming task, as there are 254 countries, each of them with their mobile networks, landline networks, special service numbers, etc.
es: En ese momento, es posible que el futuro administrador de marca se haya dado cuenta de la titánica tarea que implicaría crear miles de patrones de precio (254 países por las distintas redes móviles, fijos, numeraciones especiales, etc.) para luego poder agruparlos en un plan de precios.

source: That's why the creation of destination reate is done using a `CSV <https://es.wikipedia.org/wiki/CSV>`_ file. If you still want to create data manually, check section :ref:`Creating a destination rate`
es: Esto es debiado a que la creaciónd e los precios destinos se realiza generalmente a través de un fichero `CSV <https://es.wikipedia.org/wiki/CSV>`_. Si quiere crear los datos de manera manual, vea la sección :ref:`Crear un precio destino`

source: Importing a CSV file
es: Importación vía CSV

source: The first step is creating an empty rating plan to import the prices in (section **Brand configuration** > **Destination rates**):
es: El primer paso es crear un plan de precios vacío sobre el que importar nuestros precios (sección **Configuración de marca** > **Planes de precio**):

source: This is the key button for the massive pricing pattern import process:
es: El botón clave para este proceso de importación masiva es el siguiente:

source: We can select which column contains which field, in case we want to import a `CSV <https://es.wikipedia.org/wiki/CSV>`_ file in a non-recommended format. We can also decide whether to import the first line or discard it as it may have titles instead of data.
es: En esta ventana podríamos seleccionar qué contiene cada columna, en caso de no haber creado el `CSV <https://es.wikipedia.org/wiki/CSV>`_ en el formato recomendado. Del mismo modo, se nos ofrece la posibilidad de ignorar la primera línea, en caso de que incluya los nombres de las columnas en lugar de datos.

source: The importing process is done in background, letting the brand operator continue doing other stuff while it is finished.
es: El proceso de importación se realiza en segundo plano, permitiendo al administrador de marca seguir configurando otros aspectos de la plataforma mientras se completa.

source: CSV format
es: Formato CSV

source: Although the above window allows importing non-recommended format CSV files, we encourage you to import a file in the proposed format, as it will make this process much easier.
es: A pesar de que la ventana anterior nos permite importar archivos CSV en distintos formatos, lo mejor es importar un archivo en el formato adecuado para simplicar este proceso.

source: You can find a sample CSV for importing `here <https://raw.githubusercontent.com/ irontec/ivozprovider/artemis/web/admin/samples/pricesSample.csv>`_.
es: Puedes encontrar un CSV de ejemplo para la importación `aqui <https://raw.githubusercontent.com/ irontec/ivozprovider/artemis/web/admin/samples/pricesSample.csv>`_.

source: The order of the columns should be:
es: El orden de las columnas debería de ser:

source: Destination name
es: Nombre del destino

source: Destination prefix (E.164 with + sign)
es: Prefijo destino (E.164 con signo +)

source: Per minute charge
es: Precio por minuto

source: Establishment cost
es: Precio de establecimiento

source: Billing period in seconds
es: Período de facturación en segundos

source: It is recommended to double quote alphanumeric entries, though it is not compulsory for single word entries (or entries without odd symbols). **If they contain any comma, they MUST be quoted**.
es: Se recomienda entrecomillar con comillas dobles las entradas alfanuméricas, aunque no es necesario para entradas con una única palabra (o entradas sin símbolos raros). **Si contienen coma, es OBLIGATORIO entrecomillarlos**.

source: Floating numbers **MUST use point as decimal separator**.
es: Los **números decimales** tienen que usar el **punto como separador decimal**.

source: Numeric entries can be quoted with double quotes, but it is not mandatory.
es: Las entradas numéricas se pueden entrecomillar con comillas dobles, pero no es obligatorio.

source: The price of the call will be increased every billing period unit.
es: El precio de la llamada sera incrementado cada periodo de facturacion.

source: If *billing period* is set to 1, every second the price will be increased *price per minute* divided by 60 (bill by seconds).
es: Si se pone a 1, implica una tarificación por segundos y cada segundo implicará un coste que será el *precio por minuto* dividido entre 60.

source: If *billing period* is set to 60, every minute the price will be increased *price per minute* (bill by minutes).
es: Si se pone a 60, implica una tarificación por minutos y cada minuto implicará un coste que será el *precio por minuto*.

source: You can download the imported file of the destination rate. Take into account that while importing over existing data, the mathching values are overwritten and the not matching are kept. This allows downloading the imported file, changing some values and importing pricing back.
es: Puedes descargar el fichero importad del precio destino. Ten en cuenta que cuando importe ficheros sobre datos existentes, los valores que coincidan serán sobreescritos y los no coincidentes serán mantenidos. Esto permite descargar el fichero importado, cambiar algunos valores y volverlo a importar.

source: Once the import process is over, we only have to include this destination rate into some rating plan and bind it to the companies we want following the procedure explained in :ref:`Rating plans`.
es: Una vez completada la importación, solo faltaría asociar el nuevo plan de precios a las empresas que queramos, siguiendo el procedimiento explicado en :ref:`Planes de precio`.

source: Billing
es: Tarificación

source: This block is essential for brand administrators as we will explain how to:
es: En este bloque se tratará un tema de primordial importancia para los administradores de marca:

source: Create pricing plans to assign a price to calls made by final users.
es: Crear planes de precio para poner precio a las llamadas de los usuarios.

source: Create invoices that show call details and global costs of each of their companies.
es: Crear facturas que recojan el detalle y el consumo de sus empresas.

source: We will cover this topics:
es: Pare ello, abordaremos las siguientes cuestiones:

source: Rating plans
es: Planes de precio

source: Creating a rating plan
es: Creando un plan de precios

source: Create a **rating plan**:
es: Crear un **plan de precios**:

source: And then we can add our destination rate:
es: Y ahora podemos añadir nuestro precio destino:

source: The **metric** of the link lets you assign more than one *destination rate* for a plan, even though some destinations are included in more than one of those destination rates.
es: La **metrica** permite assignar más de un *precio destino* al plan de precios, aunque exista el mismo destino en más de uno de ellos.

source: If a given call can be billed with more than one destination rate, it will be billed using the one with lowest metric.
es: Si una llamada puede ser tarificada empleando más de un Precio destino, se empleará el que tenga menor métrica.

source: This allows having a general *Destination rate* and concrete the price of a specific destination in another *destination rate* with lower metric (free cell phone calls, for example).
es: Esto permite tener un *Precio destino* genera y especificar un precio para un destino concreto en otro *precio destino* con una métrica menor (por ejemplo, llamadas gratuitas a móviles).

source: Checking Rating plans
es: Comprobando los planes de precio

source: To check the configuration so far we can **Simulate a call** from the rating plans list.
es: Para comprobar la configuración puede **Simular una llamada** desde el listado de planes de precio.

source: Assigning a rating plan to a company
es: Asignar planes de precio a la compañía

source: A specific **rating plan** can be linked to multiple companies.
es: Un *plan de precios* puede estar vinculado a multiples compañías.

source: In the section **Brand configuration** > **Virtual PBXs** we select the *demo* company:
es: La sección **Configuración de Marca > PBXs Virtuales** seleccionaremos la compañía *DemoCompany*:

source: The **Rating plan** have an activation time, and only one can be active for each company.
es: El **plan de precios** tiene una fecha de activación y solo uno puede estar activo para cada compañía.

source: Simulating a call of a specific company
es: Simular una llamada para una compañía

source: In this list we can also simulate a call for a given company like we did previously in the rating plan list and check the price it will imply. This way, we can be sure that the configuration is ok.
es: In este listado también es posible simular una llamada para una compañía, tal y como hicimos anteriormente en el listado de planes de precio y comprobar el precio que tendrá. De esta manera, podemos confirmar que le configuración es correcta.

source: Brand Configuration
es: Configuración de Marca

source: Fixed costs
es: Costes fijos

source: Fixed cost are a constant concept that can be added to invoices that use invoice templates that take into account these fixed costs.
es: Los costes fijos son un concepto fijo que se pueden añadir a las facturas que utilicen plantillas que tengan en cuenta costes fijos.

source: Take this image as an example (section **Fixed costs**):
es: Sirva la siguiente imagen de ejemplo (sección **Costes Fijos**):

source: We will explain afterwords how these fixed costs can be added to a invoice and in what amount.
es: A la hora de generar una factura, como se verá más adelante, se podrá indicar cuáles de estos conceptos se incluyen en la factura (y en qué cantidades).

source: Invoicing
es: Facturación

source: The final goal of this section is to generate invoices with the call that imply cost of a given company.
es: El objetivo final de todo el proceso de facturación es generar facturas que incluyan las llamadas con coste de una empresa concreta.

source: Invoices
es: Facturas

source: **Invoices** section lets **brand operator** to generate invoices to issue to its clients.
es: La sección **Facturas** es la que permite al **operador de marca** generar facturas para emitir a sus empresas.

source: This is the process to add a create a new invoice:
es: Añadimos una factura nueva para explicar el proceso:

source: Number
es: Número

source: Will be included in the invoice and shows the invoice number
es: Será incluído en la factura y representa el número de factura

source: The company whose calls will be invoiced
es: Empresa para la cual estamos generando la factura

source: Start/End date
es: Fecha inicio/fin

source: The time period of the calls that will be invoiced
es: Tramo temporal cuyas llamadas queremos tener en cuenta

source: Taxes
es: Impuesto

source: Taxes to add to the final cost (e.g. VAT)
es: Impuesto a añadir al coste total calculado

source: Template
es: Plantilla

source: Invoice template that will be used
es: Plantilla que queremos utilizar para generar esta factura

source: Let's add some fixed costs to this invoice:
es: Añadamos ahora unos costes fijos a esta factura concreta pulsando:

source: Select previously defined fixed costs and their amounts:
es: Y añadamos los costes fijos que queramos, así como sus cantidades:

source: At this point, we can generate the invoice pressing this button:
es: En este punto, podemos generar la factura pulsando:

source: Pressing this button we can see which calls have been included in the invoice:
es: Pulsando el siguiente botón podemos ver las llamadas que han sido incluidas en la factura:

source: And pressing this one we can download the invoice in PDF format:
es: Y pulsando este botón podemos descargar la factura en formato PDF:

source: End date must be a past date. In other words, it is not allowed to generate invoices for future dates o dates including today.
es: La fecha fin tiene que ser una fecha ya pasada. Es decir, no se puede sacar facturas de tramos futuros o del día actual.

source: All the calls of the selected period must be billed.
es: Todas las llamadas del tramo escogido tienen que estar facturadas para poder emitir la factura.

source: Invoice templates
es: Plantillas de facturas

source: Before generating an example invoice, it is important to understand that invoice creation process uses templates.
es: Antes de generar una factura de ejemplo, es importante entender que las facturas generadas utilizan unas plantillas que permiten su modificación.

source: This way, every **brand operator** can adapt which information is shown and how this information is shown, add logos, graphs, etc..
es: De este modo, cada *operador de marca* puede crear plantillas con los datos deseados, la estética deseada, añadir logos y hasta gráficas de consumo.

source: Templates are parsed by `handlebars <https://github.com/XaminProject/handlebars.php>`_ and rendered using `wkhtmltopdf <https://wkhtmltopdf.org/>`_ library.
es: Las plantillas son interpretadas con `handlebars <https://github.com/XaminProject/handlebars.php>`_ y renderizadas con la librería `wkhtmltopdf <https://wkhtmltopdf.org/>`_.

source: The helper in the section **Brand configuration** > **Invoice templates** include a summarized explanation of the creation of templates. In the `official site of wkhtmltopdf <https://wkhtmltopdf.org/usage/wkhtmltopdf.txt>`_ there is plenty additional information. You can delve into template expressions `here <http://handlebarsjs.com/expressions.html>`_ as well.
es: La ayuda contextual de la sección **Configuración de Marca** > **Plantillas de facturas** incluye una explicación resumida del proceso de creación de plantillas. En la `página oficial de wkhtmltopdf <https://wkhtmltopdf.org/usage/wkhtmltopdf.txt>`_ puede encontrar más información. También puede profundicar en las expresiones disponibles en las plantillas `aquí <http://handlebarsjs.com/expressions.html>`_.

source: By default, this section provides some basic example templates:
es: Por defecto, IvozProvider incluye las siguientes plantillas de ejemplo (en la ayuda contextual se pueden encontrar enlaces a las mismas):

source: Generic Match Lists
es: Listas coincidencia genéricas

source: :ref:`Match Lists` are designed to group well known numbers or patterns in order to use them in specific treatments.
es: Las :ref:`Listas de coincidencia` estan diseñadas para agrupar números conocidos o patrones numéricos para asociarlos a distintos tratamientos.

source: Brand administrators can create generic Match lists to share between all its companies. This can be specially handy for blacklisting numbers or configure global :ref:`Call ACL Matchlits`.
es: Los administradores de marca pueden crear listas de coincidencia genéricas para compartir por todas sus compañías. Esto puede resultar especialmente útil para números de listas negras o configuraciones globales de :ref:`Listas de coincidencia para ACLs`.

source: Generic Music on Hold
es: Músicas en espera genéricas

source: :ref:`Music on Hold` will be played when the user holds the call and the other member waits until the call is resumed.
es: La :ref:`Música en espera` suena cuando un usuario retiene la llamada y su interlocutor queda a la espera de seguir la conversación.

source: If a company has defined a music on hold, it will be played. Otherwise, the one defined by the brand administrator in this section. If none of this is configured, a global music will be played.
es: Si una empresa define su música en espera, sonará. Si, por el contrario, no define ninguna, sonará la que haya definido el operador de su marca.

source: Multiple files can be added to be played as Music on Hold. The system will choose them randomly for each call.
es: Se pueden definir más de una música en espera y el sistema elegirá de forma aleatoria la música en espera para cada llamada.

source: Notification Templates
es: Plantillas de Notificaciones

source: Brand administators can configure the notifications sent by IvozProvider:
es: Los administradores de marca pueden configurar las notificaciones enviadas por IvozProvider:

source: Email sent when a new voicemail is received
es: Correos electrónicos enviados cuando se recibe un buzón de voz nuevo.
