Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/brand.po
Languages: es

source: Although given examples use two routes, more routes can be chained and failover and load-balancing estrategies can be combined.
es: Tanto el balanceo de carga como las rutas de fallo permiten encadenar/utilizar más de 2 rutas, aunque en los ejemplo se hayan utilizado solo 2.

source: In most scenarios, Brands administrators are responsible of configuring :ref:`Peering Contracts` and :ref:`Outgoing Routing` to provide connectivity for their clients. But in some cases, clients want to choose the outgoing routing to use per call.
es: En la mayoría de escenarios, los administradores de marca son responsables de configurar los :ref:`Contratos de peering` y :ref:`Rutas salientes` para ofrecer conectividad a sus clientes. En algunos casos, los clientes quieren poder elegir la ruta saliente que se empleará en cada una de las llamdas.

source: A Routing tag is an code that will prefix the destination number when placing calls to Ivoz Provider.
es: Un Routing tag es un código que se emplea como prefijo al número destino cuando se realizan llamadas a Ivoz Provider.

source: In order to use a routing tag, the client must have it enabled in their edit screen. Using a non enabled routing tag will case the call to be declined.
es: Para poder emplear los routing tags, el cliente debe tenerlos habilitados en su pantalla de edición. Emplear un tag no habilitado hará que las llamadas sean directamente rechazadas.

source: Route tags are only available to wholesale clients at the moment.
es: En la versión actual, los routing tags solo estan disponibles para clientes wholesale.

source: Then, each routing tag can be used to configure their :ref:`Outgoing routing` order.
es: Cada Routing tag puede ser empleado al configurar sus :ref:`Rutas salientes`.

source: Target pattern groups
es: Grupos de patrones

source: As we will see in :ref:`Outgoing Call Routing` section, every target pattern will be linked to a Peering Contract.
es: Como veremos en la sección de :ref:`Enrutado saliente`, cada patrón de destino se vinculará a un Contrato de Peering concreto.

source: That's why it can be useful to group the target patterns in **target pattern group** so that we can link a whole group to a Peering Contract more easily.
es: Por este motivo, puede ser interesante agrupar los patrones en grupos y así poder vincular un grupo entero a un Contrato de Peering.

source: By default we can see the countries grouped in the continents defined in `ISO 3166 <https://en.wikipedia.org/wiki/ISO_3166>`_:
es: Por defecto aparecen los países agrupados en base a su continente definidos en la `ISO 3166 <https://es.wikipedia.org/wiki/ISO_3166>`_:

source: **To sum up**, when a user dials an external number, IvozProvider looks up a matching target pattern to decide which PeeringContract must be used to place this call.
es: **En resumen**, cuando un usuario marca un número externo, IvozProvider busca el patrón de destino al que pertenece para saber por dónde tiene que sacar dicha llamada.

source: Target patterns
es: Patrones de destino

source: When a user dials an external phone number, IvozProvider tries to categorize this call into a one of the target patterns defined in this section:
es: Cuando un usuario marca un número externo, IvozProvider intenta calificar estenúmero en uno de los patrones de destino definidos en esta sección:

source: Usually, it will we useful to have one target pattern for the countries defined in the `ISO 3166 <https://en.wikipedia.org/wiki/ISO_3166>`_. That's why IvozProvider automatically includes all this countries and their prefixes:
es: Lo más normal será que nos interese tener un patrón de destino por cada uno de los países definidos en la `ISO 3166 <https://es.wikipedia.org/wiki/ISO_3166>`_. Por ese motivo, IvozProvider incluye estos países y sus prefijos de forma automática:

source: Brand operator can choose between keeping this target pattern if finds them useful or deleting them an creating the ones that meet his needs.
es: Cada operador de marca puede elegir mantener estos patrones o borrarlos y crear los que le interesen.

source: Brand Services
es: Servicios de marca

source: The section **Brand configuration** > **Services** allows the brand operator to:
es: La sección **Configuración de Marca > Servicios** permite al operador de marca:

source: Change the default service code for all the brand companies (assuming the company hasn't already customized the code)
es: Redefinir el código de acceso por defecto a dichos servicios para las empresas que a su vez no lo redefinan.

source: Delete services so it won't be available for the companies.
es: Borrar servicios que no quieran que puedan utilizar sus empresas.

source: By default this list has all the services and codes from the global configuration:
es: Por defecto este listado aparece con todas los servicios y los códigos configurados a nivel Global:

source: This section lists the available services and the default codes when a **new company** is created.
es: Este listado determina los servicios disponibles y los códigos por defecto de las **nuevas empresas**.

source: Changing the default code in this section will only affect new created companies.
es: Cambiar un código solo afecta a las empresas que se creen tras el cambio. Borrar un servicio hace que no esté disponible para ninguna empresa de la marca.

source: Numeric transformations
es: Transformaciones numéricas

source: **IvozProvider** is designed to provide service **anywhere in the planet**, not only the original country where the platform is installed.
es: **IvozProvider** está diseñado con la intención de **poder dar servicio en cualquier lugar del planeta**, no solamente en el país originario de la solución.

source: A very important contept to archive this goal is the numeric transformation, that **adapts the different number format systems of the countries of the world** defined in `E.164 <https://www.itu.int/rec/T-REC-E.164/es>`_ **to a neutral format**.
es: Un concepto muy importante para conseguir este objetivo es el de las transformaciones númericas, que consisten en la **adaptación de los distintos sistemas de numeración de los países del mundo** definidos en `E.164 <https://www.itu.int/rec/T-REC-E.164/es>`_ **a un formato neutro**.

source: There are two different transformation scenarios:
es: En concreto, se distinguen 2 casos:

source: Incoming transformations
es: Adaptación en entrada

source: When a new call is received in IvozProvider matching a provider that has been configured for *peering*, we must adapt the numbers that make reference to:
es: Cuando una llamada entra a IvozProvider procedente de un operador con el que tenemos un acuerdo de *peering*, hay que adaptar las numeraciones que hacen referencia a:

source: Origin of the call
es: Origen de la llamada.

source: Destination of the call
es: Destino de la llamada.

source: Depending on the country of the provider, the international numbers will have a format or another. In this case, the spanish provider will use, for example:
es: En función del país del operador indicará los números internacionales de una forma distinta. En el caso de un operador español, por ejemplo:

source: 00 + 33 + number belonging to France
es: Utilizará 00 + 33 + número para una llamada con origen francés.

source: It's possible that the international numbers came without the 00 code.
es: Puede que muestre las numeraciones internacionales sin el 00.

source: It's possible that, if the call comes from the same country that the provider, the number comes without the calling code (911234567 insted of 00 + 34 + 911234567 for Spain).
es: Es probable que si la llamada procede del mismo país del operador, no se muestre el prefijo del país (911234567 en lugar de 00 + 34 + 911234567)

source: For an Ukranian provider, that doesn't use the 00 as international code:
es: En el caso de un operador de Ucrania, que no utiliza 00 como código internacional:

source: It will use 810 + 33 + number belonging to France.
es: Utilizará 810 + 33 + número francés para el mismo número.

source: It's possible that even part of the internation code (00 in most of the countries of the world) the provider use specific codes as prefix.
es: Puede incluso que aparte del código internacional (00 en la mayoría de países del mundo) un operador concreto anteceda sus números con un prefijo concreto.

source: The goal of the incoming transformation is that, no matter what numeric system the provider uses, the number will end in a general and common format.
es: El objetivo de la adaptación de entrada es que, independientemente de la notación utilizada por el operador, la llamada se acabe en un formato homogéneo y común.

source: This common format is usually called E.164 and shows the numbers without internation code, but with country calling code: i.e. +34911234567
es: Este formato común se suele llamar E.164 y muestra los números sin el código internacional y con el prefijo de país: e.g. +34911234567

source: Outgoing transformations
es: Adaptación en salida

source: In the same whay the origin and destination must adaptat incoming numbers, it will be required to adapt outgoing dialed numbers to properly work with each of the providers that will route our call.
es: Del mismo modo que el origen y el destino se tiene que adaptar en entrada, habrá que adaptar también las numeraciones en salida en función del operador por el que se vaya a sacar la llamada.

source: For example, for a number with spanish number system:
es: Por ejemplo, para una llamada a un número español:

source: *Spanish provider*: Destination will come in E164 (+34911234567) and for this provider, we can remove the calling code (will understand it belongs to its country), so the number sent to them will be 911234567.
es: *Operador español*: El destino vendrá en E164 (+34911234567) y habrá que quitar el prefijo de país: 911234567.

source: *French provider*: The destination will come in E164 (+34911234567) and we must add the international code for France, so the number sent to them will be 0034911234567.
es: *Operador francés*: El destino vendrá en E164 (+34911234567) y habrá que añadir el código internacional: 0034911234567.

source: To sum up, we aim to send the origin and destination in the format the provider is expecting.
es: En resumen, consiste en entregar origen y destino en el formato en el que el operador elegido los espera, para que la llamada progrese con normalidad.

source: Numeric transformation uses `simple regular expresions <https://es.wikipedia.org/wiki/Expresi%C3%B3n_regular>`_ to describe the changes done to the numbers. You can find multiple tutorials on net with the basic regular expression format.
es: Las transformaciones numéricas utilizan `expresiones regulares <https://es.wikipedia.org/wiki/Expresi%C3%B3n_regular>`_ muy simples para describir los cambios a realizar en las numeraciones. En Internet se pueden encontrar múltiples tutoriales sobre el uso básico de expresiones regulares.

source: 'National provider' transformations
es: Transformación 'Operador Nacional'

source: IvozProvider comes with an automatic transformation rules generator that fits with most of the countries.
es: IvozProvider permite crear automáticamente las reglas de transformación típicas de la mayoría de países.

source: In order to create a new set of transformations for spanish provider:
es: Para crear el set de reglas necesarias para los operadores españoles, basta con:

source: The rules that has been auto-created will transform the numbers for spanish providers that follow this rules:
es: Las reglas que se han autocreado realizan las modificaciones adecuadas para operadores nacionales que muestren las numeraciones siguiendo estas reglas:

source: A spanish number: Neither international nor calling code (34).
es: Número español: se muestra sin código internacional y sin el 34.

source: Not a spanish number: International code (00) and calling code (34).
es: Número internacional: se precede de 00 y del código del país.

source: The numeric transformation *sets* must be assigned to **Peering Contracts**, as shown in the following section. This *set* can be shared by multiple spanish providers.
es: Los *sets* de transformaciones numéricas se asignan a **PeeringContracts**, tal y como veremos en la siguiente sección. Este *set* será el adecuado para la mayoría de operadores españoles.

source: Let's check this *set* to understand what transformation rule does:
es: Analicemos el *set* para entender lo que hace cada regla de transformación:

source: The automatic rule generation will create 8 common rules based on the given parameters. This rules can be edited later to match the provider requirements.
es: La creación automática genera las 8 reglas habituales en función de los parámetros especificados. Estas reglas se pueden editar después, el proceso de automatización termina una vez creado el set.

source: Spanish incoming transformation
es: Adaptación en entrada España

source: Displayed in blue in the previous image:
es: Aparece en azul en la imagen anterior:

source: Left called/destination
es: Izquierda llamado/destino

source: Right callee/origin
es: Derecha llamante/origen

source: The same rules will be applied for the origin and destination:
es: Tanto para el origen como para el destino las reglas que se aplican son las mismas:

source: The **metric** field will be used to order the rules (smaller first).
es: Las reglas se evalúan antes o después en función del campo **métrica** (de menor a mayor).

source: If a rule doesnt *match*, the next rule is evaluated.
es: Si una regla no *matchea*, se evalúa la siguiente regla.

source: If a rule *matches*, no more rules are evaluated.
es: Si una regla *matchea*, no se evalúan más reglas.

source: If no rule *matches*, no change is applied.
es: Si ninguna regla *matchea*, no se aplica ningún cambio.

source: The **Search** field is evaluated agains the number (depending of the tranformation type it will be destination or origin).
es: El campo **Buscar** se evalúa contra el campo en cuestión (en el caso de la captura, contra el campo Llamado/Destino de una llamada saliente).

source: The **Replace** field will use the capture groups that matched the Search field (displayed between brackets, \1 for the first one, \2 for the second one, and so on) to determine how the number will end.
es: El campo **Reemplazar** recoge las capturas del campo buscar (expresadas entre paréntesis, \1 para la primera, \2 para la segunda, etc.) y expresa cómo tiene que quedar el número:

source: Spanish outgoing transformation
es: Adaptación en salida España

source: Following the same logic, this 2 rules make the change of the outgoig external destination numbers.
es: Siguiendo la misma lógica, estas 2 reglas realizan los siguientes cambios sobre el destino en llamadas salientes:

source: **To sum up**: numeric tranformation can adapt origin and destination numbers to E.164 for the platform, and to providers expected formats, based on regular expresions and metric that can be grouped in *sets* to be shared between multiple **Peering Contracts**.
es: **En resumen**: las transformaciones numéricas adaptan orígenes y destinos, a E.164 en entrada y a los formatos que los operadores esperan en salida, utilizando reglas con expresiones regulares y métricas agrupadas en *sets* que se asocian a **PeeringContracts**.

source: Virtual PBX
es: PBX Virtual

source: SIP domain
es: Dominio SIP

source: DNS for this client. See :ref:`Company SIP Domain` section.
es: DNS del cliente. Ver sección :ref:`Dominio SIP de la compañía`

source: Most of the features are self-explanatory, but **voice notification** deserves an explanation: if you enable them, when a call fails, the user will listen a locution explaining what occurred ("you have no permissions to place this call", "the call cannot be billed", etc.)
es: La mayoría de las features son auto-explicativas, pero las **notificaciones de voz** merecen una explicación: si se habilitan, cuando una llamada falla, el usuario escuchará una locución explicando lo ocurrido ("no tiene permisos para realizar esta llamada", "la llamada no puede ser tarificada", etc.)

source: Recordings rotation happens at two levels: brand and client. This means that **a client's recordings can be rotated even though its limit has not arrived (or even it has no limit) if brand's limit applies first**.
es: La rotación de grabaciones ocurre en dos niveles: marca y compañía. Esto significa que **las grabaciones de una compañía puede llegar a ser rotadas incluso si esta no ha alcanzado su límite (o incluso si no tiene límite) si se ha alcanzado el límite de espacio de su marca**.

source: Again: recordings rotation happens at two levels: brand and client. This means that **a client's recordings can be rotated even though its limit has not arrived (or even it has no limit) if brand's limit applies first**.
es: De nuevo: La rotación de grabaciones ocurre en dos niveles: marca y cliente. Esto significa que **las grabaciones de una compañía puede llegar a ser rotadas incluso si esta no ha alcanzado su límite (o incluso si no tiene límite) si se ha alcanzado el límite de espacio de su marca**.

source: To avoid this, make sure that the sum of all companies does not exceed the size assigned to your brand and make sure that all companies has a size configured (if 0, it has unlimited size).
es: Para evitar esto, asegurese que la suma de los límites de las companías no exceda el tamaño asignado a la marca y que todas las compañías tienen un límite de espacio configurado (si es 0, tendrán ilimitado).

source: Both **Distribute method** and **Application Server** are only visible for God Administrator.
es: Tanto **Método de distibución** como **Servidor de aplicación** solo son visibles para el operador global (*god*).

source: 'Round-robin' distribute method is reserved for huge companies whose calls cannot be handled in a single AS. **Use 'Hash based' for remaining ones**, as 'Round-robin' imposes some limitations to client features (no queues, no conferences).
es: El método de distribución 'Round-robin' está reservado para compañías enormes cuyas llamadas no *entren* en un AS. **Utilizar 'Basado en hash' para el resto**, ya que 'Round-robin' impone una serie de limitaciones en las funcionalidades de la compañía (sin colas, sin conferencias).

source: Wholesale allows trunking services with Carriers without any application server features, focusing on concurrency and quality rather on having lots of services.
es: Wholesale permite ofrecer un servicio de conexión con Proveedores para clientes sin requisitos de funcionalidades de Servidores de aplicación, centrándose en concurrencia y calidad e ignorando el resto de funcionalidades.

source: Just make outgoing calls.
es: Solo realiza llamadas salientes.

source: IP authentication only (no register, no SIP auth).
es: Solo autenticación IP (sin registro, sin autenticación SIP).

source: Calls go directly from users to trunks, without any application server involved.
es: Las llamadas van directamente del proxy de usuarios al de salida sin la participación de ningun servidor de aplicación.

source: Support for routing tags (client can choose the outgoing route to use)
es: Soportan Routing tags (el cliente puede elegir la ruta de salida a emplear)

source: Limits the external concurrent calls.
es: Limitar el número de llamadas externas concurrentes.

source: Select the :ref:`routing tags` this wholesale will be able to use.
es: Seleccionar los :ref:`routing tags` que el cliente wholesale podrá emplear.

source: Audio transcoding
es: Transcodificación de audio

source: Select the codec capabilities to add to calls.
es: Permite seleccionar los codecs que se añadirán a las llamadas.
