Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/company.po
Languages: es

source: Those groups can be configured from the sections :ref:`huntgroups` and :ref:`capture_groups` or the user's screen if the groups already exists.
es: Aparte de poder configurar dicha pertenencia desde las propias secciones :ref:`huntgroups` y :ref:`capture_groups`, se puede añadir al usuario que estamos editando a los grupos de captura y grupos de salto deseados que ya existan.

source: You can also configure the user's **hunt groups** from the icon in each user line of the users list.
es: En el caso de la pertenencia a **grupos de salto**, también se puede configurar desde el listado general:

source: User Call Forward
es: Desvíos de llamada

source: The user's call forward can be configured in the following button:
es: Los desvíos de las llamadas de un usuario concreto se configura pulsando el siguiente botón:

source: For example, to forward all external calls that are not answered after 15 seconds, we could configure a call forward like this:
es: Para desviar las llamadas externas que no se contesten en 15 segundos al buzón de voz que acabamos de configurar, por ejemplo, habría que configurar un desvío tal que:

source: These are the fields and available values:
es: Estos son los campos y los posibles valores:

source: Call Type
es: Tipo de llamada

source: Determines if the forward must be applied to external, internal or any type of call.
es: Limita el desvío a cierto tipo de llamadas, a elegir entre externa, interna o ambas

source: Forward type
es: Tipo de desvío

source: When this forward must be applied:
es: Indica cuándo aplica el desvío:

source: Inconditional: always
es: Incondicional: siempre

source: No answer: when the call is not answered in X seconds
es: Perdida: cuando no se conteste al de X segundos

source: Busy: When the user is talking to someone (and call waiting is disabled), when *Do not disturb* is enabled or when the user rejects an incoming call.
es: Ocupado: cuando el usuario esté ocupado (hablando o con el *No molestar* activo)

source: Not registered: when the user SIP terminal is not registered against IvozProvider.
es: No registrado: cuando el usuario tenga su terminal sin conectar con IvozProvider

source: Target type
es: Tipo de destino

source: What route will use the forwarded call.
es: Indica a dónde se enviará la llamada cuando el desvío aplique:

source: VoiceMail
es: Buzón de voz

source: Number (external)
es: Número (externo)

source: Extension (internal)
es: Extensión (interna)

source: If we want to forward to other process, we can create an extension routed to that object and use the target type *Extension*.
es: Si queremos desviar a un grupo de salto, por ejemplo, bastaría con crear una extensión que apunte al grupo de salto deseado y seleccionar *Extensión* en el **Tipo de destino**.
