Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/company.po
Languages: es

source: Easy queue behaviour was included in IvozProvider in 1.3 version. It is a simple approach with **the unique goal to provide the capability to handle more calls than users attending them**.
es: El comportamiento básico de colas está incluido en la version 1.3 de IvozProvider. Es una aproximación simple con **el único propósito de proveer un mencanismo para procesar más llamadas que usuarios puedan atenderlas**.

source: Queues and callcenter are close terms but different. **IvozProvider is not a suitable product for callcenters**, as it does not provide advanced features that are crucial to them (reports, RT visualization, queue related stat, etc.).
es: Colas y Callcenter son términos cercanos pero diferentes. **IvozProvider no es un producto adecuado para callcenters**, y no proporciona las funcionalidades avanzadas cruciales para ellos (como Reportes, visualización realtime, estadísticas de colas, etc..).

source: **In distributed installations** using Queues is only compatible with an static assignment or 'hash based' distribution (see **Distribute method** :ref:`here <Virtual PBX>`).
es: En **Instalaciones distribuidas** el uso de colas solo es compatible con una asignación estática o 'basada en hash' (ver **Método de distribución** :ref:`aquí <PBX virtual>`).

source: Brand operators can choose which Companies have queues (see **Features** in :ref:`Brand Configuration` and :ref:`Company Configuration`).
es: Los operadores de marca pueden elegir que Compañía tiene colas (ver **Features** en :ref:`Configuración de Marca` y :ref:`Configuración de Compañía`).

source: Queue configuration
es: Configuración de cola

source: This are the settings related to a queue:
es: Estas son las configuraciones relacionadas con una cola:

source: Use to reference this queue
es: Empleado para referenciar esta cola

source: Weight
es: Peso

source: Priorizes calls to an agent that attends calls in two (or more) calls. The higher, the more priorized.
es: Cuando un miembro está en varias colas, se atenderán primero las llamadas de las colas con mayor peso.

source: Strategy
es: Estrategia

source: How will the queue deliver the calls? Calling to all agents, calling to a random one?
es: ¿Como se enviarán las llamadadas encoladas? Llamando a todos los miembros, llamando a uno al azar, etc.

source: Member call seconds
es: Duración llamada a miembro

source: Defines how long will a call to an agent last.
es: Tiempo en segundos que se llamará a cada miembro de la cola

source: Member rest seconds
es: Descanso miembro

source: Seconds between calls for an agent.
es: Tiempo en segundos que el miembro no será molestado tras atender una llamada de cola.

source: Announce
es: Anuncio

source: Select a locution and its frequency. Caller waiting in the call will listen to this locution.
es: Seleccione la locución y frecuencia. Las llamadas esperando en la cola escucharán esta locución.

source: Timeout configuration
es: Configuración no contesta

source: Limits the time that a call can wait in a queue and the following behaviour.
es: Limita el tiempo que una llamada esperará en la cola y el tratamiento a realizar cuando se supere ese tiempo.

source: Full Queue configuration
es: Configuración cola llena

source: Limits the amount of people waiting in a call and the behaviour when this limit it reached.
es: Limita el número de llamadas que podrán esperar en la cola y el comportamiento a realizar cuando se alcance esa cantidad.

source: Apart from creating a queue, you have to assign users to it. This users will have a **penalty: a user will not be selected to deliver a call if any user with lower penalty is available**.
es: Además de crear una cola, es preciso asignarle usuarios. Estos usuarios tendrán una **prioridad: Un usuario de prioridad alta no será no será molestado siempre que exista un usuario de menor prioridad disponible.**

source: A call can be sent to a queue selecting it in the "Route type" selectors available in multiple sections of IvozProvider (extension to queue, DDI to queue, etc.)
es: Una llamada puede ser enviada a una cola eligiendo la opción cola del selector "Enrutar" disponible en varias seciones de IvozProvider (extension a cola, DDI a cola, ...)

source: Queue strategy
es: Estrategia de cola

source: The queue strategy **always applies to current penalty members** starting with the smallest penalty value and only going to the next penalty if all members of current one are busy or unavailable.
es: La estrategia de cola **siempre aplica a los miembros de la prioridad actual** comenzando con la menor de las prioridades y saltando a la siguiente prioridad solo cuando todos los miembros de la actual estén ocupados o no disponibles.

source: The call will make all the members of the current priority during a predefined time.
es: La llamada hará sonar todos los miembros de la prioridad actual al mismo tiempo durante un tiempo predefinido.

source: Least recent
es: Menos reciente

source: The call will *jump* from one member to another in a predefined order based on the last time the member attended a call. Members whose latest call is older will be called first.
es: La llamada *saltará* de un miembro a otro en un orden predefinido en base a la última vez que los miembros atendieron a llamadas. Miembros cuya llamada atendida sea mas antigua serán llamados primero.

source: Fewer calls
es: Menos atendidas

source: The call will *jump* from one member to another in a predefined order based on the number of atteded calls. Members that have attedended less calls will be called first.
es: La llamada *saltará* de un miembro a otro en un orden predefinido en base al número de llamadas atendidas. Miembros con menos llamadas antendidas serán llamados primero.

source: The call will *jump* from one member to another in a random order, ringing during the configured time.
es: La llamada *saltará* de un miembro a otro en un orden aleatorio.

source: Round Robin memory
es: Secuencialmente (memoria)

source: The call will *jump* from one member to another in a predefined order starting past the last member that attended a call.
es: La llamada *saltará* de un miembro a otro en un orden predefinido empezando a partir del último miembro que atendió una llamada.

source: Linear
es: Secuencialmente (∞)

source: The call will *jump* from one member to another in a predefined order based on the creation time of the member.
es: La llamada *saltará* de un miembro a otro en un orden predefinido en base a la fecha de creación de cada miembro.

source: Route locks
es: Candados

source: Route locks are a simple but powerful way to fork route logics when delivering calls. This fork is done depending on the state of the lock on a particular moment:
es: Los candados son una forma simple pero poderosa the crear bifurcaciones a la hora de entregar llamadas. Esta bifurcación se hará en función del estado de los candados en un momento concreto.

source: **Opened**: green light, go ahead.
es: **Abierto**: luz verde, adelante.

source: **Closed**: red light, no trespassing allowed.
es: **Cerrado**: luz roja, paso prohibido.

source: They are used as conditional route rule criteria (see how in :ref:`conditional_routes`).
es: Se utilizan como un criterio más en las reglas de rutas condicionales (ver cómo en :ref:`conditional_routes`).

source: Route lock creation
es: Creación de candados

source: When you add a new route lock in **Route Locks** section, you are asked for the following fields:
es: Cuando creas un nuevo candado en la sección **Candados**, se te presentan los siguientes campos:

source: This name will be used in conditional routes to identify the lock.
es: Nombre identificativo del candado.

source: Just a description.
es: Una simple descripción.

source: Status
es: Estado

source: Set the initial status of the lock: opened or closed.
es: Estado inicial del candado: abierto o cerrado.

source: Route locks service codes
es: Códigos de servicios de candados

source: Although you can set the initial lock status on creation and change it using the admin portal too, the usual way to handle the status changes of a lock is to use the service codes listed in **Route locks** section.
es: Aunque en la creación se pueda indicar el estado inicial del candado y éste pueda ser modificado editando el candado, la forma más habitual de interactuar con los candados es usando los códigos de servicio listado en la sección **Candados**.

source: These services codes have two parts:
es: Estos códigos tienen dos partes:

source: **Service code**: configured in **Services** section per brand/company.
es: **Código de servicio**: configurado en la sección **Servicios**.

source: **Lock id**: immutable numeric id assigned to each lock.
es: **Id de candado**: identificador numérico inmutable asignado a cada candado.

source: There are 3 service codes available for most common operations on locks:
es: Existen 3 códigos de servicios disponibles para las operaciones más comunes:

source: Open Lock
es: Abrir Candado

source: Close Lock
es: Cerrar Candado

source: Toggle Lock.
es: Conmutar Candado

source: Read :ref:`services` for further details.
es: Leer :ref:`services` para más detalles.

source: The section **Company configuration** > **Schedule** allows to configure different time gaps when an :ref:`external DDI <ddis>` will be available.
es: La sección **Configuración de Empresa** > **Horarios** permite definir los tramos horarios en los que un :ref:`DDI externo <ddis>` está dentro de horario.

source: With the above configuration, we have defined a morning schedule that will be applied from Monday to Thursday.
es: Con la configuración anterior, hemos definido el tramo horario de mañana de una empresa de Lunes a Jueves.

source: We can also define an afternoon schedule for Monday to Thursday too:
es: Sigamos con el ejemplo y definamos el tramo horario de tarde de Lunes a Jueves:

source: And apply a different time gap for the Fridays:
es: Y el horario reducido de los viernes:

source: We have the following time gaps that combined will determine our company office schedule.
es: Ya tenemos los siguientes tramos horarios que, combinados, describen un horario de oficina tradicional:

source: The schedule will be defined by combining the active time gaps: Any time outside this grouped gaps will be considered out-of-schedule.
es: Los horarios definen, una vez sumados, los tramos horarios activos: toda hora que no caiga dentro de uno de los tramos agrupados será considerada como llamada fuera de horario.

source: Company Services
es: Servicios de Compañía

source: Services defined in this section **are not accessible during a conversation**. They are activated by **calling the codes**, not using DTMF codes while talking.
es: Los servicios que se definen en esta sección **no son accesibles en medio de una conversación**. Se activan **llamando** a los códigos que se mencionarán, no marcándolos en medio de una conversación.

source: Each company can *customize* the default values assigned by the *brand operator* using the section **Company configuration** > **Services** and changing the codes listed there.
es: Cada empresa puede *pisar* los valores por defecto asignados por su *operador de marca* accediendo a **Configuración de Empresa** > **Servicios** y cambiando el código asignado.

source: Company that wants to capture using \*\* instead of the default \*95:
es: Empresa que quiere capturar con \*\* en lugar de con \*95:

source: Services deleted by the *company admin* will not available to users.
es: Los servicios que el *administrador de empresa* borre no podrán ser utilizados por sus usuarios.

source: Terminals configuration
es: Terminales

source: The section **Company configuration** > **Terminals** allows creating new SIP credentials that can be used by multiple SIP devices to place and receive calls from IvozProvider.
es: La sección **Configuración de empresa** > **Terminales** permite dar de alta credenciales SIP que podrán ser utilizados por diversos dispositivos SIP para realizar y recibir llamadas de IvozProvider.

source: The best way to understand this section is creating a new item and see the fields that must be filled.
es: La mejor forma de entender la sección es crear uno nuevo y ver los campos que tenemos que cumplimentar:

source: Username that will use the terminal during the SIP authentication phase with IvozProvider.
es: Usuario que utilizará el terminal para presentarse ante IvozProvider y para realizar la fase de autenticación SIP.

source: Password that will use the terminal to answer the SIP authentication challenge. You can use the automatic password generator to fullfill the secure password requirements.
es: Contraseña que utilizará el terminal para responder a la fase de autenticación SIP. Utilizar el generador automático de contraseñas para cumplir los criterios de seguridad exigidos.

source: Allowed/Disallowed codecs
es: Codecs rechazados/permitidos

source: Determines what audio and video codecs will be used with the terminal.
es: Determina que codecs de audio y video serán empleados con el terminal.

source: CallerID update method
es: Modo de actualización

source: Choose the SIP method the terminal prefers to received the session update information: INVITE or UPDATE. The help hint can be used as guide to configure different terminal manufacturers. Use *INVITE* in case of doubt.
es: Indica si el terminal prefiere utilizar reINVITEs o UPDATEs para actualizar la sesión. La sección de ayuda indica qué terminales suelen requerir qué método. En caso de duda, utilizar *invite*.

source: Terminal model
es: Modelo de terminal

source: Determines the provisioning type that will receive this terminal. The section :ref:`terminal provisioning <provisioning>` will explain in depth the different models for automatic provision. If your device does not require provisioning, just select *Generic*.
es: Indica el tipo de provisión que tendrá que recibir este terminal concreto. En el apartado dedicado a la :ref:`provisión de terminales <provisioning>` se verá que existen unos modelos con provisión automática y se explicará todo en profundidad. En caso de no necesitar provisión, utilizar *Generic*.

source: Optional field that is only required if you plan to use IvozProvider :ref:`terminal provisioning <provisioning>`. This is the `phisical address <https://wikipedia.org/wiki/MAC_Address>`_ of the network adapter of the SIP device.
es: Campo necesario para modelos que utilizan el sistema de :ref:`provisión de terminales <provisioning>` de IvozProvider. Recoge la `dirección física <https://es.wikipedia.org/wiki/Direcci%C3%B3n_MAC>`_ del adaptador de red del dispositivo SIP.

source: For **most of devices** that doesn't require provisioning just filling **username** and **password** will be enough.
es: **En la mayoría** de dispositivos, siempre que no requieran provisión, **bastará con rellenar el nombre y contraseña**.

source: Once the terminal has been created, most devices will only require the name, password and :ref:`Company SIP domain <domain_per_company>` in order to place calls.
es: Una vez dado de alta el Terminal, en la mayoría de dispositivos bastará con configurar nombre, contraseña y :ref:`dominio SIP de la compañía <domain_per_company>` para poder llamar.

source: Users configuration
es: Usuarios

source: The installation process creates *Alice* and *Bob* users, allowing us to test internals calls between them without too much effort.
es: El proceso de instalación nos creó a *Alice* y a *Bob*, y esto nos permitió ahorrar mucho tiempo a la hora de conseguir que se llamarán entre ellos.

source: We skipped most of the settings in **Users** configuration that we will described in this section.
es: También nos permitió pasar un poco de puntillas por la sección de **Usuarios**, que ahora pasamos a definir en profundidad.

source: Personal data
es: Datos personales

source: Used to identify this user in most of the screens. This is also the name that will be displayed in internal calls made from this user.
es: Se utilizará para referenciar al usuario en múltiples ámbitos, incluyendo el nombre que se presenta en llamadas internas.

source: Lastname
es: Apellidos

source: Most of the times this is used to complete the previous field.
es: Irá junto con el Nombre en casi todos los casos.

source: Email used to send the user's received voicemails. This is also used to identify the user in their portal.
es: Dirección de correo electrónico del usuario al que se enviarán los mensajes de voz del buzón.

source: Country code / Area code
es: Código de país / Código de área

source: Defines the way the user calls and the way the numbers are presented to this user.
es: Define cómo llama el usuario y qué formato tendrán los números externos que se le presenten.

source: Language
es: Idioma

source: When a locution is played to this user, this language is used.
es: Cuando una locución se le reproduzca a este usuario, se usará este idioma.

source: Timezone
es: Zona horaria

source: User portal call list times will use this timezone.
es: Las llamadas listadas en el portal de usuario mostrarán las horas en esta zona horaria.

source: Login Info
es: Credenciales portal de usuario

source: Active
es: Activo

source: Allows administrators to grant or disable user's acces to the :ref:`user's portal <userportal>`.
es: Da posibilidad al administrador de la plataforma de desactivar el acceso al :ref:`portal de usuario <userportal>`.

source: Password used to access the :ref:`user's portal <userportal>`.
es: Contraseña para acceder al :ref:`portal de usuario <userportal>`.

source: QR Code
es: Código QR

source: If enabled, a QR code for Grandstream Wave softphone configuration will be shown.
es: Si está activo, mostrará un código QR en el portal de usuario que permitirá configurar los softphones Grandstream Wave.

source: Basic Configuration
es: Configuración básica

source: The available terminals created in :ref:`terminals` are listed here for assignment.
es: Los terminales dados de alta en :ref:`terminals` se listan aquí para realizar la vinculación usuario-terminal.

source: Screen Extension
es: Extensión principal

source: One of the available :ref:`extensions` that this user will display when placing internal calls. While multiple extensions can be routed to the user, only one of them will be presented when the user calls.
es: Tal y como se explicaba en :ref:`extensiones`, fija la extensión del usuario para llamadas internas.

source: Outgoing DDI
es: DDI de salida

source: As described in :ref:`external_ddi`, determines the number that will present when placing external outgoing calls.
es: Adelantado en :ref:`external_ddi`, determina el número que presenta el usuario en llamadas externas salientes.

source: Manages exceptions to previous setting. Read :ref:`outgoingddi_rules` for further reference.
es: Gestiona excepciones al parámetro anterior. Leer :ref:`outgoingddi_rules` para más referencia.

source: One of the created :ref:`Call ACL <call_permissions>` groups, described it the previous sections.
es: Asignación de un grupo de permisos explicado en profundidad :ref:`aquí<call_permissions>`.

source: Do not disturb
es: No molestar

source: When this setting is enabled, the user won't receive any call but can still place calls.
es: Impide que nadie pueda llamar a este usuario, sin impedirle a él llamar a donde desee.

source: Max Calls
es: Límite de llamadas

source: Limits the number of received calls if the user is handling simultaneously (inbound and outbound) more than the number set. Set 0 for unlimited calls.
es: Limita el número de llamadas recibidas si el usuario está gestionando un número igual o superior a este límite. El valor 0 desactiva el límite.

source: Calls from non-granted IPs:
es: Llamadas desde IPs no autorizadas:

source: Enable calling from non-granted IP addresses for this user. It limits the number of outgoing calls to avoid toll-fraud. 'None' value makes outgoing calls unlimited as long as company IP policy is fulfilled. Read :ref:`roadwarrior_users` for further reference.
es: Permitir a este usuario llamar desde IPs no autorizadas. Se limita el número de llamadas salientes para evitar fraude. Seleccionar 'Ninguna' permite un número ilimitado de llamadas siempre y cuando se cumpla la política de restricción de IPs de la empresa. Leer :ref:`roadwarrior_users` para más información.

source: Voicemail
es: Buzón de voz

source: VoiceMail enabled
es: Buzón de voz

source: Enables or disables the **existance** of a users voicemail. This only makes the voicemail available to be routed as described in the section :ref:`forward to voicemail <fwd_to_vm>`.
es: Activa o desactiva **la existencia** del buzón de voz del usuario. Aparte de existir, como veremos :ref:`más adelante <fwd_to_vm>`, habrá que desviar las llamadas que queramos al buzón.

source: Voicemail Locution
es: Locución de buzón

source: If set, this locution is played as voicemail welcome message when a voicemail for this user is going to be recorded. This only applies for call forwardings to voicemail described in the section :ref:`forward to voicemail <fwd_to_vm>`.
es: Esta locución se reproduce como locución de bienvenida al buzón de voz cuando alguien va a dejar un mensaje de voz al usuario. Solo se reproduce para los desvíos al buzón de voz descritos en :ref:`desvíos a buzón <fwd_to_vm>`.

source: Email notification
es: Notificar por email

source: Send an email to the configured user address when a new voicemail is received.
es: Mandar a la dirección del usuario un correo notificando del mensaje de voz.

source: Attach sounds:
es: Adjuntar audio del mensaje

source: Attach the audio message to the sent email.
es: Adjuntar o no en dicho mail el audio del mensaje

source: If voicemail locution is not assigned, default locution will be used as long as the user has not recorded a custom message through the voicemail menu (calling to voicemail service code).
es: Si no se configura ninguna locución de buzón, se utilizará la locución por defecto, siempre y cuando el usuario no haya grabado su locución personal utilizando el menú de voz (llamando al código de servicio del buzón de voz).

source: Boss-Assistant
es: Jefe-Asistente

source: This feature will turn the user into a boss that can only be directly call by:
es: La funcionalidad jefe-asistente impide que un usuario sea molestado por nadie que no sea:

source: The selected assistant.
es: Su asistente.

source: Any origin that matches the white list.
es: Origenes que coincidan con la lista blanca.

source: The rest of the calls to *a boss* will be redirected to the assistant.
es: Toda llamada con destino a *un jefe* será desviada al asistente.

source: Is boss
es: Jefe

source: Determines if this user is a boss.
es: Indica que el usuario en cuestión es jefe o no.

source: Assistant
es: Asistente

source: Who will receive the redirected calls of this boss.
es: Si el usuario es jefe, indica quién es su asistente.

source: Whitelist
es: Lista blanca

source: :ref:`match_lists` with origins that are allowed to call directly to the boss.
es: :ref:`match_lists` con los orígenes que pueden llamar directamente al jefe.

source: Group Configuration
es: Pertenencia a grupos

source: As described in the sections :ref:`huntgroups` and :ref:`capture_groups`, the user can be part of one or more huntgroups and pickup groups.
es: Tal y como se verá en las secciones :ref:`huntgroups` y :ref:`capture_groups`, un usuario puede pertenecer a uno o a varios grupos de captura y grupos de salto.
