Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/company.po
Languages: es

source: DDI has an external call filter and is routed to the new conditional route.
es: El DDI tiene un filtro de entrada externo y se enruta a nuestra nueva ruta condicional

source: When a call is received:
es: Cuando se recibe una llamada:

source: External call filter is evaluated:
es: Se evalúa el filtro de entrada externo:

source: If current day is marked in any calendar, the holiday logic applies.
es: Si el día actual está marcado en alguno de sus calendarios, se aplica la lógica de festivo.

source: If current time is not inside any time-gap, out-of-schedule logic applies.
es: Si la hora actual no está incluida en ninguno de los horarios seleccionados, se aplica la lógica de fuera horario.

source: If external call filter logics have not applied, conditional route is evaluated.
es: Si ninguna de las anteriores lógicas del filtro de entrada externo aplica, se evalúa la ruta condicional.

source: Conditional route is not intented as an external call filter replacement. Filter is evaluated first, conditional route afterwards.
es: Las rutas condicionales no son un reemplazo para los filtros de entrada externos. El filtro se evalúa en primer lugar, la ruta condicional después.

source: Conference rooms
es: Salas de audioconferencias

source: IvozProvider supports Conference rooms that can be configured in the section **Company configuration** > **Conference rooms**.
es: IvozProvider provee la funcionalidad de salas de audiconferencias que se pueden configurar en la sección **Configuración de empresa** > **Salas de conferencias**.

source: **In distributed installations** using Conferences is only compatible with an static assignment or 'hash based' distribution (see **Distribute method** :ref:`here <Virtual PBX>`).
es: En **Instalaciones distribuidas** el uso de conferencias solo es compatible con una asignación estática o 'basada en hash' (ver **Método de distribución** :ref:`aquí <PBX virtual>`).

source: Brand operators can choose which Companies have conferences (see **Features** in :ref:`Brand Configuration` and :ref:`Company Configuration`).
es: Los operadores de marca pueden elegir que Compañía tiene conferencias (ver **Features** en :ref:`Configuración de Marca` y :ref:`Configuración de Compañía`).

source: Create a new audio conference
es: Crear una sala de audioconferencias

source: The following image shows the process of creating a new confrence room:
es: La siguiente imagen ilustra el proceso de creación de una sala de audioconferencias:

source: Name
es: Nombre

source: Name that will used to identify this conference room in other sections
es: Nombre por el que se referenciará la sala en otras secciones

source: Max members
es: Límite de participantes

source: Maximum number of participants in the conference. When this limit is reached, join requests will be rejected.
es: Apartir del número especificado, no se admitirán más miembros.

source: Pin protected
es: Protegido con contraseña / Código PIN

source: Conference rooms can be pin protected. The pin will be requested before entering and must be numeric.
es: Se puede forzar al sistema a pedir un PIN para poder entrar. En caso de activar, se puede introducir un PIN numérico.

source: Member limit can be disabled by setting it to 0.
es: Para desactivar el límite de participantes, configurar su valor a 0.

source: Route an extension or DDI to the conference
es: Asociar una extensión o un DDI externo

source: In order to enter a conference there must be a number that is route to them:
es: Para poder meter participantes, el primer paso sería asociar una extensión interna a la sala, para poder desvíar a la misma, transferir, etc.:

source: In the following section we will see how to configure a :ref:`external DDI <ddis>` to a conference room so it can be used by external callers.
es: En la siguiente sección veremos como también se puede apuntar un :ref:`DDI externo <ddis>` a una sala de conferencias, para meter en la sala a gente externa a la empresa.

source: There are other ways to make external callers join a conference room without using a DDI: it can be assigned to an Extension. This way, any user can transfer the call to the conference extension, or can be routed, for exmaple using an IVR entry.
es: Existen otras formas de meter un participante externo a una sala de audioconferencias sin dedicar un DDI externo: que alguien de dentro transfiera la llamada a la extensión de la sala, acceder por medio de un IVR, etc.

source: Country
es: País

source: The country of the new created DDI. Used for E164 standarization.
es: El país de la númeración pública que estamos dando de alta.

source: The number, without country code.
es: El número en cuestión, sin códigos de país.

source: Peering contract
es: Contrato de peering

source: The peering contract that provides this number. This relation allow the platform to apply the required :ref:`transformations` in order to determine its standard form.
es: El contrato de peering por el que entra la numeración. Esta relación permite aplicar las :ref:`Transformaciones Numéricas` adecuadas.

source: External Call Filter
es: Filtro de entrada

source: Allows configuration based on Calendars and Schedulers as shown in :ref:`External Call Filters`. Leave empty if you don't need to apply any kind of filter.
es: Permite aplicar lógicas de filtrado en base a horario y calendario, se verán en :ref:`external_filters`. Dejar sin seleccionar para no aplicar filtro alguno.

source: Route
es: Enrutar

source: A DDI can have different :ref:`treatments <routing_logics>`. For our current goul, set route to user and select *Alice*.
es: Un DDI puede tener distintos :ref:`tratamientos <routing_logics>`. Para nuestro objetivo, enrutar al usuario *Alice*.

source: Record calls
es: Grabar llamadas

source: Can be used to record external calls (see :ref:`call_recordings`).
es: Dejar desactivado de momento, se explicará en :ref:`call_recordings`.

source: Tarificate incoming calls
es: Tarificar llamadas entrantes

source: This setting requires the external tarification module and allows tarification on special numbers. This module is not standard so don't hesitate in :ref:`contact us <getting_help>` if you are interested.
es: Requiere del módulo de tarificación externa y permite tarificar llamadas entrantes a numeraciones especiales. Consultar a los :ref:`desarrolladores de la solución <getting_help>` en caso de estar interesados.

source: DDI external filters
es: Filtro de entrada

source: We can assign a **external call filter** configured in :ref:`External Call Filters`.
es: Podemos seleccionar el **Filtro de entrada externo** configurado en :ref:`la sección anterior <external_filters>`.

source: DDI routes
es: Tratamientos

source: Once the call has passed all the checks in the filter (schedules and calendars) and after the welcome locution has been played (if there is any configured), we can route the call to the following processes:
es: Vemos que tenemos más opciones aparte de enviar la llamada, una vez superado los filtros de horario y calendario (y previa locución de bienvenida), directamente a un usuario:

source: :ref:`queues`
es: :ref:`colas`

source: We can also route the DDI to a :ref:`Virtual Fax <faxing_system>`, but this is something we will explain in the following block.
es: También podemos apuntar el DDI a un :ref:`fax virtual <faxing_system>`, pero esto se verá en el siguiente bloque.

source: **An extensions is**, by definition, **an internal number with an assigned logic**.
es: **Una extensión es**, por definición, **un número interno con una lógica asignada**.

source: Create a new extension
es: Crear una nueva extensión

source: Number
es: Número

source: The number that must be dialed by the internal user that will trigger the configured logic. It must have a minimum length of 2 and must be a number.
es: El número que al ser marcado por un usuario interno activará la lógica que sigue. Tiene que tener una longitud mínima de 2 y estar compuesto únicamente por dígitos.

source: This select will allow us to choose the logic that will use this extension when is dialed from an internal user. Depending on the selected route, and additional select or input will be shown to select the hungroup, conference room, user, etc.
es: Este selector nos permite indicar la lógica que seguirá esta numeración cuando sea marcada por un usuario concreto. Al seleccionar un ítem en cuestión, se nos mostrará un selector adicional para seleccionar el grupo de salto, sala de conferencias, etc.

source: If an extension has a number that conflicts with an external number, this external number will be masked and, in practice, will be unavailable for the whole company.
es: Si existe una extensión cuyo número conflicte con un número externo, el número externo quedará enmascarado y resultará, en la práctica, inaccesible para toda la empresa.

source: External Call filters
es: Filtros de entrada externo

source: One of the most common task a company's administrator will do is to configure schedules and calendards to apply to existing :ref:`ddis`.
es: Una de las configuraciones más habituales que todo administrador de empresa querrá realizar en un momento dado es poner filtros de horario y de calendario a sus :ref:`ddis`.

source: Once we have our new created :ref:`Schedules` and :ref:`Calendars`, it's time to apply them in what we call **External call filter**.
es: Una vez que tenemos unos :ref:`Horarios` y unos :ref:`Calendarios` creados, llega el momento de agruparlos en lo que en IvozProvider se conoce por **Filtro de entrada externos**.

source: The company admin can configure them in the following screen:
es: El interfaz que se le presenta al administrador de empresa es el siguiente:

source: Descriptive name that will reference this filter in DDIs configuration.
es: Nombre con el que se referenciará este filtro.

source: Welcome locution
es: Locución de bienvenida

source: This locution will be played if the call is not going to be forwarded by out of schedule or holiday filtering (in other words if the normal routing of the DDI is going to be applied).
es: Esta locución se reproduce siempre que la llamada no se va a rechazar por festivo o fuera horario (es decir, en una hora normal de un día normal).

source: Black list
es: Lista negra

source: External origin will be checked against the associated :ref:`match_lists`, if a coincidence is found, the call will be rejected immediately.
es: Los origenes externos serán comprobados contra las :ref:`match_lists` asociadas, si se encuentra una coincidencia, la llamada será directamente rechazada.

source: White list
es: Lista blanca

source: External origin will be checked against the associated :ref:`match_lists`, if a coincidence is found, the call will be directly routed to the DDI destination, skipping the filter process. Take into account that black listed are checked before white lists.
es: Los origenes externos serán comprobados contra las :ref:`match_lists` asociadas, si se encuentra una coincidencia, la llamada será directamente enrutada al destino del DDI, ignorando el proceso del filtro. Tenga en cuenta que las listas negras son comprobadas antes que las listas blancas.

source: Holiday locution
es: Locución de festivo

source: The locution will be played when the day is maked as holiday in any of the calendars associated with the filter **if the calendar entry has no locution** for that day.
es: Esta locución se reproducirá cuando el día de hoy esté marcado como festivo en uno de los calendarios y no se haya definido una locución de festivo especial en dicho calendario para ese día.

source: Holiday forward type
es: Tipo de desvío festivo

source: After playing the above locution (if configured), call can be forwarded to a voicemail, external number or internal extension. For example, the filter of the image will redirect calls during holidays to the external number 676 676 676.
es: Si una llamada entra un día festivo, aparte de la locución de festivo (si la hay), se puede realizar un desvío a un buzón de voz, a un número externo o a una extensión interna. En el ejemplo, la llamada se desviará los días festivos al móvil 676 676 676.

source: Out of schedule locution
es: Locución fuera horario

source: The locution will be played when, not being holiday, the current time is not in any of the time gaps defined in the schedules assigned to the filter.
es: Esta locución se reproducirá cuando, siendo un día no festivo, la hora actual no esté dentro de ningunos de los horarios vinculados.

source: Out of schedule forward type
es: Tipo de desvío fuera horario

source: Like in the holidays forward, but for out of schedule. The image above won't apply any forward (and the call will be hanguped).
es: Lo mismo que en festivo, pero para el caso de fuera horario. En la imagen, no se ejecutaría ningún desvío.

source: One or more calendars can be associated with the filter. The combination of all the callendars will be applied.
es: Permite seleccionar múltiples calendarios, de forma que el calendario del filtro es la suma de todos ellos.

source: Schedules
es: Horarios

source: One or more schedules can be applied. The combination of all the time gaps defined in the schedules will be applied.
es: Permite seleccionar múltiples horarios, de forma que el horario del filtro es la suma de todos ellos.

source: Holidays are processed **before** out of schedule events.
es: El día festivo tiene prevalencia sobre el fuera horario. Primero se evalúan los calendarios, luego los horarios.

source: In the next section we will use this new created filter with :ref:`ddis` so we can configure a welcome locution for normal days, and especial behaviours for hoildays and out of schedule events.
es: En la siguiente sección veremos como este filtro se asigna a los :ref:`ddis` que queramos, definiendo así el comportamiento de los mismos fuera de horario y en días festivos, así como dentro de horario en el caso de *setear* locución de bienvenida en el filtro.

source: Virtual Fax System
es: Sistema de Fax Virtual

source: IvozProvider includes a simple but efficient *faxing* solution that allows:
es: IvozProvider incluye una solución de *faxing* simple pero eficiente que permite:

source: Sending PDF files via Fax.
es: Enviar archivos PDF vía Fax.

source: Receiving faxes through email or check them through the web portal.
es: Recibir faxes por email o verlos a través del portal web.

source: IvozProvider uses `T.38 <http://www.voip-info.org/wiki/view/T.38>`_ for both sending and receiving faxes. Brand Operator must use *peering contracts* that have support for it.
es: IvozProvider usa `T.38 <http://www.voip-info.org/wiki/view/T.38>`_ para enviar y recibir faxes. El Operador de Marca debe utilizar un *contrato de peering* que tenga soporte para T.38.

source: Creating a virtual fax
es: Creando un fax virtual

source: This is the interface that turns up when we create a new fax in section **Company configuration** > **Virtual Faxes**:
es: Este es el interfaz que se presenta cuando creamos un nuevo fax en la sección **Configuración de compañía** > **Faxes Virtuales**:

source: Fields are nearly self-explanatory:
es: Los campos son prácticamente auto-explicativos:

source: Used by remaining section to reference a fax
es: Utilizado en el resto de secciones para referenciar este fax

source: Email
es: Dirección de correo electrónico

source: Email address when we want to receive incoming faxes (if we check 'Send by email')
es: Dirección de correo electrónico en la que queremos recibir los faxes entrantes (si seleccionamos la opción 'Enviar por email'

source: Outbound DDI
es: DDI de salida

source: DDI used as source number for outgoing faxes
es: DDI utilizado como número origen en los faxes salientes

source: To receive faxes in this DDI, we need to point it to our new fax in the section **DDIs**:
es: Para recibir faxes en este DDI, tenemos que apuntarlo a nuestro nuevo fax en la sección **DDIs**:

source: Brand Operator can choose one or more *Outgoing Routes* for sending faxes:
es: El operador de marca puede elegir una o más *rutas de salida* para enviar faxes:

source: This route applies to all faxes sent by selected company (or for all companies).
es: Esta ruta aplica a todos los faxes enviados por la compañía seleccionada (o por todas las compañías).

source: *load-balancing* y *failover* logics described in :ref:`previous sections <routes_metrics>` apply to faxes too.
es: Las lógicas de balanceo y *failover* descritas en :ref:`secciones anteriores <routes_metrics>` también funcionan para las rutas de faxes.

source: If no fax-specific route is defined, faxes will be routed using standard call routes.
es: Si no se define ninguna ruta específica de fax, los faxes se enrutarán como llamadas de voz normales.

source: Sending a fax
es: Enviar un fax

source: Sending a fax is an easy task. First, we upload de PDF file and set the destination:
es: Enviar un fax es una tarea sencilla. En primer lugar, subimos el archivo PDF y escribimos el número de destino:

source: The list shows the fax and its status:
es: Este listado muestra el fax y su estado:

source: Incoming faxes display
es: Visualización de faxes entrantes

source: Apart from being received by mail, faxes can be watched and downloaded within the web portal too:
es: Los faxes entrantes se pueden recibir vía correo electrónico, pero también pueden ser visualizados y descargados desde el panel web pulsando:

source: **Friends** section in the **Company configuration** allows interconnection of IvozProvider with other SIP PBX systems through a SIP *trunk*. The most typical use case is when a company have multiple PBX systems that want to integrate in a single flow.
es: La sección **Amigos** permite a los **administradores de empresa** conectar su PBX virtual con otras centralitas SIP por medio de *trunks* SIP. El caso de uso habitual es el de conectar IvozProvider a otra centralita SIP de la empresa, otra sede, etc.

source: It's important to understand the difference between **Contract peering** defined by the **brand operator** to connect with the public network and **Friends**, defined by **company administrators** to connect the system with other PBXs.
es: Es importante entender la diferencia entre los **Contratos de peering** definidos por el **operador de marca** para conectar con la red pública y los **Amigos**, definidos por el **administrador de empresa** para conectar su PBX con otras PBXs.

source: What does this allow?
es: ¿Qué permite?

source: This sections allows not just communication between users at boths ends of the SIP *trunk*, but also:
es: Esta sección permite comunicar los usuarios de ambos extremos del *trunk* SIP, pero también permite:

source: Users "from the other side" can call to the public network just like native Ivozprovider :ref:`Users <users>`.
es: Que los usuarios del "otro lado" llamen a la red pública igual que los :ref:`Usuarios <usuarios>` nativos.

source: Public network calls can be routed to the other SIP *trunk* end.
es: Que llamadas de la red pública se puedan dirigir a usuarios del otro extremo del *trunk* SIP

source: Types of friends
es: Tipos de amigos

source: There are 2 main types of SIP PBX that can be integrate with IvozProvider:
es: Se pueden unir 2 tipos de centralitas SIP a IvozProvider:

source: **Direct connection PBX**: IvozProvider must be able to talk SIP directly with this kind of friends by just redirecting the traffic to the proper port of the public IP address of the PBX.
es: **Centralitas con conectividad directa**: Esto implica que IvozProvider tiene la posibilidad de hablar SIP directamente sin más que dirigir su tráfico a una IP pública a un puerto concreto.

source: **PBX behind NAT**: Not directly accesible. This kind of PBX must register at IvozProvider (just like all the :ref:`Terminals <terminals>` do).
es: **Centralitas tras NAT**, no accesibles directamente. Este tipo de centralitas tendran que registrarse en IvozProvider (exactamente igual que lo hacen los :ref:`Terminales <terminals>`).

source: What kind of calls can be routed through a *friend*?
es: ¿Qué llamadas se envían al *friend*?

source: IvozProvider must know what calls must be routed to the different defined *friends*. For that, **company administrator** will configure regular expressions that describe the numbers that *can be reached* through the **friend**.
es: IvozProvider tiene que saber qué llamadas envía por los distintos *friends* que se definan. Para ello, el **administrador de empresa** definirá por medio de tantas expresiones regulares como desee los destinos que son *alcanzables* por medio del **amigo**.

source: Internal :ref:`extensions <extensions>` have priority over any expression defined in the *friends*.
es: Las :ref:`extesiones internas <extensiones>` tienen prevalencia sobre las expresiones regulares de los *friends*.

source: To sum up, IvozProvider will route a call received by a :ref:`user <users>` or a :ref:`friend <friends>` following this logic:
es: Es decir, IvozProvider encamina una llamada recibida por un :ref:`usuario <users>` o por un :ref:`amigo <friends>` aplicando esta lógica:

source: Destination matches an existing IvozProvider extension?
es: ¿Coincide con una extensión definida en la sección Extensiones?

source: If not: Destination matches any *friend* regular expression?
es: Si no, ¿coincide con alguna expresión regular vinculada a alǵun *friend*?

source: If not: This is an external call.
es: Si no, se considera una llamada externa.

source: Configuration
es: Configuración

source: The **Friend** configuration is a merge between a **User** and a **Terminal**
es: La configuración de un **Amigo** es una fusión de la configuración de un **Usuario** y un **Terminal**.

source: **Friends** are so similar to **Users** that both talk SIP with the :ref:`proxyusers`.
es: La equivalencia **Amigo** <-> **Usuario** es tal, que los **Amigos** hablarán SIP con el :ref:`proxyusers`.

source: This are the configurable settings of *friends*:
es: Estos son los parámetros a configurar a la hora de definir un *amigo*:

source: Name of the **friend**, like in **Terminals**. This will also be used in SIP messanges (sent **From User**).
es: Nombre del **Amigo**, equivalente al nombre del **Terminal**. Se utiliza en los mensajes SIP (**From User** enviado).

source: Description
es: Descripción

source: Optional. Extra information for this **friend**.
es: No se utiliza más que para describir el **amigo**

source: Priority
es: Prioridad

source: Used to solve conflicts while routing calls through **friends**. If a call destination **matches** more than one friend regular expresion the call will be routed through the friend with **less priority value**.
es: Sirve para resolver conflictos a la hora de dirigir llamadas hacia un **amigo** u otro. Si una llamada *matchea* expresiones regulares más de un *friend*, **se encaminará la llamada al que tenga menor valor de prioridad**.

source: Password
es: Contraseña

source: When the *friend* send requests, IvozProvider will authenticate it using this password. Like in terminals **using password IS A MUST**.
es: Cuando el *friend* nos envíe peticiones, IvozProvider le autenticará utilizando esta contraseña. **Es obligatorio el uso de contraseña**.

source: Direct connection
es: Conectividad directa

source: If you choose 'Yes' here, you'll have to fill the protocol, address and port where this *friend* can be contacted.
es: En caso de seleccionar 'Sí', se pedirá el protocolo, la IP y el puerto en el que se puede contactar con el *friend*.
