Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/company.po
Languages: es

source: Similar to :ref:`internal users <users>`, friends can place internal company calls without restriction (including Extension or other Friends). When calling to external numbers, this ACL will be checked if set.
es: Un *friend*, al igual que un :ref:`usuario interno <users>`, puede llamar a usuarios internos (todo lo que esté en Extensiones + Friends). Además, puede llamar a los destinos externos que permita este parámetro (igual que los usuarios).

source: Fallback Outgoing DDI
es: DDI de salida alternativo

source: External calls from this *friend* will be presented with this DDI, **unless the source presented by friend is a DDI that exists in DDIs section**.
es: Este DDI se empleará si el mostrado por el friend no coincide con ninguno de la compañía.

source: Country and Area code
es: Código de país y Area Code

source: Used for number transformation from and to this friend.
es: Las cabeceras de origen/destino se esperarán y enviarán en estos formatos.

source: Allowed codecs
es: Codecs rechazados/permitidos

source: Like a terminal, *friends* will talk the selected codec.
es: Al igual que un Terminal, un *friend* habla el codec seleccionado.

source: Request from IvozProvider to this friend will include this domain in the From header.
es: IvozProvider utilizará este valor en el From Domain de las peticiones al *friend*.

source: Calls to *friends* are considered internal. That means that ACLs won't be checked when calling a friend, no matter if the origin of the call is a user or another friend.
es: Las llamadas a los *friends* no atraviesan ACLs. Es decir, se consideran internas, por lo que todos los usuarios/amigos pueden llamar a todos los usuarios/amigos.

source: Asterisk as a friend
es: Configuración Asterisk remoto

source: At the other end of a friend can be any kind of SIP entity. This section takes as example an Asterisk PBX system using SIP channel driver that wants to connect to IvozProvider.
es: Al otro lado puede haber entidades SIP muy diversas, pero añadimos la configuración ejemplo para conectar IvozProvider con una centralita Asterisk:

source: If the system can not be directly access, Asterisk will have to register in the platform (like a terminal will do).
es: En caso de no estar directamente visible, el Asterisk tendrá que registrarse en IvozProvider (al igual que hacen los terminales).

source: Configuration will be something like this:
es: La configuración sería tal que:

source: *Friends*, like terminals, MUST NOT challenge IvozProvider. That's why the *insecure* setting is used here.
es: El *friend* no puede desafiar a IvozProvider, al igual que un terminal no desafía a IvozProvider cuando éste le llama. De ahí el *insecure*.

source: Summary
es: Resumen final

source: The key point is understanding that a *friend* has a direct relation with the extension-user-terminal trio:
es: Lo vital para entender esta sección es pensar que un *friend* tiene una relación directa con el trío extension-usuario-terminal:

source: Can place calls to all internal extensions and other friends.
es: Puede realizar llamadas a todas las extensiones internas y a otros amigos.

source: Can place external calls that its ACL allows
es: Pueden realizar las llamadas que le permita su grupo de permisos.

source: Display their configured outgoing DDI when calling to external entities
es: Presentan el DDI saliente que tengan configurado en sus llamadas salientes.

source: Never challenge IvozProvider requests (don't request authentication on received requests)
es: No desafían a IvozProvider (no hay autenticación SIP en las peticiones hacia ellos).

source: Answers IvozProvider authentication challenges (All request from them to IvozProvider must be autheticated for security reasons)
es: Responden a los desafíos de IvozProvider (hay autenticación SIP obligatoria en las peticiones desde ellos).

source: Only connects with *Users SIP Proxy*, like terminals. In fact, SIP traffic from friends are identical to any other user terminal traffic in format.
es: Hablan al *Proxy de usuarios*, igual que los terminales. De hecho, el tráfico SIP de una llamada de un *friend* es indistinguible al tráfico SIP de una llamada de un terminal.

source: Hunt groups
es: Grupos de salto

source: The hungroups allows configuring more complex *ringing* process that the traditional **call to a user**.
es: Los grupos de salto nos permiten definir lógicas de *ringado* más allá de la básica **llamada a usuario**.

source: There are multiple types:
es: Existen de varios tipos:

source: Ring all
es: A todos

source: The call will make all the terminals of the group during a predefined time.
es: La llamada suena en varios terminales a la vez durante el tiempo definido.

source: Sequential
es: Secuencialmente

source: The call will *jump* from one user to another in a predefined order ringing during the configured time. If the call is not answered by any user of the group, it will be hanguped (or trigger the no answer logic).
es: Suenan los usuarios definidos, en el orden definido y durante el tiempo definido a cada uno de ellos. Al acabar la secuencia, la llamada se cuelga.

source: Sequential (infinite)
es: Secuencialmente (infito)

source: The call will *jump* from one user to another in a predefined order ringing during the configured time. If the call is not answered by any user of the group, the call will *jump* again to the first member of the group and keep looping.
es: Suenan los usuarios definidos, en el orden definido y durante el tiempo definido. Al acabar la secuencia, se vuelve a iniciar la secuencia.

source: Random
es: Aleatoriamente

source: The call will *jump* from one user to another in a random order, ringing during the configured time. If the call is not answered by any user of the group, it will be hanguped (or trigger the no answer logic).
es: Reparte las llamadas entre los usuarios elegidos de forma aleatoria, sonando cada uno de ellos el tiempo acordado. Una vez que suenan todos, la llamada se cuelga.

source: Example 1: *Ringall* hunt group
es: Ejemplo 1: Grupo de salto *ringall*

source: The following example will show how to create a hunt group that will call our 2 users at the same time during 30 seconds:
es: Creemos por ejemplo un grupo de salto que llame a la par a nuestros 2 usuarios durante 30 segundos:

source: Pressing the proper icon, we can add Alice and Bob to the hunt group:
es: Pulsando el icono de las personas podemos añadir a Alice y Bob a nuestro grupo de salto:

source: Example 2: *Sequential* hunt group
es: Ejemplo 2: Grupo de salto secuencial

source: We will edit the hunt group to convert it into sequential: the call will ring Alice during 10 seconds, then it will ring Bob 15 seconds, repeting this process until one of them answers.
es: Editemos ahora este grupo de salto para que llame 10 segundos a Alice y después 15 segundos a Bob, reiniciando la secuencia si ninguno de los 2 contesta:

source: For this type of groups we have to configure priority (the call will *jump* from the users with lower number priority to the ones with higher number priority) and a *ringing* time for each user.
es: En este caso tenemos que indicar una **prioridad** (los usuarios suenan de menos a mayor prioridad) y un tiempo de *ringing*:

source: Hunt groups can be routed from any process of IvozProvider by simply adding an extension that route to them.
es: Para que ciertas lógicas (desvíos, etc.) alcancen un **Grupo de salto**, basta con crear una extensión apuntando a dicho grupo de salto y utilizar esta extensión como destino de la lógica.

source: Let's create a new extension that routes to this hunt group:
es: Creemos la extensión 200 que apunte a este grupo de salto:

source: Company Configuration
es: Configuración de Compañía

source: IVRs are the most common way to make **audio menus** where the caller must choose the destination of the call by **pressing codes** based on the locutions instructions that will be played.
es: Un IVR es la forma habitual de realizar **menús telefónicos** en los que **el llamante puede decidir el destino de su llamada sin más que pulsar dígitos** en base a las locuciones que se le van reproduciendo.

source: IVRs support specifying actions for dialed digits, but also they can be also be used to route any existing company extension.
es: Los IVRs soportan tanto espicificar acciones para digitos marcados, como enrutar cualquier extensión de la compañía.

source: IVRs have the following fields:
es: Describamos cada uno de los parámetros de un IVR:

source: Descriptive name of the IVR that will be used in other sections.
es: Forma de referenciar el IVR

source: Time that caller has to enter the digits of the target extension.
es: Tiempo adicional al de la locución de bienvenida que el sistema espera a que el interlocutor marque los dígitos.

source: Max digits
es: Longitud Máxima

source: Maximum number of digits allowed in this IVR.
es: Número máximo de dígitos que el llamante puede introducir.

source: This locution will be played as soon as the caller enters the IVR.
es: Locución que se le presenta al llamante invitándole a marcar la extensión con la que quiera hablar.

source: Success locution
es: Locución de éxito

source: In case the dialed number matches one of the IVR entries or extension exists in the company (and allow extensions is enabled), this locution will be played (usually something like 'Connecting, please wait...').
es: En caso de que la extensión marcada coincida con alguna entrada o la extension exista enla compañía (y permitir extensiones este habilitado), se reproducirá esta locución (típicamente dirá algo así como "Contactando...").

source: Allow dialing extensions
es: Permitir marcar extensiones

source: When this setting is enabled, the caller can directly press the extension that must previously know (or the welcome locution suggests) and the system will automatically connect with that extension.
es: Cuando este activada, permite al llamante introducir el número de extensión que previamente conozca (o que la locucion de bienvenida le sugiera) y el sistema le conectará automáticamente con la extensión.

source: Excluded Extensions
es: Extensiones excluidas

source: When Allow extensions is enabled, you can exclude some extensions to be directly dialed adding them to the exclusion list.
es: Cuando Permitir extensiones esta habilitado, es posible excluir algunas extensiones que no podrán ser llamadas directamente añadiendolas a la lista de exclusión.

source: No input process
es: Configuración sin entrada

source: If the caller does not input any digit in the timeout value, the no input process will trigger, playing the configured locution and redirecting the call to another number, extension or voicemail.
es: Si el llamante no introduce ningún digito, se reproduce la locución indicada y se desvía la llamada al número externo, extensión interna o buzón seleccionado.

source: Error process
es: Configuración Error

source: If the dialed extension does not match any IVR entry, any company extensions (when allow extensions is enabled), or it matches one of the extensions in the excluded Extensions list, the error process will trigger, playing the configured locution and redirecting the call to another number, extension or voicemail.
es: Si la extensión marcada no coincide con ninguna entrada del IVR, ninguna extensión de la compañía (si esta habilitado permitir extensiones), o coincide con alguna de las extensiones de la lista de exclusión, se activará el tratamiento de error, reproduciendo la locución configurada y enrutando la llamada a otro número, extensión o buzón de voz

source: IVR Entries
es: Opciones IVR

source: The most common usage for IVR is combining them with a welcome locution that says something like 'Press 1 to contact XXX, Press 2 to contact YYY, ..."
es: El caso más típico es el IVR que dice algo así como "Marque 1 si quiere hablar con administración, marque 2 si quiere hablar con informática..."

source: The process of each entry of the IVR can be defined in the following button:
es: Pulsando el botón de la siguiente imagen se pueden definir las equivalencias deseadas:

source: In this example, the caller can dial 1, 2 or 3 (the rest will be considered as an error and will trigger the **Error process**):
es: En este caso se puede marcar 1, 2 y 3 (todo lo demás será considerado inválido y activará la **Configuración de Error**):

source: 1: Call to the internal extension 200, created in :ref:`previous section <huntgroups>` that routes to hunt group *Reception*.
es: 1: Llamada a la extensión interna 200, creada :ref:`en la sección anterior <huntgroups>` y que apunta al grupo de salto *Recepción*.

source: 2: Call to the internal extension 101.
es: 2: Llama a la extensión interna 101.

source: 3: Route this call to the external number 676 676 676.
es: 3: Desvía la llamada al número externo 676 676 676.

source: Each of the IVR entries supports a locution that, if set, will be played instead of the IVR **success locution**. This way, you can configure a generic locution (like 'Connecting....') or a custom one for a given entry (like 'Connecting reception department, please wait...').
es: Cada una de las opciones de IVR admite una locución que, si se especifica, será reproducida en lugar de la **locución de éxito**. De esta manera, puede configurar locuciones genéricas (como 'Conectando...') o una a medida para algunas entradas (como 'Conectando con recepción, por favor espere...').

source: Entries are regular expressions
es: Las opciones son expresiones regulares

source: You can specify IVR entries as Regular Expressions. If entry is just a numeric value, it will be handled as a sequence of digits, otherwise it will be handled a regular expression. This can be handy if you have the same behaviour for a group of dialed numbers.
es: Puede especificar opciones de IVR como Expresiones regulares. Si la opcion es un valor númerico, será tratada como una secuencia de dígitos, si no será tratada como una expresión regular. Esto puede resultar útil si tiene el mismo comportamiento para un grupo de números marcados.

source: Locutions
es: Locuciones

source: The locutions of the platform are created and uploaded just like the files of :ref:`Music on Hold <musiconhold>`.
es: Las locuciones de la plataforma se crean y se suben de forma idéntica a cómo lo hacen las :ref:`músicas en espera <musiconhold>`.

source: The section **Company configuration** > **Locutions** allows the company admin to choose the sounds that will be played in many configuration places (IVR, etc) accross the platform.
es: La sección que permite al administrador de empresa subir las locuciones que utilizará en diversos puntos de la configuración (IVR, etc.) es **Configuración de Empresa** > **Locuciones**.

source: Locutions can be recorded from any terminal by dialing the Recording extension displayed in their edit screen.
es: Las locuciones pueden ser grabadas desde cualquier terminal marcando la extensión de grabado que se muestra en su pantalla de edición.

source: The main difference between a **locution** and **music on hold** is that the administrator chooses when the first one will be played (out of schedule, IVRs, and so on) and the second one will be played when a call is holded by an user.
es: La única diferencia entre una **locución** y una **música en espera** es su uso: la primera sonará cuando el administrador de empresa lo indique (fuera de horario, IVRs, etc.) y la segunda, en cambio, cuando la llamada sea retenida por un usuario.

source: Match Lists
es: Listas de coincidencia

source: Mach Lists are designed to group well known numbers or patterns in order to use them in specific treatments.
es: Las listas de coincidencia estan diseñadas para agrupar números conocidos o patrones numéricos para asociarlos a distintos tratamientos.

source: Depending on the section used, this numbers can be matched with the origin or the destination of the call, so be sure to use distinctive names for your match lists.
es: En función de la sección en la que se empleen, las listas se emplearán para comprobar un origen o destino de la llamada, por lo que se recomienda emplear nombres distintivos para las listas de coincidencia.

source: For example, like mentioned in the previous section :ref:`external_filters`, white and black lists contain one or more match lists. In this case, the **origin** of the call will be matched agains the list entries to determime if the treatment of **skipping** the filter or **rejecting** the call will be applied.
es: Por ejemplo, como se menciona en la seccion anterior :ref:`external_filters`, las listas blancas y negras pueden contener una o más listas de coincidencia. En este caso, el **origen** de la llamadas será comprobado contra las entradas de la lista para determinar si se deberá **ignorar** el filtro o **rechazar** la llamada directamente.

source: Match lists themselfs have no behaviour associated, they only provide a common way for all process to determine if a number has a treatment.
es: Las listas de coincidencia por si mismas no tiene un comportamiento asociado, tan solo proveen una manera común de agrupar números y patrones que serán empleados en otros procesos.

source: Beware that numbers of a Match list are checked against origins or destinations depending on the configuration section that use them.
es: Tenga en cuenta que en función de donde se emplee la lista, se comprobarán el origen o el destino de la llamada.

source: The section **Company configuration** > **Match Lists** allows to configure different items that will group the numbers and patterns.
es: La sección **Configuración de Empresa** > **Listas de coincidencia** permite definir las diferentes listas que agruparán números y patrones.

source: The screen displayed to the company administrator looks like this:
es: La interfaz que se le presenta al administrador de empresa cuando añade un horario es la siguiente:

source: After creating a new Match list, you can include numbers and patterns.
es: Tras la creación de la lista, se podrán incluir entradas en esta.

source: As shown, the match list can contain specific numbers or groups using `Regular Expressions <http://php.net/manual/en/reference.pcre.pattern.syntax.php>`_
es: Tal como se muestra, la lista puede contener números específicos o grupos empleando `Expresiones regulares <http://php.net/manual/en/reference.pcre.pattern.syntax.php>`_

source: Music on Hold
es: Música en espera

source: The music on hold will be played when the user holds the call and the other member waits until the call is resumed.
es: La música en espera suena cuando un usuario retiene la llamada y su interlocutor queda a la espera de seguir la conversación.

source: If a company has defined a music on hold, it will be played. Otherwise, the one defined by the brand administrator. If none of this is configured, a global music will be played.
es: Si una empresa define su música en espera, sonará. Si, por el contrario, no define ninguna, sonará la que haya definido el operador de su marca.

source: Multiple files can be added to be played as Music on Hold. The system will choose them randomly for each call.
es: Se pueden definir más de una música en espera y el sistema elegirá de forma aleatoria la música en espera para cada llamada.

source: Add a new music on hold
es: Añadir una nueva música en espera

source: Once the music has been *encoded* the **Status** fill will display *ready* and the music will be used for the next calls.
es: Una vez *encodeada* el campo **Status** muestra que está *ready* y se utilizará en las próximas llamadas:

source: IvozProvider supports most of the common audio formats and *encodes* them to the optimal format for the platform.
es: IvozProvider reconoce archivos de audio en los formatos más comunes y los *encodea* a los formatos óptimos para la plataforma.

source: After the *encoding*, we can download both the original and the converted version in the edit screen.
es: Después de *encodear*, podemos descargar el archivo original y el convertido sin más que editar el ítem:

source: Outgoing DDI Rules
es: Reglas DDI de salida

source: Most calling entities in IvozProvider require an outgoing DDI when placing calls to external numbers. This includes: Users, Friends, Faxes, Retail Accounts, and so on..
es: La mayoría de entidades en IvozProvider requiren un DDI saliente para poder realizar llamadas a números externos. Esto incluye: Usuarios, Friends, Faxes, Cuentas Retails, etc..

source: But there are some cases when a single outgoing DDI is not enough, and the presented DDI depends on the called number. To archive this dynamic outgoing DDI selection you can use Outgoing DDI rules.
es: Pero existen algunos casos en los que un solo DDI de salida no es suficiente, y el DDI presentado depende del número llamado. Para lograr esta selección dinámica de DDI saliente se pueden emplear las Reglas DDI de salida.

source: Before creating a new rule, it would be required to frist group the destination numbers in :ref:`match_lists`.
es: Antes de crear una nueva regla, es necesario primero agrupar los números destino en :ref:`match_lists`.

source: For this example, we will create a match list of corporative mobiles with all the mobile numbers of our company workers. When we call to those numbers, we will keep the original outgoing DDI assigned to the user, and for the rest of the cases we will force the DDI to the main company outgoing DDI.
es: Para este ejemplo, crearemos una lista de los números móviles corporativos con todos los números de los trabajadores de la compañía. Cuando llamemos a esos números, mantendremos el DDI de salida original asignado al usuario, y para el resto de casos, forzaremos el DDI al principal de la compañía.

source: Create a new Outgoing DDI Rule
es: Crear una nueva Regla DDI de salida

source: The main creation screen defines the action that will take place when no rule matches the dialed destination, so we define to force the main company DDI here.
es: La pantalla principal de creación define la acción que se realizará cuando el destino no coincida con ninguna de las reglas, así que definiremos aquí la acción de forzar el DDI principal de la compañía.

source: Assign rule lists actions
es: Asignar acciones a las reglas

source: Now we add a new rule that will match our mobiles to make the user's outgoing DDI be kept uptouched.
es: Ahora añadiremos una nueva regla que coincidirá con nuestros móviles para mantener el DDI saliente del usuario sin tocar.

source: Assign rule to callers
es: Asignar reglas a los llamantes

source: At last, we have to configure who will use this rule to dynamically change it's presentation number. We can do this in the **Company's edit screen** or the **Users's edit screen**.
es: Como último paso, tendremos que configurar quien emplea esta regla para cambiar dinámicamente su número presentado. Esto puede realizarse en la **pantalla de edición de Compañía** o en la **pantalla de edición de Usuario**.

source: In this case, the User will present 777777777 DDI when calling Coporative mobiles and 666666666 when calling the rest of the external numbers.
es: En este caso, el usuario presentará el DDI 777777777 cuando llame a los móviles corporativos y 666666666 cuando llame al resto de números externos.

source: Current implementation of Outgoing DDI rules won't work for diverted calls (out of schedule, holidays or user's call forward settings).
es: La implementación actual de Reglas DDI de salida no funciona para llamadas desviadas (fuera de horario, festivo o desvíos de usuario).

source: Queues
es: Colas
