Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/company.po
Languages: es

source: Calendars
es: Calendarios

source: Calenders are used to define what days are considered as holiday. Like schedules, multiples calendars can be combined.
es: Los calendarios definen, una vez sumados, los días que se tienen que considerar festivos.

source: Let's imagine three calendars with the following configuration:
es: Imaginemos que creamos 3 calendarios tal que:

source: Calendar creation process only requires a name. Once created, we can add what days will be holidays using the buttons in its row:
es: La creación de calendarios solo requiere dar un nombre al mismo, una vez creado hay que añadir días festivos a dicho calendario pulsando el botón de la derecha del lápiz:

source: From this moment on, the calendar has the 1st of January of 2016 as holiday date with the locution "Happy New Year".
es: Desde este momento, ese calendario tiene marcado el día 1 de Enero de 2016 como día festivo con locución de festivo especial llamada "Feliz año".

source: Calendars logic is opposite to Schedulers: If a day is not defined as holiday in any of the calendars, it will considered a normal day and no filtering will be applied.
es: Los calendarios tienen una lógica contraria a los horarios: si un día concreto no está definido como festivo en uno de los calendarios, será considerado como día laborable.

source: Holidays without special locutions will apply the external call filter holiday generic locution (see below).
es: Si un día es festivo en un calendario y no hay locución de festivo especial, se reproducirá la locución de festivo del filtro de entrada externo (ver más abajo).

source: Create a new External call filter
es: Crear un filtro de entrada externo

source: Call pickup
es: Capturas de llamada

source: Call pickup is the process where a user can answer a call that is being ringing in another terminal. No need to say that, somehow (sound, flashing lights, notification, etc) the users must know that the call is ringing elsewhere.
es: Se entiende por captura de llamada **la acción de un usuario que escucha** (o se entera de otro modo, vía panel de supervisión, etc.) **que una extensión está sonando y, desde su terminal, roba dicha llamada**.

source: IvozProvider supports two kind of call pickups:
es: IvozProvider soporta dos tipos de captura de llamadas:

source: Direct pickup
es: Captura de llamadas directa

source: In this type of pickup, the user that is trying to capture the ringing call must include the extension of the target phone after the service code. For example, if the direct pickup code is \*95, the user must dial \*95101 to capture a call that is ringing in the extension 101.
es: En las capturas de llamadas directas el usuario indica un código que incluye la extensión del teléfono cuya llamada quiere *robar*. Si el código fuera \*95, por ejemplo, marcaría \*95101 para capturar una llamada que esté sonando en la extensión 101.

source: Group pickup
es: Captura de grupo

source: In this type of pickup, the user that is trying to capture the ringing call will just dial the service code. If anyone in any of the pickup groups of the user has a ringing call, it will be answered by the capturer.
es: En las capturas de llamadas indirectas, en cambio, el usuario indica un código y el sistema busca qué teléfono está sonando dentro de sus grupos de captura.

source: Call pickup groups
es: Captura de llamadas indirecta

source: In order to make **call group pickups**, the capturer user must be part of the same group that the target user that wants to capture.
es: Para poder realizar **capturas de llamada indirectas**, el usuario que captura tiene que pertener al mismo grupo de captura que el usuario al que pretende capturar.

source: The section **Pickup groups** allows the company administrator to configure what users will be in each group:
es: La sección **Grupos de captura de llamada** nos permite crear estos grupos y decir qué usuarios pertenecen a ellos:

source: As shown in the section :ref:`users`, we can add or edit the groups of a user in the user's edit screen.
es: Como vimos en la sección de :ref:`users`, también se puede editar un usuario para editar los grupos de captura a los que pertenece.

source: A user can be part of multiple pickup groups. The system will take all of them into account when using the group pickup service.
es: Un usuario puede pertenecer a más de un grupo de captura, el sistema tendrá en cuenta todos sus grupos.

source: Group pickup service code
es: Código de captura de llamada

source: IvozProvider supports 2 different configuration levels for defining the service codes for pickup:
es: IvozProvider permite definir los códigos de captura a 2 niveles:

source: At company level: **Company configuration** > **Services**.
es: A nivel de empresa en **Configuración de Empresa** > **Servicios**.

source: The brand administrator can configure generic codes that all the companies will use. Companies can customize this codes if they are used to another ones.
es: Esto permite que el administrador de marca pueda definir unos códigos genéricos para todas sus empresas y que, las empresas que deseen utilizar otros códigos, puedan redefinirlos.

source: The :ref:`following section <services>` explains the services in depth, with all the additional services that can be accessed by dialing codes starting with \*.
es: :ref:`La siguiente sección <services>` explica todo lo relativo a servicios, que engloba los códigos de captura y otros servicios adicionales a los que se accede marcando códigos que comienzan por \*.

source: Call ACL Control
es: Control ACL para llamadas

source: The **Call ACLs** determines what users can call to external numbers.
es: Los **Permisos de llamada** determinan qué usuarios pueden llamar a qué destinos internos.

source: The internal extensions are allowed to all users, the **Call ACLs only apply to external numbers**
es: Las extensiones internas son accesibles por todos los usuarios, **los permisos de llamada solo aplican a llamadas externas**.

source: The **Call ACL** setup has two different parts:
es: La configuración de **permisos de llamada** tiene 2 partes:

source: Classify the call in different types based on **match lists**:
es: Clasificar las llamadas en determinados tipos utilizando **listas de coincidencia**:

source: Brand level: **Brand Configuration** > **Match Lists**
es: A nivel de marca en **Configuración de Marca** > **Listas de coincidencia**.

source: Company level: **Company Configuration** > **Match Lists**
es: A nivel de empresa en **Configuración de Empresa** > **Listas de coincidencia**.

source: Choose policies for groups of patterns: **Company Configuration** > **Call ACLs**
es: Definir políticas para los patrones deseados: **Configuración de Empresa** > **Permisos llamada**

source: Call ACL Matchlits
es: Listas de coincidencia para ACLs

source: The destination number is matched against the **ACL MatchLits** to determine the call permission.
es: El destino de la llamadas es comprobado contra la **Lista de coincidencia** para determinar los permisos de la llamada.

source: Brand matchlists can be used by any of its companies, so most common ACL Patterns (p.e. country prefixes) can be reused easily.
es: Las listas de coincidencia de marca pueden ser empleadas por sus compañías, de tal manera que los patrones más genéricos (por ej. prefijos de paises) puede ser facilmente reutilizables.

source: For more information of how MatchLists patterns are created, please refer to section :ref:`match_lists`.
es: Para más información sobre como se crean patrones de listas de coincidencia, ver sección :ref:`match_lists`.

source: **Regular expressions of Match List patterns must be in E.164 format**.
es: **Las expresiones regulares de las listas de coincidencia tienen que estar en formato E.164**

source: Call ACL
es: Permisos de llamada

source: The **Call ACL** configuration is easier to explain with an example:
es: La definición de un **Permiso de llamada** utiliza una lógica más fácil de describir con un ejemplo.

source: Imagine the following **match list** with this patterns:
es: Imaginemos que tenemos los siguientes patrones en una **lista de coincidencia**:

source: We could create a **Call ACL** that only allow calling to this destinations:
es: Podríamos definir un **Permiso de llamada** como el que sigue:

source: The default policy determines what to do with the call when the destination number **does not match any ACL matchlists**.
es: La acción por defecto describe lo que hay que hacer con la llamada una vez que se han evaluado todas las reglas (permitir/rechazar).

source: After creating the **Call ACL** we can edit it to add the required rules:
es: Editamos el **permiso de llamada** que acabamos de crear para añadir las reglas necesarias:

source: The **metric** determines the evaluation order of the rules and the action that will be applied if it *matches* the list (allow/deny).
es: La **métrica** determina el orden de evaluación de las reglas y la acción lo que

source: Once we have added our spanish **Match List**, our **Call ACL** will look like this:
es: Una vez añadida nuestra **lista de coincidencia** española, nuestro **permiso de llamadas** quedará como sigue:

source: We only have to assign this ACL to the users in the section **Company configuration** > **Users**:
es: Ya solo faltaría añadírselo a un usuario concreto en la sección **Configuración de empresa** > **Usuarios**:

source: From this moment on, Alice will only be allowed to call internal extensions (they are always allowed) and spanish numbers.
es: Desde este momento, Alice solo podría llamar a extensiones internas (siempre están permitidas) y a móviles y fijos nacionales.

source: Call recording
es: Grabación de llamadas

source: Beware that local legislation may enforce to announce that the call is being recorded (sometimes to both parties). You should include a recording disclaimer in your welcome locutions for DDIs with automatic recording enabled.
es: Tenga en cuenta que la legislación local le puede requerir que anuncie que la llamada esta siendo grabada (en ocasiones a ambos participantes). Debería incluir un aviso en las locuciones de bienvenida para los DDI que tengan grabación automática habilitada.

source: IvozProvider supports two different ways of recording calls:
es: IvozProvider permite grabar las llamadas que se cursan en 2 modalidades distintas:

source: **Automatic recordings** for the incoming/outgoing calls that use a :ref:`External DDI <ddis>`.
es: **Grabación automática** para llamadas desde/hacia cierto :ref:`DDI externo <ddis>`.

source: **On demand recordings** requested by a user during a call.
es: **Grabación bajo demanda** solicitada por un usuario en medio de una conversación.

source: Automatic DDI recordings
es: Grabación automática por DDI

source: In this type of recording, **the whole conversation will be recorded**: from the start until it finishes.
es: En el caso de grabaciones automáticas por DDI, **se graba toda la conversación**: desde el principio hasta el final.

source: Two different scenarios:
es: Se distinguen 2 casos:

source: **Incoming calls to a DDI**: The call will continue until the external dialer hangups (no matter whom is talking to).
es: **Llamadas entrantes a un DDI**: la grabación seguirá mientras la parte externa de la llamada permanezca en la conversación.

source: **Outgoing calls using a DDI** as :ref:`Outgoing DDI <ddis>`: the recording will continue as long as the external destination keeps in the conversation.
es: **Llamadas salientes utilizando un DDI** como :ref:`DDI saliente <ddis>`: mientras el interlocutor externo permanezca en la conversación, la grabación sigue.

source: Take into account that the call will be recorded while the external entity is present, even it the call is being transfered between multiple users of the platform.
es: El hecho de que **mientras el interlocutor permanezca en llamada la grabación continúe**, hace que no importe cuántes veces se transfiera la llamada de un usuario a otro, la grabación contendrá toda la conversación (desde el punto de vista del participante externo).

source: Record all the calls of a DDI
es: Grabar todas las llamadas de un DDI

source: To enable this feature, edit the DDI and configure the field under the section recording data:
es: Basta con editar el DDI en cuestión y habilitar las grabaciones:

source: There are 4 available options:
es: Existen 4 opciones:

source: Disable recordings
es: Desactivar la grabación

source: Enable incoming recordings
es: Activarla para llamadas entrantes a dicho DDI

source: Enable outgoing recordings
es: Activarla para llamadas salientes que presente dicho DDI

source: Enable all call recordings
es: Activarla para ambas

source: On demand recordings
es: Grabación bajo demanda

source: The *on-demand* recordings must be enabled by the *brand administator* for the companies that request it. This can be done in the companey edit screen:
es: La grabación bajo demanda u *on-demand* la tiene que activar el *operador de marca* para las empresas que la necesiten, sin más que editar su empresa y configurar el código deseado:

source: Contrary to the :ref:`Services <services>` mentioned in the previous section, the on demand record are actived within a conversation.
es: A diferencia de los :ref:`Servicios <services>` comentado en la sección anterior, la funcionalidad de grabación bajo demanda se activa en mitad de una conversación.

source: Contrary to automatic ones, on demand recording can be stoped using the same process that started them.
es: Al contrario que las grabaciones automáticas, las realizadas bajo demanda pueden detenerse empleando el mismo proceso que las ha iniciado.

source: Activated using the *Record* key
es: Activación por medio de tecla *Record*

source: Some terminals (for example, *Yealink*) support sending a `SIP INFO <https://tools.ietf.org/html/rfc6086>`_ message during the conversation with a special *Record* header (see `reference <http://www.yealink.com/Upload/document/UsingCallRecordingFeatureonYealinkPhones/UsingCallRecordingFeatureonYealinkSIPT2XPphonesRev_610-20561729764.pdf>`_). This is not a standard for the protocol, but being Yealink one of the supported manufacturers of the solution, we include this kind of on-demand recording.
es: Los terminales *Yealink* soportan el envío de mensajes `SIP INFO <https://tools.ietf.org/html/rfc6086>`_ con una cabecera *Record* (ver `referencia <http://www.yealink.com/Upload/document/UsingCallRecordingFeatureonYealinkPhones/UsingCallRecordingFeatureonYealinkSIPT2XPphonesRev_610-20561729764.pdf>`_). No es un estándar, pero al ser *Yealink* uno de los modelos soportados, IvozProvider incluye soporte para la activación de grabación bajo demanda de esta forma.

source: For this recording requests, the configured code doesn't matter but the company still must have on demand records enabled.
es: El código seleccionado no influye en este caso, pero **la empresa sí que tiene que tener las grabaciones bajo demanda activadas**.

source: To start or stop this kind of recordings, just press the Record key in the terminal and the system will handle the sent message.
es: La activación de las grabaciones es muy simple en este caso, basta con pulsar la tecla y el sistema inicia la grabación.

source: Activated using *DTMF* codes
es: Activación por códigos *DTMF*

source: The more traditional approach for this feature is to press a combination of keys during the call. Some notification will be played and the recording will start or stop. This combination is sent to the system using `DTMF tones <https://es.wikipedia.org/wiki/Marcaci%C3%B3n_por_tonos>`_ using the same audio stream that the conversation (as mentioned in `RFC 4733 <https://tools.ietf.org/html/rfc4733>`_).
es: Comúnmente este tipo de funcionalidades se activan introduciendo una combinación de teclas durante la llamada. Se inicia el proceso después de algún tipo de notificación. Esta combinación es enviada empleando `tonos DTMF <https://es.wikipedia.org/wiki/Marcaci%C3%B3n_por_tonos>`_ empleando el mismo flujo de audio que la conversación (como se menciona en el `RFC 4733 <https://tools.ietf.org/html/rfc4733>`_).

source: IvozProvider supports this kind of on demand record activation but with an important downside. In order to capture this codes, the pbx must process each audio packet to detect the code, avoiding the direct flow of media between the final endpoints.
es: IvozProvider soporta este tipo de activaciones bajo demanda pero con una importante pega. Para poder capturar estos códigos, la pbx debe procesar los paquetes de audio de la conversación, evitando así la posible liberación del flujo entre los agentes finales.

source: Enabling this record mode highly affects the performance of the platform. Use at your own risk.
es: Habilitar este modo afecta en gran medida el rendimiento de la plataforma. Úselo bajo su propio riesgo.

source: Activated using a frustated blind transfer
es: Activación por medio de transferencia ciega frustrada

source: There is a tricky way to access this feature for terminals that does not support the INFO message and don't want its audio to be parsed:
es: Existe otra forma de acceder a esta funcionalidad para los terminales que no tengan soporte para el método anterior.

source: This method is a workaround for those terminals that does not support the native *Record* key activation (recommended). Take into account that not all terminals will behave the same way while performing the transfer described in this section.
es: Este método de acceder a la funcionalidad es una forma imaginativa de hacerla accesible para terminales sin soporte nativo de tecla *Record* que es el método recomendado). En función del terminal en cuestión y de la configuración del mismo, resultará más o menos cómodo utilizar la funcionalidad (tecla rápida de transferencia ciega, no retener al interlocutor, etc.).

source: The keys for this methods are:
es: Los pasos a seguir en este método alternativo e imaginativo son los siguientes:

source: It's not activated using a code during the conversation.
es: No se activa marcando el código en medio de la conversación.

source: It's activated making a **blind transfer** to the on demand record code.
es: Se activa iniciando una transferencia ciega al código configurado.

source: The system will understand this as a request to record and will reject the transfer.
es: El sistema rechazará la transferencia e iniciará la grabación.

source: The user will continue with the existing call and keep talking.
es: El usuario podrá volver a la conversación que tenía (si es que su terminal no ha vuelto solo) y seguir hablando.

source: Why this method does even exist?
es: ¿Por qué esta forma tan *peculiar* de activar la grabación y no por medio de tonos normales?

source: The reason behind this tricky method is based, as explained in the previous block, on the design of the :ref:`architecture` and the :ref:`RTP audio flow <audioflow>`.
es: El motivo de activar la grabación por medio de una transferencia ciega frustrada se debe a la :ref:`architecture` y, más concretamente, al :ref:`flujo de audio RTP <audioflow>`.

source: Recordings list
es: Listado de grabaciones

source: The *company administrator* can access to all the recordings in the section **Company configuration** > **Recordings**:
es: El *administrador de empresa* puede acceder a las grabaciones realizadas por medio de la sección **Configuración de Empresa** > **Grabaciones**:

source: Recordings can be heard from the *web* or downloaded in MP3 format:
es: Haciendo clic en una de ellas, podría escucharla desde la *web* o descargársela en formato MP3:

source: If the recording has been started on demand, it will also include the user that requested it:
es: En el caso de una grabación bajo demanda, se indica qué usuario la inició:

source: Call Registry
es: Registro de llamadas

source: Lists all the calls of the client:
es: Lista todas las llamadas de un cliente:

source: `CSV <https://es.wikipedia.org/wiki/CSV>`_ export makes possible to download the list for its later analysis.
es: La exportación en `CSV <https://es.wikipedia.org/wiki/CSV>`_ permite descargar el listado para un análisis posterior.

source: Conditional routes
es: Rutas condicionales

source: Conditional routes allows changing a call logic depending on:
es: Las rutas condicionales permiten alterar la lógica de llamadas bajo los siguientes criterios:

source: Who is calling.
es: Quién está llamando.

source: What time is calling.
es: A qué hora está llamando.

source: What day is calling.
es: Qué día está llamando.

source: These routes are electable in three sections:
es: Las rutas condicionales se pueden elegir en tres secciones:

source: Extensions
es: Extensiones

source: IVR custom options
es: Opciones de IVR a medida

source: Remaining sections could use conditional routes creating an extension that point to a conditional route first, and routing to this extension.
es: El resto de secciones pueden utilizar rutas condicionales por medio de una extensión que apunte a una ruta condicional.

source: Creating a conditional route
es: Crear un ruta condicional

source: First of all we create a conditional route in **Conditional routes** section:
es: El primer paso es crear una ruta condicioal en **Rutas condicionales**:

source: On creation we define what should be done with a call that does not satisfy any of the rules described below.
es: En la creación definimos cuál será el comportamiento por defecto en caso de que ninguna regla aplique.

source: Adding rules
es: Añadir reglas

source: Once created, we need to add rules, for example:
es: Una vez creada, necesitamos añadir reglas, por ejemplo:

source: Calls from Japan and Germany received in the morning to an specific user
es: Llamadas desde Japón y Alemania recibidas por la mañana, a un usuario concreto

source: Calls from Japan and Germany received in the afternoon to another user
es: Llamadas desde Japón y Alemania recibidas por la tarde, a otro usuario

source: Override the reception IVR for summer days
es: Utilizar un IVR distinto para los días de verano

source: With this example rules, our example conditional route will look like this:
es: Con estas reglas de ejemplo, nuestra ruta condicional tendrá este aspecto

source: Some notes about this example:
es: Notas sobre este ejemplo

source: Rules are evaluated following the metric parameter. Once a rule matches, its logic is applied.
es: Las reglas se aplican en orden de métrica, de menor a mayor. Una vez que una regla se cumple, se aplica su lógica.

source: Rules may have from 1 to 3 criteria:
es: Las reglas pueden tener desde 1 hasta 3 criterios:

source: None, one or more matchlist (pre-created, see :ref:`match_lists`)
es: Ninguno, uno o más listas de coincidencia (pre-creadas, ver :ref:`match_lists`)

source: None, one or more schedules (pre-created, see :ref:`schedules`)
es: Ninguno, uno o más listas de horarios (pre-creadas, ver :ref:`Horarios`)

source: None, one or more calendar (pre-created, see :ref:`calendars`)
es: Ninguno, uno o más listas de calendarios (pre-creadas, ver :ref:`Calendarios`)

source: These 3 criteria are combined (applying an AND logic).
es: Estos 3 criterios se combinan (con una lógica AND).

source: Using a conditional route
es: Utilizar una ruta condicional

source: The behaviour when an IVR option or an extension is routed to a conditional route is easy to understand, but using conditional routes with DDIs need an additional explanation.
es: El comportamiento cuando la opción de un IVR o una extensión se enruta a una ruta condicional es fácil de entender, pero su utilización con DDIs merece una explicación adicional.

source: Imagine this scenario:
es: Imagina este escenario:
