Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/getting_started.po
Languages: es

source: Basically, that **everything in the menu 'Brand configuration' will be relative to the chosen brand** and is **exactly** the same menu entries that the brand operator will see using its brand portal.
es: Que **todo lo que se ve en el bloque 'Configuración de marca' es relativo a esa marca** y es *exactamente* lo mismo que lo que ve el operador de marca cuando entra con sus credenciales de acceso.

source: Ok, ok. maybe exactly is not totally accurate. The global operator is able to see some fields in some screens that other admins cann't (i.e. On Company edit screen, fields like 'Media relays' or 'Application server' are only configurable by the global operator.
es: Decir exactamente es mucho decir, ya que el operador global ve campos en ciertas secciones del bloque **Configuración de marca** que el operador de marca no ve. por ej. Al editar una empresa *God* ve 'Servidores de media' y'AS', que el operador de marca no ve.

source: Making internal calls
es: Realizar llamadas internas

source: The goal of this block will be to configure IvozProvider in order to make internal calls, using as the starting point the base installation described in the previous step.
es: El objetivo de este bloque será configurar IvozProvider para realizar llamadas internas, partiendo de la instalación base descrita en la sección anterior.

source: In order to archive a call between Alice and Bob, we have to do some task in the three configuration levels described in :ref:`operation_roles`, and that is why we have ordered the index in this blocks:
es: Para conseguir que Alice llame a Bob, tendremos que realizar labores de 3 niveles descritos en :ref:`operation_roles`, de ahí la organización del siguiente índice en esos 3 bloques:
