Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/getting_started.po
Languages: es

source: Once we have an agreement with a VoIP provider and we have configured it in the *peering* section, only two task are pending:
es: Una vez que hemos llegado a un acuerdo con un Operador VoIP y hemos configuradoesta relación de *peering*, solo faltan dos tareas:

source: Configuring an external DDI
es: Dar de alta un DDI externo

source: The brand operator, responsible of this *peering* agreements with VoIP providers , has the task to create the DDIs for each provider.
es: El operador de marca, como único responsable de llegar a acuerdos de *peering* con operadores IP, es el responsable de dar de alta los DDIs de cada operador.

source: Notice that in order to access this section, the brand operator (or *god*) must have emulated the proper company and access the menu section **Company Configuration**.
es: Observar que para poder acceder a esta sección el operador de marca (o *god*) tiene que haber emulado una empresa concreta y acceder desde el bloque **Configuración de empresa**.

source: Section **Company configuration > DDIs** is different when the company administrator access than the displayed data when a global or brand administrator does. Company administrator are unable to create or delete DDIs, just edit the one created by the brand or god administrator.
es: La sección **Configuración de empresa > DDIs** es distinta cuando accede un administrador de empresa que cuando accede un operador global o de marca. El administrador de empresa no puede crear nuevos DDIs ni borrar los que ya existen, solo puede editar los que el operador de marca haya creado.

source: The section **Brand configuration > DDIs** is a *read-only* display of all the DDIs of the brand, associated with the different companies.
es: Por otra parte, la sección **Configuración de marca > DDIs** solo sirve para que el operador de marca pueda ver los DDIs asociados a sus distintas empresas, es un listado en *read-only*.

source: Taking into account this concepts, we create a new DDI and fill the required fields:
es: Una vez explicados estos conceptos, añadimos un nuevo DDI y rellenamos los campos necesarios:

source: For detailed information about configuration fields, check :ref:`DDIs` section.
es: Para más información sobre los campos de configuración, ver la sección :ref:`DDIs`

source: Configure incoming routes
es: Configurar tratamiento en entrada

source: In the previous section, we have created the DDI and configure it, but **the most common procedure** is that the brand operator just create it while the **company administator**, using the same saction **will configure** it choosing the correct route (user, huntgroup, etc.), its filters with calendars and so on.
es: En la sección anterior hemos dado de alta el DDI y lo hemos configurado, pero conviene tener claro que **en un uso normal, el administrador de marca** simplemente **daría de alta el DDI y el administrador de empresa**, accediendo a la misma sección, **lo configuraría** apuntándolo al usuario / grupo de salto / etc. adecuado, configurando horarios, calendarios, etc.

source: At this point, calling the number of the configured DDI will make the *Alice* phone ring.
es: En este punto, marcando el número público debería de sonar el teléfono de *Alice* consiguiendo, por tanto, el objetivo de este bloque :)

source: Receive external calls
es: Recibir llamadas externas

source: The goal of this block will be configure IvozProvider to receive incoming external calls.
es: El objetivo de este bloque será configurar IvozProvider para recibir llamadas externas.

source: In order tho archive this, this steps will be followed:
es: Para ello, seguiremos los siguientes pasos:

source: Peering configuartion
es: Configuración de peering

source: We understand a **Peering contract** the agreeming between a **Brand Operator** and a VoIP Provider to make and receive calls.
es: En IvozProvider se entiende por **Contrato de Peering** el acuerdo entre un **Operador de Marca** y un Operador VoIP para sacar y recibir llamadas.

source: IvozProvider is ready to integrate with IP providers created on the secteion **Perring contracts**:
es: IvozProvider permite integrarse con Operadores IP por medio de la sección **Contratos de Peering** que pasamos a describir:

source: Transformations configuration
es: Configuración de transformaciones

source: **IvozProvider** is designed to provide service **anywhere in the planet**, not only the original country where the platform is installed.
es: **IvozProvider** está diseñado con la intención de **poder dar servicio en cualquier lugar del planeta**, no solamente en el país originario de la solución.

source: A very important contept to archive this goal is the numeric transformation, that **adapts the different number format systems of the countries of the world** defined in `E.164 <https://www.itu.int/rec/T-REC-E.164/es>`_ **to a neutral format**.
es: Un concepto muy importante para conseguir este objetivo es el de las transformaciones númericas, que consisten en la **adaptación de los distintos sistemas de numeración de los países del mundo** definidos en `E.164 <https://www.itu.int/rec/T-REC-E.164/es>`_ **a un formato neutro**.

source: The section that allows the brand operator to configure all the **numeric transformations** is:
es: La sección que le permite configurar al operador de marca todo lo relativo a **Transformaciones numéricas** es:

source: You can find more information about transformations in :ref:`Numeric transformations` section.
es: Para más información sobre transformaciones ver sección :ref:`Transformaciones numéricas`.

source: Outgoing Routing configuration
es: Configuración Rutas salientes

source: We already have our test call categorized as a call within the **Target pattern** 'Spain'. In addition, we also have a **Target pattern group** including 'Spain', called 'Europe'.
es: Ya tenemos nuestra llamada de pruebas categorizada dentro del **Patrón de destino** 'España'. Es más, también tenemos un **Grupo de patrones de destino** que incluye 'España', 'Europa'.

source: Now we have to tell IvozProvider that calls to 'Spain' or 'Europe' should be established through our **Contract Peering**.
es: Ahora solo nos falta decir a IvozProvider que las llamadas de 'España' o de 'Europa' salgan por nuestro **Contrato de peering**.

source: To make this assignment, we use the section **Outgoing routing**:
es: Para realizar esta vinculación, accedemos a la sección **Rutas salientes**:

source: If we choose routing 'Spain' calls only through our *Peering contract*, we will make this configuration:
es: Si optamos por enrutar solamente las llamadas de España por nuestro Contrato de *peering*, tendremos que realizar la siguiente configuración:

source: On the other hand, if we are more generous and we decide to place calls to all european countries, we would make this configuration:
es: Por el contrario, si somos más generosos y decidimos permitir todas las llamadas a países europeos, la configuración a aplicar sería la siguiente:

source: For more information about routing and load balancing check :ref:`Outgoing Routing` section:
es: Para más información sobre enrutado y balanceo de carga vea la sección :ref:`Enrutado saliente`:

source: Creating a destination rate
es: Crear un precio destino

source: Destination rates section is empty by default, as opposed to target patterns section, that has all the 254 countries of the world. The reason is that one destination rate will usually imply lots of pattern per country (GSM networks, especial numbers, mobile numbers, fixed lines, etc.).
es: A diferencia de los patrones de destino, que vienen precreados con los países del mundo, los patrones de precio no se crean ya que lo habitual es que un país se divida en muchos patrones de precio (redes GSM de un operador, numeraciones especiales, números fijos, números móviles, etc.).

source: In most of the cases, this section data will be imported from CSV provided by your Peering Contracts, but for our test we will create it manually. Check section :ref:`Destination rates` for more information.
es: En la mayoríad e los casos, los datos de esta sección serán importado desde un CSV facilitado por los Contratos de Peering, pero para nuesto ejemplo lo crearemos manualmente. Vea la sección :ref:`Precios destino` para más información.

source: Create a **destination rate**:
es: Creamos un **precio destino**:

source: And we add a price for a given prefix in E.164 (with + sign)
es: Y añadimos un precio con el prefijo en E.164 (con signo +)

source: Floating number must use the "." as decimal separator (e.g. 0.02)
es: Los números decimales se tienen que introducir utilizando el "." como separador decimal (e.g. 0.02)

source: Outgoing configuration complete!
es: ¡Configuración saliente completada!

source: That's it!
es: ¡Listo!

source: At this point, *Alice* should be able to make outgoing calls to spanish destinations and this calls should be billed accordingly.
es: En este punto, *Alice* debería de ser capaz de realizar llamadas nacionales externas, que se tendrían que cursar y tarificar con normalidad.

source: Making external calls
es: Realizar llamadas externas

source: The goal of this section is configuring IvozProvider to make external outgoing calls, taking previous section configuration as a starting point.
es: El objetivo de este bloque será configurar IvozProvider para realizar llamadas externas salientes, partiendo de la configuración realizada hasta este momento.

source: We will follow this steps:
es: Para ello, seguiremos los siguientes pasos:

source: At this point, we are looking forward to make our first outgoing call with our new IvozProvider, we may have even tried to call with current configuration but...
es: Llegados a este punto y estando deseosos como estamos de hacer nuestra primera llamada, habremos intentando llamar con la configuración actual pero...

source: No pricing plan, no call
es: Sin plan de precio, no hay llamada

source: Just the way we warned :ref:`when we described the duties of the brand operator <brand_responsibilities>`, the brand operator is **responsible for making all the needed setup so that IvozProvider is able to bill all external calls**.
es: Tal y como advertimos :ref:`cuando describimos las funciones del operador de marca <brand_responsibilities>`, el operador de marca era el **responsable de realizar la configuración necesaria para que todas las llamadas externas se puedan tarificar**.

source: **Billing a call** is the action of **assigning price** to a call that implies cost.
es: Se entiende por **tarificar** la **acción de poner precio** a una llamada que implique coste.

source: **IvozProvider checks live that a call can be billed when it is established** to avoid placing calls that imply cost but won't be billed because Brand Operator, due to a mistake, hasn't assigned a price.
es: Para evitar que por un descuido el operador de marca no defina el precio para un tipo de llamada y llamadas que implican coste salgan a precio 0, **en el momento del establecimiento de una llamada se comprueba que la llamada se va a poder tarificar**.

source: If a call can't be billed, IvozProvider won't allow its establishment.
es: Si una llamada no se va a poder tarificar, IvozProvider no permitirá su establecimiento.

source: Outgoing DDI configuration
es: Configurar DDI saliente

source: Before placing our first outgoing call, it would be desirable to choose the number that the callee will see when the phone rings, so that he can return the call easily.
es: Antes de realizar la llamada externa, estaría muy bien que dicha llamada se presentara con el DDI que ya hemos configurado en entrada, así el llamado podría devolvernos la llamada cómodamente.

source: To achieve this goal, we have to configure our DDI as *Alice's* **outbound DDI**, because she will be the chosen one to place our first outgoing call:
es: Para ello, basta con configurar dicho DDI como **DDI saliente** de *Alice*, que será la elegida para realizar la primera llamada saliente de nuestro recién instalado IvozProvider:

source: We can set this up editing *Alice* in **Company Configuration** > **Users**. If this change is made by brand operator or global operator, he must :ref:`emulate the corresponding company <emulate_company>` previously.
es: Esta configuración se realiza desde **Configuración de empresa** > **Usuarios**, editando el usuario de *Alice*. Si el operador de marca o el operador global el que realiza esta edición, tendrá que haber :ref:`emulado la empresa <emulate_company>` previamente.

source: Calls from users without an outgoing DDI will be rejected by IvozProvider.
es: Sin configurar un DDI saliente para el usuario que realiza la llamada, ésta no saldrá al exterior.

source: Where do I call?
es: ¿A dónde llamo?

source: At this point of the configuration, we have to configure IvozProvider to use the already configured *Contract Peering* to place the external calls we are making.
es: En este punto de la configuración, tenemos que configurar IvozProvider para que las llamadas a los destinos externos que vayamos a probar salgan por el Contrato de *peering* que hemos configurado en el bloque anterior.

source: To achieve this, in first place, we need that the dialed external numbers fall in an existing **target pattern**.
es: Para ello, en primer lugar, necesitamos que los números externos recaigan en un **patrón de destino** dado de alta con anterioridad.

source: DemoBrand Configuration
es: Configuración DemoBrand

source: We need that the default DemoBrand have a client with at least 2 users. In order to archive this we will require little configuration in this section.
es: Para conseguir que esta DemoBrand tenga un cliente con 2 usuarios que se puedan llamar entre sí, vamos a tener que hacer muy poco en este bloque.

source: In fact, if we check **Virtual PBXs** in the brand menu, we'll discover that there is already an existing *DemoCompany* that we can use to fulfill our desired goal :)
es: De hecho, al acceder a la sección **PBXs virtuales**, vemos que ya existe una compañía *DemoCompany* que podremos utilizar para cumplir nuestro ansiado objetivo :)

source: Only a thing is required to configure for this company, marked as edit in the previous image.
es: Solo le falta una cosa a esta empresa, marcado con **EDIT** en la captura anterior.

source: Company SIP Domain
es: Dominio SIP de la compañía

source: As mentioned in the previous section, is **required** that each of the companies have a public domain that resolves to the configured IP address for :ref:`proxyusers`.
es: Tal y como se introdujo en la sección anterior, es **imprescindible** que cada empresa tenga un dominio público que resuelva a la IP configurada para el :ref:`proxyusers`.

source: DNS register can be type A (supported by all the hardphones/softphones ) or even NAPTR+SRV.
es: El registro DNS puede ser de tipo A (soportado por todos los hardphones/softphones) o del tipo NAPTR+SRV.

source: Once the domain has been configured (by means that are out of scope of this document), it will be enought to write it in our company configuration:
es: Una vez configurado el dominio (por medio de procedimientos que escapan al objetivo de este documento), bastará con escribir el parámetro en el campo adecuado de nuestra empresa:

source: Once the company has been saved, the domain will be also displayed in the list :ref:`previously mentioned <god_sipdomains>`:
es: Una vez guardada la empresa, este dominio aparecerá en la sección descrita :ref:`en la sección anterior <god_sipdomains>`:

source: It's important to understand this block. :ref:`Unless we've a single company registered <dnshack>`, wihout a DNS domain pointing to our users proxy IP address, everything will fail.
es: Es fundamental entender este bloque. :ref:`Salvo que tengamos una única compañía registrada <dnshack>`, sin un registro DNS correctamente configurado apuntando a la IP del Proxy de Usuarios, ¡fracasaremos en nuestro objetivo!

source: This is a good sign for the domain we have configured right now, replacing the 10.10.3.10 with the public address we have used to configure :ref:`proxyusers`.
es: Esta es una buena señal para el dominio que acabamos de configurar, siempre y cuando en lugar de 10.10.3.10 aparezca la IP pública configurada en :ref:`proxyusers`.

source: Have we stressed enough that without a properly configured DNS pointing to the Users proxy IP address nothing will work?
es: ¿Se ha insistido suficiente en que sin un registro DNS correctamente configurado apuntando a la IP del Proxy de Usuarios no funcionará nada?

source: I have no time for a DNS registry
es: No tengo tiempo para crear registros DNS

source: Everything we have said is true: as we create new brands and brands create new companies, each of them will need a DNS registry.
es: Todo lo contado hasta este punto es verídico: a medida que vayamos creando marcas y éstas vayan creando empresas, cada una de ellas necesitará un registro DNS.

source: But the first company of the platform is quite special and can take over the IP address of the proxy to use it as a domain:
es: Pero la primera empresa de la plataforma es especial y puede apoderarse de laIP del Proxy de Usuarios y usarla como si de un DNS se tratara:

source: Although it is not a domain, but being used like it was, it will be displayed in Domain section:
es: A pesar de no ser un dominio, al estar usándose como tal, aparecerá en la sección de **Dominios**:

source: It’s important to understand the this trick is only valid for the first company of the platform ;)
es: Es importante entender que este truco solo es válido para la primera empresa de la plataforma ;)

source: Emulate Demo company
es: Emular la empresa Demo

source: The company emulation process is the same as the brand emulation, with the difference that it filters the block ‘Company Configuration’ instead of ‘Brand Configuration’.
es: El proceso de emulación de empresa es idéntico al de emulación de marca, conla diferencia de que filtra el bloque 'Configuración de Empresa' en lugar delbloque 'Configuración de Marca'.

source: Once the company has been emulated, the top right corner of the portal will show that we are in the right path :)
es: Una vez emulada la empresa, la parte superior derecha de la pantalla mostraráque vamos por el buen camino :)

source: DemoCompany Configuration
es: Configuración DemoCompany

source: We're close to make our fist call in our fresh installed IvozProvider, there are only 6 steps to configure in our DemoCompany virtual pbx.
es: Estamos cerca de hacer nuestra primera llamada en nuestro flamente nuevo IvozProvider, solo queda crear 6 cosas dentro de nuestra pbx virtuals DemoCompany:

source: 2 terminals
es: 2 terminales

source: 2 extensions
es: 2 extensiones

source: 2 users
es: 2 usuarios

source: Creating Terminals
es: Creando Terminales

source: Go to the terminal section and... voilà! We already have 2 terminals created:
es: Vamos a la sección terminales y... voilà! Ya tenemos 2 terminales pre-creados:

source: Creating Extensions
es: Creando Extensiones

source: Then we go to extensions, just to check that we have 2 extensions already created for us:
es: Seguimos por tanto en la sección de extensiones, pero se nos han adelantado y ya tenemos 2 extensiones para nuestro uso:

source: Nothing more to do in this section, let's go the next one!
es: Nada por hacer en esta sección tampoco, ¡vamos a la última!

source: Creating Users
es: Creando usuarios

source: As expected, we also have 2 created users:
es: Como era de esperar, también tenemos 2 usuarios:

source: At this point, we have everthing ready make a call between this two users: Alice and Bob.
es: Llegados a este punto y sin necesidad de tocar nada en este bloque, ya tenemos todo listo para hacer una llamada de Alice a Bob.

source: SIP Terminal configuration
es: Configurar terminales SIP

source: The last thing we need is 2 SIP terminals (hardphones, softphones or even mobile applications) and configure them as follows:
es: Lo único que nos falta es disponer de 2 terminales SIP (hardphone, softphone, Android/IOS APP) y configurarlos como sigue:

source: **User**: alice
es: **Usuario**: alice

source: **Password**: alice
es: **Contraseña**: alice

source: **Domain**: users.democompany.com (or the IP if we are using :ref:`the DNS trick <dnshack>`)
es: **Dominio**: users.democompany.com (o la IP si hemos hecho :ref:`el truco <dnshack>`)

source: **User**: bob
es: **Usuario**: bob

source: **Password**: bob
es: **Contraseña**: bob

source: Sometimes the user and domain is configured in a single option. In this case we should enter alice@users.democompany.com and bob@users.democompany.com (or the IP if we are using :ref:`the DNS trick <dnshack>`)
es: Es posible que el usuario y el dominio se nos pida junto, tendremos que introducir alice@users.democompany.com y bob@users.democompany.com,respectivamente (o con la IP si hemos hecho :ref:`el truco <dnshack>`).

source: After configuring the terminals, Alices should be able to call Bob only by dialing 102 in her terminal.
es: Tras configurar los terminales, Alice debería de poder llamar a Bob sin más quemarcar 102 en su terminal.

source: Global Configuration
es: Configuración Global

source: Any of the 2 Public IP addresses configured during the installation will work to acces the web portal. Default credentials are **admin / changeme**.
es: Cualquiera de las 2 IPs públicas configuradas en la instalación servirá para acceder al panel web. Las credenciales por defecto son **admin / changeme**.

source: In this section will reference global administrator configuration options, avaible in the menu (**Main management**) of the web portal (only visible to God Admins):
es: En esta sección haremos referencia a todo lo relativo al rol operador global, configurable en el bloque **Gestión general** del panel web (solo visible para God):

source: Emulate the Demo brand
es: Emular la marca Demo

source: As mentioned above, the initial installation will have an already created brand called DemoBrand, that will be used for our goal: to have 2 telephones registered that can call each other.
es: Como mencionamos anteriormente, tras la instalación inicial, la plataforma incluye una marca pre-creada llamada DemoBrand, que es la que utilizaremos para el fin que nos ocupa: tener 2 teléfonos registrados y que se puedan llamar entre sí.

source: Before going to the next section, is quite important to understand how the **emulation** works.
es: Antes de pasar a la siguiente sección, es importante entender el concepto de **Emular una marca**:

source: As global operator, you have access to the menu **Main management** only visible to *God* administators.
es: Como operador global, tienes acceso al bloque **Gestión general**, que solo ve *God*.

source: Apart from that menu, you will also have access to the **Brand configuration** and **Company configuration** that will look more or less like this:
es: Aparte de ese bloque, también ves los bloques **Configuración de marca** y **Configuración de empresa** que tienen este aspecto:

source: Check following button
es: Atención especial al siguiente botón:

source: When pressed, a popup will be displayed:
es: Una vez pulsado, muestra una ventana flotante tal que:

source: After selecting the DemoBrand brand, the icon will change and shows the emulted brand:
es: Al seleccionar la marca DemoBrand, el icono cambia y muestra la marca que se está emulando:

source: The upper right corner of the portal will also display the brand that is being emulted:
es: La parte superior derecha de la página también muestra la marca que se está emulando:

source: What emulation means
es: ¿Qué implica esta emulación?
