Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/internal_calls.po
Languages: es

source: Brand Configuration
es: Configuración de Marca

source: We need that the default DemoBrand have a company with at least 2 users. In order to archive this we will require little configuration in this section.
es: Para conseguir que esta DemoBrand tenga una compañía con 2 usuarios que se puedan llamar entre sí, vamos a tener que hacer muy poco en este bloque.

source: In fact, if we check **Companies** in the brand menu, we'll discover that there is already an existing *DemoCompany* that we can use to fulfill our desired goal :)
es: De hecho, al acceder a la sección **Empresas**, vemos que ya existe una compañía *DemoCompany* que podremos utilizar para cumplir nuestro ansiado objetivo :)

source: Only a thing is required to configure for this company, marked as edit in the previous image.
es: Solo le falta una cosa a esta empresa, marcado con **EDIT** en la captura anterior.

source: Company SIP Domain
es: Dominio SIP de la compañía

source: As mentioned in the previous section, is **required** that each of the companies have a public domain that resolves to the configured IP address for :ref:`proxyusers`.
es: Tal y como se introdujo en la sección anterior, es **imprescindible** que cada empresa tenga un dominio público que resuelva a la IP configurada para el :ref:`proxyusers`.

source: DNS register can be type A (supported by all the hardphones/softphones ) or even NAPTR+SRV.
es: El registro DNS puede ser de tipo A (soportado por todos los hardphones/softphones) o del tipo NAPTR+SRV.

source: Once the domain has been configured (by means that are out of scope of this document), it will be enought to write it in our company configuration:
es: Una vez configurado el dominio (por medio de procedimientos que escapan al objetivo de este documento), bastará con escribir el parámetro en el campo adecuado de nuestra empresa:

source: Once the company has been saved, the domain will be also displayed in the list :ref:`previously mentioned <god_sipdomains>`:
es: Una vez guardada la empresa, este dominio aparecerá en la sección descrita :ref:`en la sección anterior <god_sipdomains>`:

source: It's important to understand this block. :ref:`Unless we've a single company registered <dnshack>`, wihout a DNS domain pointing to our users proxy IP address, everything will fail.
es: Es fundamental entender este bloque. :ref:`Salvo que tengamos una única compañía registrada <dnshack>`, sin un registro DNS correctamente configurado apuntando a la IP del Proxy de Usuarios, ¡fracasaremos en nuestro objetivo!

source: This is a good sign for the domain we have configured right now, replacing the 10.10.3.10 with the public address we have used to configure :ref:`proxyusers`.
es: Esta es una buena señal para el dominio que acabamos de configurar, siempre y cuando en lugar de 10.10.3.10 aparezca la IP pública configurada en :ref:`proxyusers`.

source: Have we stressed enough that without a properly configured DNS pointing to the Users proxy IP address nothing will work?
es: ¿Se ha insistido suficiente en que sin un registro DNS correctamente configurado apuntando a la IP del Proxy de Usuarios no funcionará nada?

source: I have no time for a DNS registry
es: No tengo tiempo para crear registros DNS

source: Everything we have said is true: as we create new brands and brands create new companies, each of them will need a DNS registry.
es: Todo lo contado hasta este punto es verídico: a medida que vayamos creando marcas y éstas vayan creando empresas, cada una de ellas necesitará un registro DNS.

source: But the first company of the platform is quite special and can take over the IP address of the proxy to use it as a domain:
es: Pero la primera empresa de la plataforma es especial y puede apoderarse de laIP del Proxy de Usuarios y usarla como si de un DNS se tratara:

source: Although it is not a domain, but being used like it was, it will be displayed in Domain section:
es: A pesar de no ser un dominio, al estar usándose como tal, aparecerá en la sección de **Dominios**:

source: It’s important to understand the this trick is only valid for the first company of the platform ;)
es: Es importante entender que este truco solo es válido para la primera empresa de la plataforma ;)

source: Remaining parameters
es: Parámetros restantes

source: These are remaining relevant parameters configured in Companies section:
es: Estos son los parámetros relevantes configurados en la sección Compañía:

source: Name
es: Nombre

source: Sets the name for this company.
es: Configura el nombre de la compañía.

source: Number used in this company's invoices.
es: Número empleado en las facturas de la compañía.

source: Invoice data
es: Datos de facturación

source: Data included in invoices created by this brand.
es: Información incluida en las facturas creadas por esta marca.

source: Outbound prefix
es: Prefijo de salida.

source: Some companies are used to dial an aditional prefix for outgoing calls.
es: Algunas compañías emplean un prefijo adicional para las llamadas salientes.

source: Outgoing DDI
es: DDI saliente

source: Introduced in 1.3, this setting selects a DDI for outgoing calls of this company, if it is no overridden in a lower level (e.g. user level)
es: Introducido en 1.3, esta opción permite elegir el DDI saliente para las llamadas de esta compañía, si no son especificadas en un nivel inferior (por ejemplo a nivel de usuario)

source: Media relay set
es: Servidores de Media

source: As mentioned above, media-relay can be grouped in sets to reserve capacities or on a geographical purpose. This section lets you assign them to companies.
es: Como se ha mencionado, los servidores de media pueden ser agrupados para reservar capacidades o para una distribución geográfica. Esta sección le permite asignarlos a las compañías.

source: Application Server
es: Servidores de aplicación

source: Recordings
es: Grabaciones

source: Configures a limit for the size of recordings of this company. A notification is sent to configured address when 80% is reached and older recordings are rotated when configured size is reached.
es: Configure el límite de tamaño de las grabaciones de esta compañía. Se enviará una notificación a la dirección configurada cuando se alcance el 80% y se rotarán las grabaciones más antiguas cuando se alcance el límite.

source: Introduced in 1.3, lets brand operator choose the features of the company. Related sections are hidden consequently and the company cannot use them.
es: Introducido en 1.3, permite a los operadores de marca elegir las features de la compañía. Esto habilitará o deshabilitará las diferentes secciones del menú de compañía.

source: Most of the features are self-explanatory, but **voice notification** deserves an explanation: if you enable them, when a call fails, the user will listen a locution explaining what ocurred ("you have no permissions to place this call", "the call cannot be billed", etc.)
es: La mayoría de las features son auto-explicativas, pero las **notificaciones de voz** merecen una explicación: si se habilitan, cuando una llamada falla, el usuario escuchará una locución explicando lo ocurrido ("no tiene permisos para realizar esta llamada", "la llamada no puede ser tarificada", etc.)

source: Recordings rotation happens at two levels: brand and company. This means that **a company's recordings can be rotated even though its limit has not arrived (or even it has no limit) if brand's limit applies first**.
es: La rotación de grabaciones ocurre en dos niveles: marca y compañía. Esto significa que **las grabaciones de una compañía puede llegar a ser rotadas incluso si esta no ha alcanzado su límite (o incluso si no tiene límite) si se ha alcanzado el límite de espacio de su marca**.

source: Again: recordings rotation happens at two levels: brand and company. This means that **a company's recordings can be rotated even though its limit has not arrived (or even it has no limit) if brand's limit applies first**.
es: De nuevo: La rotación de grabaciones ocurre en dos niveles: marca y compañía. Esto significa que **las grabaciones de una compañía puede llegar a ser rotadas incluso si esta no ha alcanzado su límite (o incluso si no tiene límite) si se ha alcanzado el límite de espacio de su marca**.

source: To avoid this, make sure that the sum of all companies does not exceed the size assigned to your brand and make sure that all companies has a size configured (if 0, it has unlimited size).
es: Para evitar esto, asegurese que la suma de los límites de las companías no exceda el tamaño asignado a la marca y que todas las compañías tienen un límite de espacio configurado (si es 0, tendrán ilimitado).

source: Emulate Demo company
es: Emular la empresa Demo

source: The company emulation process is the same as the brand emulation, with the difference that it filters the block ‘Company Configuration’ insted of ‘Brand Configuration’.
es: El proceso de emulación de empresa es idéntico al de emulación de marca, conla diferencia de que filtra el bloque 'Configuración de Empresa' en lugar delbloque 'Configuración de Marca'.

source: Once the company has been emulated, the top right corner of the portal will show that we are in the right path :)
es: Una vez emulada la empresa, la parte superior derecha de la pantalla mostraráque vamos por el buen camino :)

source: Company Configuration
es: Configuración de Compañía

source: We're close to make our fist call in our fresh installed IvozProvider, there are only 6 steps to configure in our DemoCompany company.
es: Estamos cerca de hacer nuestra primera llamada en nuestro flamente nuevo IvozProvider, solo queda crear 6 cosas dentro de nuestra empresa DemoCompany:

source: 2 terminals
es: 2 terminales

source: 2 extensions
es: 2 extensiones

source: 2 users
es: 2 usuarios

source: Creating Terminals
es: Creando Terminales

source: Go to the terminal section and... voilà! We already have 2 terminals created:
es: Vamos a la sección terminales y... voilà! Ya tenemos 2 terminales pre-creados:

source: Creating Extensions
es: Creando Extensiones

source: Then we go to extensions, just to check that we have 2 extensions already created for us:
es: Seguimos por tanto en la sección de extensiones, pero se nos han adelantado y ya tenemos 2 extensiones para nuestro uso:

source: Nothing more to do in this section, let's go the next one!
es: Nada por hacer en esta sección tampoco, ¡vamos a la última!

source: Creating Users
es: Creando usuarios

source: As expected, we also have 2 created users:
es: Como era de esperar, también tenemos 2 usuarios:

source: At this point, we have everthing ready make a call between this two users: Alice and Bob.
es: Llegados a este punto y sin necesidad de tocar nada en este bloque, ya tenemos todo listo para hacer una llamada de Alice a Bob.

source: SIP Terminal configuration
es: Configurar terminales SIP

source: The last thing we need is 2 SIP terminals (hardphones, softphones or even mobile applications) and configure them as follows:
es: Lo único que nos falta es disponer de 2 terminales SIP (hardphone, softphone, Android/IOS APP) y configurarlos como sigue:

source: **User**: alice
es: **Usuario**: alice

source: **Password**: alice
es: **Contraseña**: alice

source: **Domain**: users.democompany.com (or the IP if we are using :ref:`the DNS trick <dnshack>`)
es: **Dominio**: users.democompany.com (o la IP si hemos hecho :ref:`el truco <dnshack>`)

source: **User**: bob
es: **Usuario**: bob

source: **Password**: bob
es: **Contraseña**: bob

source: Sometimes the user and domain is configured in a single option. In this case we should enter alice@users.democompany.com and bob@users.democompany.com (or the IP if we are using :ref:`the DNS trick <dnshack>`)
es: Es posible que el usuario y el dominio se nos pida junto, tendremos que introducir alice@users.democompany.com y bob@users.democompany.com,respectivamente (o con la IP si hemos hecho :ref:`el truco <dnshack>`).

source: After configuring the terminals, Alices should be able to call Bob only by dialing 102 in her terminal.
es: Tras configurar los terminales, Alice debería de poder llamar a Bob sin más quemarcar 102 en su terminal.

source: Main Management
es: Gestión General

source: Any of the 2 Public IP addresses configured during the installation will work to acces the web portal. Default credentials are **admin / changeme**.
es: Cualquiera de las 2 IPs públicas configuradas en la instalación servirá para acceder al panel web. Las credenciales por defecto son **admin / changeme**.

source: In this section will reference global administrator configuration options, avaible in the menu (**Main management**) of the web portal (only visible to God Admins):
es: En esta sección haremos referencia a todo lo relativo al rol operador global, configurable en el bloque **Gestión general** del panel web (solo visible para God):

source: Custom installation configuration
es: Configuración personalizada en la instalación

source: During the install process two IP addresses will be requested in order to run the following two processes:
es: En el proceso de instalación se pregunta al administrador dos direcciones IP, con el fin de arrancar los siguientes 2 procesos:

source: Users SIP Proxy
es: Proxy de Usuarios

source: This is the SIP proxy exposed to the external world where users register their terminals.
es: Es el proxy SIP expuesto al mundo exterior al que se registran los terminalesde los usuarios.

source: The value displayed in the section **Proxy users** will show the IP address entered during the installation process.
es: El valor mostrado en la sección **Proxy de Usuarios** reflejará la IP introducida en el proceso de instalación.

source: Providers SIP proxy
es: Proxy de Salida

source: This is the SIP proxy exposed to the external world in charge of connecting the provider that brand aministrators will configure for *peering*.
es: Es el proxy SIP expuesto al mundo exterior al que hablarán los Operadores IP con los que el operador de marca decida hacer *peering*.

source: The value displayed in the section **Proxy trunk** will show the IP address entered during the installation process.
es: El valor mostrado en la sección **Proxy de Salida** reflejará la IP introducida en el proceso de instalación.

source: Only the IP address will be entered as the port will be always 5060 (5061 for SIP over TLS).
es: Solo se explicita la dirección IP, ya que el puerto siempre será 5060 (5061 para SIP sobre TLS).

source: This 2 values can be changed from the portal, but they must always have the same IP address that proxy process listen to requests.
es: Estos 2 valores pueden editarse desde la web, pero siempre tienen que tener la dirección IP a la que escuchan dichos procesos.

source: Standard global configuration
es: Configuración global estándar

source: The installation process includes other global values that are the same in any standalone IvozProvider installation and can also be checked from the web interface.
es: El proceso de instalación incluye otros valores globales que son iguales en toda instalación de IvozProvider (standalone) y que también se pueden ver desde la interfaz web.

source: Application Servers
es: Servidores de aplicación

source: The section **Application Servers** will list the IP address where the existing Asterisk processes will listen for request, and like previously mentioned, can scale horizontaly to adapt the platform for the required load.
es: En la sección **Servidores de Aplicación** se listan las direcciones IP donde escuchan los distintos Asterisk que componen la solución que, tal y como se ha mencionado, escalan horizontalmente para adaptarse a la carga de la plataforma.

source: Contrary to the Proxies, Asterisk is not exposed to the external world, so for a standalone installation there will only be one listening at 127.0.0.1.
es: A diferencia de los Proxies, estos Asterisk no están expuestos al exterior, porlo que en una instalación standalone solo habrá uno y escuchará en 127.0.0.1.

source: The listening port will not be displayed in the field because it will always be 6060 (UDP).
es: El puerto en el que escuchan no se recoge en el campo, ya que siempre será 6060 (UDP).

source: As soon as another Application Server is added, the proxies will try to balance load using it. If no response is received from added Application server, it will be disabled automatically.
es: Desde el momento en el que se añade otro Servidor de Aplicación, se intentará contar con él a la hora de repartir la carga. Si éste no responde, se desactivará automáticamente.

source: Media relay
es: Servidores de Media

source: Media relays are in charge of bridging RTP traffic of established calls. Like the Application Servers, they can scale horizontally as much as required.
es: Los media-relays son los que mueven el tráfico RTP en una llamada establecida y, al igual que ocurre con los Servidores de Aplicación, permiten un escalado horizontal para adaptarse a la carga de la plataforma.

source: Media relays are organized in groups so they can be assigned to a company. Each element of the group has a **metric** that allows non-equal load balancing within the same group (i.e. media-relay1 metric 1; media-relay2 metric 2: the second media relay will handle two times the calls than the first one).
es: Los media-relays se organizan en grupos con el fin de poder asignar un grupo concreto a una empresa concreta. Cada elemento del grupo tiene una **métrica** (peso) que permite repartos de carga desiguales dentro de un mismo grupo (por ej.media-relay1 métrica 1; media-relay2 métrica 2: media-relay2 gestionará el audio del doble de llamadas que media-relay1).

source: The static assigment of media relay groups is not the common practice but allow us to assign strategic resources to companies that need a warranted service. The most common usage of this **groups of media relays** is to place them near the geographic area of the company (usually far from the rest of the platform systems) in order to reduce **latencies** in their conversations.
es: La asignación de grupos de media-relays concretos a empresas concretas permite asignar recursos estáticos a empresas que requieren tener garantizado unos recursos concretos. Pero, lo más útil de este tipo de configuración es que estos **grupos de media-relays pueden estar en ubicaciones geográficas cercanas al emplazamiento de la empresa** (y lejanas al resto de la plataforma) para **reducir las latencias** en sus conversaciones.

source: In a standalone installation, only one media relay group will be exist:
es: En una instalación standalone, no obstante, solo existe un grupo de media-relays:

source: By default this group only has a media server:
es: Por defecto, este grupo solo contiene un media-relay:

source: The address displayed is the control socket, not the SDP address that will be included during SIP negociation. By default this alone media-relay will share the same IP address that the User's SIP proxy.
es: La dirección que aparece es la dirección del socket de control, no la dirección que se acaba incluyendo en los SDPs de negociación de sesión. Por defecto, este único media-relay utiliza la misma IP que el Proxy de Usuarios.

source: SIP Domains
es: Dominios SIP

source: The section **Domains** will display the SIP domains that points to our two public IP addresses.
es: En la sección **Dominios** se muestran los dominios SIP que apuntan a las 2 IPs públicas:

source: Users SIP Proxy IP address
es: IP de Proxy de Usuarios

source: Trunks SIP Proxy IP address
es: IP de Proxy de Salida

source: After the initial installation, there will be two domains, one for each address:
es: Tras una instalación inicial existen 2 dominios, uno para cada una de esas 2 IPs:

source: This domains will be used internally by a builtin DNS server included in the solution.
es: Estos dominios se utilizan internamente y el servidor de DNS incorporado en la solución los resuelve a las IPs concretas.

source: As mentioned in the section :ref:`domain_per_company`, each company will require a DNS pointing to the users SIP proxy. Once configured, the domain will be displayed in this list so global administrator can check what domains are registered for each company.
es: Tal y como se verá en la sección :ref:`domain_per_company`, cada compañía necesitará un DNS que apunte a la IP del Proxy de Usuarios. Una vez configurado, el dominio aparecerá en esta sección para que el operador global sepa los dominios configurados para cada empresa de un vistazo.

source: Brands
es: Marcas

source: After the initial installation, the platform will have an already created brand called DemoBrand. Let's inspect its parameters:
es: Tras la instalación inicial, la plataforma incluye una marca pre-creada llamada DemoBrand. Inspeccionemos sus parámetros:

source: Sets the name for this brand.
es: Configura el nombre de esta marca.

source: Number used in this brand's invoices.
es: Número empleado en las facturas de la marca.

source: Used as default logo in invoices and in portals (if they don't specify another logo).
es: Empleado como logo por defecto en las facturas y portales (si no se especifica otro logo).

source: Mail data
es: Información de notificaciones

source: Display name and from address used in external emails for this brand (faxes, voicemail, etc.)
es: Nombre y dirección origen empleada en los emails de notificación enviados por esta marca (faxes, voicemail, etc.)

source: Configures a limit for the size of recordings of this brand. A notification is sent to configured address when 80% is reached and older recordings are rotated when configured size is reached.
es: Configura el límite de espacio de grabaciones para esta marca. Se enviará una notificación cuando el espacio ocupado alcance el 80% y las grabaciones más antiguas serán rotadas cuando se alcance el límte configurado.

source: Introduced in 1.3, lets god operator choose the features of the created brand. An equivalent configuration is available in Companies, to choose between the ones that god operator gave to your Brand. Related sections are hidden consequently.
es: Introducido en 1.3, permite al administrador global elegir las feature de la marca recién creada. Existe una configuración similar en Compañías, para elegir entre las que el administrador global ha habilitado a la marca. Se habilitarán o deshabilitarán secciones en función de esta configuración.

source: Some features (currently invoices and billing) are related to brand and cannot be assigned to companies. Remaining features are related to companies and lets the brand operator to assign them to its companies.
es: Algunas features (actualmente facturas y tarificación) estan relacionadas con las marcas y no pueden ser asignadas a compañías. El resto de features estan relacionadas con compañías y el propio administrador de marca podrá asignarlas a sus compañías.

source: Disabling billing hides all related sections and assumes that an external element will set a price for calls (external tarification module is needed, ask for it!).
es: Deshabilitar la tarificación ocultará las secciones relacionadas y asumirá que un elemento externo se encargá de poner precios a cada llamada (requerirá un módulo de tarificación externa, ¡pídelo!).

source: Disabling invoices hides related sections, assuming you will use an external tool to generate them.
es: Deshabilitar facturas ocultará las secciones relacionadas y asumirá que un elemento externo se encargará de generar las facturas.

source: Emulate the Demo brand
es: Emular la marca Demo
