Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/internal_calls.po
Languages: es

source: As mentioned above, the initial installation will have an already created brand called DemoBrand, that will be used for our goal: to have 2 telephones registered that can call each other.
es: Como mencionamos anteriormente, tras la instalación inicial, la plataforma incluye una marca pre-creada llamada DemoBrand, que es la que utilizaremos para el fin que nos ocupa: tener 2 teléfonos registrados y que se puedan llamar entre sí.

source: Before going to the next section, is quite important to understand how the **emulation** works.
es: Antes de pasar a la siguiente sección, es importante entender el concepto de **Emular una marca**:

source: As global operator, you have access to the menu **Main management** only visible to *God* administators.
es: Como operador global, tienes acceso al bloque **Gestión general**, que solo ve *God*.

source: Apart from that menu, you will also have access to the **Brand configuration** and **Company configuration** that will look more or less like this:
es: Aparte de ese bloque, también ves los bloques **Configuración de marca** y **Configuración de empresa** que tienen este aspecto:

source: Check following button
es: Atención especial al siguiente botón:

source: When pressed, a popup will be displayed:
es: Una vez pulsado, muestra una ventana flotante tal que:

source: After selecting the DemoBrand brand, the icon will change and shows the emulted brand:
es: Al seleccionar la marca DemoBrand, el icono cambia y muestra la marca que se está emulando:

source: The upper right corner of the portal will also display the brand that is being emulted:
es: La parte superior derecha de la página también muestra la marca que se está emulando:

source: What emulation means
es: ¿Qué implica esta emulación?

source: Basically, that **everything in the menu 'Brand configuration' will be relative to the chosen brand** and is **exactly** the same menu entries that the brand operator will see using its brand portal.
es: Que **todo lo que se ve en el bloque 'Configuración de marca' es relativo a esa marca** y es *exactamente* lo mismo que lo que ve el operador de marca cuando entra con sus credenciales de acceso.

source: Ok, ok. maybe exactly is not totally accurate. The global operator is able to see some fields in some screens that other admins cann't (i.e. On Company edit screen, fields like 'Media relays' or 'Application server' are only configurable by the global operator.
es: Decir exactamente es mucho decir, ya que el operador global ve campos en ciertas secciones del bloque **Configuración de marca** que el operador de marca no ve. por ej. Al editar una empresa *God* ve 'Servidores de media' y'AS', que el operador de marca no ve.

source: Making internal calls
es: Realizar llamadas internas

source: The goal of this block will be to configure IvozProvider in order to make internal calls, using as the starting point the base installation described in the previous step.
es: El objetivo de este bloque será configurar IvozProvider para realizar llamadas internas, partiendo de la instalación base descrita en la sección anterior.

source: In order to archive a call between Alice and Bob, we have to do some task in the three configuration levels described in :ref:`operation_roles`, and that is why we have ordered the index in this blocks:
es: Para conseguir que Alice llame a Bob, tendremos que realizar labores de 3 niveles descritos en :ref:`operation_roles`, de ahí la organización del siguiente índice en esos 3 bloques:
