Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/maintenance.po
Languages: es

source: Maintenance and troubleshooting
es: Mantenimiento de la solución

source: This section described the tools included in IvozProvider to troubleshot any problems you may have:
es: A continuación se describen las herramientas que incorpora IvozProvider para facilitar el mantenimiento de la solución:

source: Log viewer
es: Visor de logs

source: Although all production IvozProvider installations mantained by `Irontec <https://www.irontec.com>`_ include a `Graylog server <https://www.graylog.org/>`_, `journalctl <https://www.freedesktop.org/software/systemd/man/journalctl.html>`_ is currently the unique tool to inspect logs generated by different elements of the solution in the past.
es: A pesar de que todas las instalaciones en producción de IvozProvider mantenidas por `Irontec <https://www.irontec.com>`_ incluyen un `servidor Graylog <https://www.graylog.org/>`_, `journalctl <https://www.freedesktop.org/software/systemd/man/journalctl.html>`_ es actualmente la única herramientas para inspeccionar los mensajes de log generados por los distintos elementos de la solución en el pasado.

source: Asterisk CLI
es: CLI de Asterisk

source: Asterisk CLI gives tons of realtime information too and are formatted beautifully to detect possible configuration errors:
es: El CLI de Asterisk proporciona toneladas de información (formateadas de una forma legible y estética) en tiempo real sobre todo lo que está sucediendo y permite encontrar posibles errores:

source: You can access Asterisk CLI typing *ast* in the shell.
es: Puedes acceder al CLI escribiendo *ast* en la consola.

source: Kamailio realtime log viewing
es: Visualización de logs de Kamailio en tiempo real

source: You can see Kamailio logs in realtime too typing *kamtail-proxyusers* and *kamtail-proxytrunks* in the shell:
es: Se pueden visualizar los logs de Kamailio ejecutando *kamtail-proxyusers* y *kamtail-proxytrunks* en la consola:

source: Analyzing SIP traffic
es: Analizando el tráfico SIP

source: Although all production IvozProvider installations mantained by `Irontec <https://www.irontec.com>`_ include a `Homer SIP Capture Server <https://www.sipcapture.org/>`_, it is not installed in the standlone version of IvozProvider. The reason behind this is that we prefer awesome SIPCAPTURE stack running on an additional machine.
es: A pesar de que todas las instalaciones en producción de IvozProvider mantenidas por `Irontec <https://www.irontec.com>`_ incluyen un `servidor Homer SIP Capture <https://www.sipcapture.org/>`_, éste no se incluye en la versión standalone de IvozProvider. El motivo es que somos partidarios de instalar el excepcional stack SIPCAPTURE en una máquina adicional.

source: `sngrep Ncurses SIP Messages flow viewer developed by Irontec <https://github.com/irontec/sngrep>`_ is currently the preferred tool to inspect SIP traffic included in IvozProvider.
es: `El visor de mensajes SIP en Ncurses sngrep desarrollado por Irontec <https://github.com/irontec/sngrep>`_ es en la actualidad la herramienta preferente para analizar el tráfico SIP de la solución.

source: See live SIP traffic (all):
es: Capturar todo el tráfico SIP:

source: See live SIP traffic related to calls:
es: Capturar solo el tráfico relativo a llamadas:

source: See live SIP traffic and capture RTP too:
es: Capturar SIP y RTP:

source: For more reference, visit `sngrep official site <https://github.com/irontec/sngrep>`_.
es: Para más información, acceder a la `página oficial del proyecto <https://github.com/irontec/sngrep>`_.

source: Other capturing tools
es: Otras herramientas de captura

source: Although sngrep is our preferred capturing tool, IvozProvider ships other tools to capture SIP/RTP traffic, such as `tcpdump <http://www.tcpdump.org>`_ and `ngrep <http://ngrep.sourceforge.net>`_.
es: Aunque sngrep es nuestra herramienta favorita, IvozProvider también incluye otras herramientas como `tcpdump <http://www.tcpdump.org>`_ y `ngrep <http://ngrep.sourceforge.net>`_.
