Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/platform.po
Languages: es

source: All previous examples are wrong, as no 'yea-' is found ('yea' match is case sensitive).
es: Todos los ejemplos anteriores son incorrectos, ya que ninguno contiene 'yea-' (en minúsculas).

source: This example is identical to 't23/yea-{mac}.cfg', as subpaths are ignored.
es: Este ejemplo es idéntico a 't23/yea-{mac}.cfg', ya que las subrutas se ignoran.

source: Example 4 - TerminalModels.specificUrlPattern: yea-{mac}
es: Ejemplo 4 - TerminalModels.specificUrlPattern: yea-{mac}

source: As no extension is given:
es: Como no se especifica ninguna extensión:

source: This example is identical to 't23/yea-{mac}', as subpaths are ignored.
es: Este ejemplo es idéntico a 't23/yea-{mac}', ya que las subrutas se ignoran.
