Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/platform.po
Languages: es

source: Antiflood trusted IPs
es: Ips de confianza

source: IvozProvider comes with an *anti-flooding* mechanism to avoid that a single sender can deny the platform service by sending lots of requests. Both *proxies* (users and trunks) use this mechanism, that **limits the number of requests from an origin address in a time lapse**.
es: IvozProvider incorpora un mecanismo de *anti-flooding* que evita que un emisor sature nuestra plataforma enviando peticiones. Ambos *proxies* (usuarios y salida) incorporan este mecanismo, que **limita el número de peticiones desde un dirección origen en un tramo concreto de tiempo**.

source: When an origin reaches this limit, the proxy will stop sending responses for a period of time. After this time, the requests will be again handled normally.
es: Cuando un origen llega al límite, el proxy dejará de contestarle durante un tiempo dado. Pasado ese tiempo, volverá a contestarle con normalidad

source: Some origins are automatically excluded from this *anti-flooding* mechanism:
es: Ciertos orígenes que están automáticamente excluidos de este mecanismo de *anti-flooding*:

source: Application Servers from the platform.
es: Servidores de aplicación de la plataforma.

source: Company authorized IP addresses or ranges (see previous section).
es: IPs o rangos autorizados de empresas (ver sección anterior).

source: Global operator of the platform can also add exceptions to this mechanism in the section **Global configuration** > **Antiflood trusted IPs**.
es: El operador global puede añadir otras direcciones que queden excluidas de este mecanismo por medio del apartado **Configuración global** > **IPs de confianza**

source: Application Servers
es: Servidores de aplicación

source: The section **Application Servers** will list the IP address where the existing Asterisk processes will listen for request, and like previously mentioned, can scale horizontaly to adapt the platform for the required load.
es: En la sección **Servidores de Aplicación** se listan las direcciones IP donde escuchan los distintos Asterisk que componen la solución que, tal y como se ha mencionado, escalan horizontalmente para adaptarse a la carga de la plataforma.

source: Contrary to the Proxies, Asterisk is not exposed to the external world, so for a standalone installation there will only be one listening at 127.0.0.1.
es: A diferencia de los Proxies, estos Asterisk no están expuestos al exterior, porlo que en una instalación standalone solo habrá uno y escuchará en 127.0.0.1.

source: The listening port will not be displayed in the field because it will always be 6060 (UDP).
es: El puerto en el que escuchan no se recoge en el campo, ya que siempre será 6060 (UDP).

source: As soon as another Application Server is added, the proxies will try to balance load using it. If no response is received from added Application server, it will be disabled automatically.
es: Desde el momento en el que se añade otro Servidor de Aplicación, se intentará contar con él a la hora de repartir la carga. Si éste no responde, se desactivará automáticamente.

source: Brands
es: Marcas

source: Name
es: Nombre

source: Sets the name for this brand.
es: Configura el nombre de esta marca.

source: Number used in this brand's invoices.
es: Número empleado en las facturas de la marca.

source: Used as default logo in invoices and in portals (if they don't specify another logo).
es: Empleado como logo por defecto en las facturas y portales (si no se especifica otro logo).

source: Invoice data
es: Datos de facturación

source: Data included in invoices created by this brand.
es: Información incluida en las facturas creadas por esta marca.

source: Mail data
es: Información de notificaciones

source: Display name and from address used in external emails for this brand (faxes, voicemail, etc.)
es: Nombre y dirección origen empleada en los emails de notificación enviados por esta marca (faxes, voicemail, etc.)

source: SIP domain
es: Dominio SIP

source: Introduced in 1.4. Domain pointing to Users SIP proxy used by all the Retail Accounts of this brand.
es: Introducido en 1.4. Configura el dominio que apuntará al proxy SIP de usuarios empleado por todas las cuentas Retail de esta marca.

source: Recordings
es: Grabaciones

source: Configures a limit for the size of recordings of this brand. A notification is sent to configured address when 80% is reached and older recordings are rotated when configured size is reached.
es: Configure el límite de tamaño de las grabaciones de esta compañía. Se enviará una notificación a la dirección configurada cuando se alcance el 80% y se rotarán las grabaciones más antiguas cuando se alcance el límite.

source: Introduced in 1.3, lets god operator choose the features of the created brand. An equivalent configuration is available in Companies, to choose between the ones that god operator gave to your Brand. Related sections are hidden consequently.
es: Introducido en 1.3, permite al administrador global elegir las feature de la marca recién creada. Existe una configuración similar en Compañías, para elegir entre las que el administrador global ha habilitado a la marca. Se habilitarán o deshabilitarán secciones en función de esta configuración.

source: Some features (currently invoices and billing) are related to brand and cannot be assigned to companies. Remaining features are related to companies and lets the brand operator to assign them to its companies.
es: Algunas features (actualmente facturas y tarificación) estan relacionadas con las marcas y no pueden ser asignadas a compañías. El resto de features estan relacionadas con compañías y el propio administrador de marca podrá asignarlas a sus compañías.

source: Disabling billing hides all related sections and assumes that an external element will set a price for calls (external tarification module is needed, ask for it!).
es: Deshabilitar la tarificación ocultará las secciones relacionadas y asumirá que un elemento externo se encargá de poner precios a cada llamada (requerirá un módulo de tarificación externa, ¡pídelo!).

source: Disabling invoices hides related sections, assuming you will use an external tool to generate them.
es: Deshabilitar facturas ocultará las secciones relacionadas y asumirá que un elemento externo se encargará de generar las facturas.

source: SIP Domains
es: Dominios SIP

source: The section **Domains** will display the SIP domains that points to our two public IP addresses.
es: En la sección **Dominios** se muestran los dominios SIP que apuntan a las 2 IPs públicas:

source: Users SIP Proxy IP address
es: IP de Proxy de Usuarios

source: Trunks SIP Proxy IP address
es: IP de Proxy de Salida

source: After the initial installation, there will be two domains, one for each address:
es: Tras una instalación inicial existen 2 dominios, uno para cada una de esas 2 IPs:

source: This domains will be used internally by a builtin DNS server included in the solution.
es: Estos dominios se utilizan internamente y el servidor de DNS incorporado en la solución los resuelve a las IPs concretas.

source: As mentioned in the section :ref:`domain_per_company`, each company will require a DNS pointing to the users SIP proxy. Once configured, the domain will be displayed in this list so global administrator can check what domains are registered for each company.
es: Tal y como se verá en la sección :ref:`domain_per_company`, cada compañía necesitará un DNS que apunte a la IP del Proxy de Usuarios. Una vez configurado, el dominio aparecerá en esta sección para que el operador global sepa los dominios configurados para cada empresa de un vistazo.

source: Platform Configuration
es: Configuración de Plataforma

source: Media relay
es: Servidores de Media

source: Media relays are in charge of bridging RTP traffic of established calls. Like the Application Servers, they can scale horizontally as much as required.
es: Los media-relays son los que mueven el tráfico RTP en una llamada establecida y, al igual que ocurre con los Servidores de Aplicación, permiten un escalado horizontal para adaptarse a la carga de la plataforma.

source: Media relays are organized in groups so they can be assigned to a company. Each element of the group has a **metric** that allows non-equal load balancing within the same group (i.e. media-relay1 metric 1; media-relay2 metric 2: the second media relay will handle two times the calls than the first one).
es: Los media-relays se organizan en grupos con el fin de poder asignar un grupo concreto a una empresa concreta. Cada elemento del grupo tiene una **métrica** (peso) que permite repartos de carga desiguales dentro de un mismo grupo (por ej.media-relay1 métrica 1; media-relay2 métrica 2: media-relay2 gestionará el audio del doble de llamadas que media-relay1).

source: The static assigment of media relay groups is not the common practice but allow us to assign strategic resources to companies that need a warranted service. The most common usage of this **groups of media relays** is to place them near the geographic area of the company (usually far from the rest of the platform systems) in order to reduce **latencies** in their conversations.
es: La asignación de grupos de media-relays concretos a empresas concretas permite asignar recursos estáticos a empresas que requieren tener garantizado unos recursos concretos. Pero, lo más útil de este tipo de configuración es que estos **grupos de media-relays pueden estar en ubicaciones geográficas cercanas al emplazamiento de la empresa** (y lejanas al resto de la plataforma) para **reducir las latencias** en sus conversaciones.

source: In a standalone installation, only one media relay group will be exist:
es: En una instalación standalone, no obstante, solo existe un grupo de media-relays:

source: By default this group only has a media server:
es: Por defecto, este grupo solo contiene un media-relay:

source: The address displayed is the control socket, not the SDP address that will be included during SIP negociation. By default this alone media-relay will share the same IP address that the User's SIP proxy.
es: La dirección que aparece es la dirección del socket de control, no la dirección que se acaba incluyendo en los SDPs de negociación de sesión. Por defecto, este único media-relay utiliza la misma IP que el Proxy de Usuarios.

source: Providers SIP proxy
es: Proxy de Salida

source: This is the SIP proxy exposed to the external world in charge of connecting the provider that brand aministrators will configure for *peering*.
es: Es el proxy SIP expuesto al mundo exterior al que hablarán los Operadores IP con los que el operador de marca decida hacer *peering*.

source: The value displayed in the section **Proxy trunk** will show the IP address entered during the installation process.
es: El valor mostrado en la sección **Proxy de Salida** reflejará la IP introducida en el proceso de instalación.

source: Only the IP address will be entered as the port will be always 5060 (5061 for SIP over TLS).
es: Solo se explicita la dirección IP, ya que el puerto siempre será 5060 (5061 para SIP sobre TLS).

source: This 2 values can be changed from the portal, but they must always have the same IP address that proxy process listen to requests.
es: Estos 2 valores pueden editarse desde la web, pero siempre tienen que tener la dirección IP a la que escuchan dichos procesos.

source: Users SIP Proxy
es: Proxy de Usuarios

source: This is the SIP proxy exposed to the external world where users register their terminals.
es: Es el proxy SIP expuesto al mundo exterior al que se registran los terminalesde los usuarios.

source: The value displayed in the section **Proxy users** will show the IP address entered during the installation process.
es: El valor mostrado en la sección **Proxy de Salida** reflejará la IP introducida en el proceso de instalación.

source: There are **special services** that can be accessed by calling to some codes **from the terminal**.
es: Existen **servicios especiales** a los que se accede **marcando códigos** especiales **desde un terminal** de usuario **cuando éste está en reposo**.

source: Services defined in this section **are not accessible during a conversation**. They are activated by **calling the codes**, not using DTMF codes while talking.
es: Los servicios que se definen en esta sección **no son accesibles en medio de una conversación**. Se activan **llamando** a los códigos que se mencionarán, no marcándolos en medio de una conversación.

source: There are the folowing **special services** avaialble in the section **Global configuration** > **Services**:
es: En el momento de realizar esta documentación, existen los siguientes **servicios especiales** visibles en la sección **Gestión general** > **Servicios**:

source: Direct pickup
es: Captura de llamadas directa

source: This service allows capturing a ringing call from another terminal by calling the code followed by the extension from the target user.
es: Es el servicio que permite capturar metiendo el código que se asigne seguido de la extensión del teléfono a capturar.

source: Group pickup
es: Captura de grupo

source: This service allows capturing a ringing call for any terminal whose user is part of one of the capturer pickup groups.
es: Es el servicio que permite capturar el teléfono que esté sonando dentro de tu(s) grupo(s) de captura.

source: Check voicemail
es: Consultar el buzón de voz

source: This service allows checking the user's voicemail using an interactive menu from which new voicemails can be listen, deleted, etc. This is an active alternative to receive voicemails via the email. Since 1.4, this service allows optional extension after the service code to check another users voicemails. Users can protect their voicemail using the internal menu options.
es: Este servicio permite acceder a un menú de voz que te presenta los mensajes de voz nuevos, viejos, etc. Es una alternativa a la recepción de mensajes de voz vía correo electrónico. A partir de 1.4, este servicio acepta una extensión opcional trás el código de servicio para poder acceder a los buzones de otros usuarios. Los usuarios pueden proteger su buzón de voz empleando las opciones del menú de voz interno.

source: Record locution
es: Grabar locución

source: This service allows any user to record their company's locutions by dialing an special code. Voice instructions will be provided in the user's language.
es: Este servicio permite grabar la locución llamando desde cualquier terminal de cualquier usuario a un código especial. Las instrucciones se mostrarán en el idioma del usuario.

source: As soon as new services are implemented into IvozProvider, they will be listed in this section.
es: A medida que la solución vaya evolucionando y surjan servicios nuevos, aparecerán en este listado para que el operador global sepa de su existencia y lo comunique a sus operadores de marca.

source: This section lists the available services and the default codes when a **new brand** is created.
es: Este listado determina los servicios disponibles y los códigos por defecto de las **nuevas marcas**.

source: Changing the default code in this section will only affect new created brands.
es: Cambiar un código solo afecta a las marcas que se creen tras el cambio.

source: Terminal provisioning
es: Provisión de terminales

source: Overview
es: Introducción

source: IvozProvider supports provisioning of terminals via HTTP/HTTPS that fulfill the following requirements:
es: IvozProvider soporta provisionar terminales vía HTTP/HTTPS que sigan la forma de provisionarse que se explica a continuación:

source: Assuming a just unboxed terminal, just plugged and connected to the network:
es: Cuando un terminal sale de la caja, se alimenta y se conecta a la red:

source: Ask IP address via DHCP.
es: Pide IP por DHCP.

source: DCHP has enabled the option 66 that points to the platform portal
es: Se fija en la opción 66 de DHCP que le indica a quién tiene que pedir su configuración.

source: The first requested provisioning file is a static file (different for each model) prefixed with the previous step URL.
es: Pide un primer archivo añadiendo a la ruta recibida por DHCP un archivo estático (cada modelo de terminal, uno distinto).

source: The served file can redefine the URL for further requests
es: En ese archivo se le puede indicar un siguiente archivo a pedir.

source: Any terminal model that can adapt to this provisioning way can be added into the section **Platform Configuration > Terminal manufacturers**.
es: Todo terminal que sea capaz de adaptarse a este formato podrá provisionarse utilizando la sección **Configuración general > Fabricantes de terminales**.

source: Example Cisco SPA504G
es: Ejemplo Cisco SPA504G

source: Cisco SPA504G is turned on and requests an IP address to DHCP
es: Cisco 504G se despierta y pide IP.

source: Receives “http://provision.example.com/provision” as DHCP option 66
es: Recibe “http://provision.ejemplo.com/provision”

source: Request HTTP configuration from http://provision.example.com/provision/spa504g.cfg
es: Pide la configuración vía http a http://provision.ejemplo.com/provision/spa504g.cfg

source: All 504G request the same file (spa504.cfg), prefixed with the given URL
es: Todos los 504G solicitan el mismo archivo (spa504g.cfg), añadiéndolo a la ruta que reciban.

source: This file only contain basic configuration settings for the model and the URL for the next request (p.e. https://provision.example.com/provision/$MAC.cfg)
es: En ese primer archivo común se especifican los parámetros comunes a todos los terminales de ese modelo concreto y qué archivo tienen que pedir a continuación (ejemplo https://provision.example.com/provision/$MAC.cfg)

source: This way, each terminal (MAC should be unique) request a specific file (and different) after the generic one has been served.
es: De esta forma, hacemos que cada terminal (la MAC es única) pida un archivo concreto (y distinto) una vez que ha pedido el genérico.

source: This file will contain the specific configuration for the terminal:
es: En este archivo se le sirve su configuración específica:

source: User
es: Usuario

source: Password
es: Contraseña

source: SIP Domain
es: Dominio SIP

source: IvozProvider provisioning system, right now, only has one goal: provide credentials and language settings for the terminals.
es: El sistema de provisión de IvozProvider, a día de hoy, configura los terminales con el único objetivo de que se registren y se queden en el idioma del usuario.

source: Configuration of supported models
es: Configuración de modelos soportados

source: IvozProvider uses a template system that allows global operator (God) to define new models and configure what files will be served.
es: IvozProvider utiliza un sistema de plantillas que permite que el operador global (God) defina nuevos modelos de terminales y configure los archivos que se les servirá.

source: The help section of **Terminal manufacturers** has examples for some models that work (in the moment of writting this) with IvozProvider provisioning system.
es: La sección de ayuda de **Fabricantes de Terminales** contiene ejemplos que funcionan (en el momento de escribir esta documentación) con el sistema de provisión de IvozProvider.

source: These models will be available after the initial installation, but you must edit them and load the default configuration before you can use the provisioning system (option **Restore default template**).
es: Estos modelos aparecen en la sección tras la instalación, pero hay que entrar a cada uno de ellos a cargar la configuración por defecto antes de poder usarlos (opción **Restore default template**).

source: UACs firmware changes may cause that given examples stop working. We will try to keep templates updated, but we can't guarantee this point.
es: Cambios en el firmware de los terminales pueden provocar que los ejemplos proporcionados dejen de funcionar. Se intentará mantenerlos actualizados, pero no podemos garantizar que siempre lo estén.

source: Analyzing the suggested templates you can have a basic idea of the flexibility of the system to configure any existing terminal model in the market and to adapt them to eventual changes in given examples.
es: Analizando las plantillas sugeridas, puede hacerse una idea básica de la flexibilidad del sistema para configurar cualquier modelo de terminal en el mercado y para adaptarse de posibles cambios en los ejemplos dados.

source: Getting technical
es: Detalles técnicos

source: Imagine an environment with this configuration:
es: Imaginemos un escenario con esta configuración:

source: Provisioning URLs:
es: URLs de provisión:

source: Generic file: http://PROV_IP/provision
es: Archivo genérico: http://PROV_IP/provision

source: Specific file: https://PROV_IP:PROV_PORT/provision
es: Archivo específico: https://PROV_IP:PROV_PORT/provision

source: Which requested URLs will be valid?
es: ¿Qué URLs de petición serán correctas?

source: For generic file, just one: http://PROV_IP/provision/y000000000044.cfg
es: Para el archivo genérico, solo una: http://PROV_IP/provision/y000000000044.cfg

source: For specific file, requests are right as long as this rules are fulfilled:
es: Para el archivo específico, la petición tiene que satisfacer las siguientes reglas

source: All HTTP requests are wrong.
es: Todas las peticiones HTTP son erróneas.

source: HTTPS requests to 443 are wrong (PROV_PORT must be used).
es: Las peticiones HTTPS al puerto 443 son erróneas (se tiene que usar PROV_PORT)

source: Subpaths after provisioning URL are ignored, both in request and in specificUrlPattern.
es: Las subrutas después de la URL de provisión son ignoradas, tanto en la petición como en el campo specificUrlPattern.

source: On specific file request, extension must match as long as extension is used in specificUrlPattern.
es: La extensión de la petición tiene que ser la misma que la extensión del campo specificUrlPattern (en caso de que la tenga). Si no, la extensión es ignorada.

source: On specific file request, the filename must match exactly once {mac} is replaced.
es: El nombre del archivo solicitado tiene que coincidir exactamente con el nombre especificado en specificUrlPattern, una vez que {mac} se sustituya por el valor adecuado.

source: MAC address is case insensitive and can contain colons or not (':').
es: La dirección MAC no distingue mayúsculas/minúsculas y puede contener dos puntos o no.

source: Let's analyze the examples below to understand this rules better:
es: Analicemos los siguientes ejemplos para entender estas reglas mejor:

source: Example 1 - TerminalModels.specificUrlPattern: {mac}.cfg
es: Ejemplo 1 - TerminalModels.specificUrlPattern: {mac}.cfg

source: Working requests:
es: Peticiones correctas:

source: Wrong requests:
es: Peticiones erróneas:

source: This example is identical to 't23/{mac}.cfg', as subpaths are ignored.
es: Este ejemplo es idéntico a 't23/{mac}.cfg', ya que las subrutas se ignoran.

source: Example 2 - TerminalModels.specificUrlPattern: {mac}
es: Ejemplo 2 - TerminalModels.specificUrlPattern: {mac}

source: All previous examples are ok, as extension is ignored if no extension is found in specificUrlPattern.
es: Todos los ejemplos anteriores son correctos, ya que la extensión de la petición se ignora al no haber especificado extensión alguna en specificUrlPattern.

source: This example is identical to 't23/{mac}', as subpaths are ignored.
es: Este ejemplo es idéntico a 't23/{mac}', ya que las subrutas se ignoran.

source: Example 3 - TerminalModels.specificUrlPattern: yea-{mac}.cfg
es: Ejemplo 3 - TerminalModels.specificUrlPattern: yea-{mac}.cfg
