Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/retail.po
Languages: es

source: Retail Accounts
es: Cuentas Retail

source: Retail Accounts are the main routable option in Retail clients. More or less like :ref:`friends` are to Virtual PBX Companies, accounts contain the required configurable options to provide a SIP connectivity service with IvozProvider and an external SIP entity.
es: Las cuentas Retail son la principal opción enrutable de los clientes Retail. Semejantes a los :ref:`friends` en las compañías de PBX Virtual, las cuentas tienen todas las opciones de configuración necesarias para proveer un servicio de connectividad entre IvozProvider y una entidad SIP externa.

source: Although both **Contract peering** and **Retail accounts** are defined by the **brand operator**, the first ones are designed to connect with the public network while the second ones connect the system with other SIP agents.
es: A pesar de que tanto los **Contratos de peering** como **las cuentas Retail** son definidas por el **operador de marca**, los primeros están diseñados para connectar con la red publica mientras que los segundos se emplean para conectar el sistema con otros agentes SIP.

source: Types of retail accounts
es: Tipos de cuentas retail

source: There are 2 main types of SIP PBX that can use retail with IvozProvider:
es: Hay dos tipos principales de PBX SIP que puede emplear retail con IvozProvider:

source: **Direct connection PBX**: IvozProvider must be able to talk SIP directly with this kind of accounts by just redirecting the traffic to the proper port of the public IP address of the PBX.
es: **Centralitas con conectividad directa**: Esto implica que IvozProvider tiene la posibilidad de hablar SIP directamente sin más que dirigir su tráfico a una IP pública a un puerto concreto.

source: **PBX behind NAT**: Not directly accesible. This kind of PBX must register at IvozProvider (just like all the :ref:`Terminals <terminals>` do).
es: **Centralitas tras NAT**: No accesibles directamente. Este tipo de centralitas tendran que registrarse en IvozProvider (exactamente igual que lo hacen los :ref:`Terminales <terminals>`)

source: What kind of calls can be routed through a *Retail Account*?
es: ¿Qué llamadas se envían a una cuenta retail?

source: Contrary to Friends, **Retail Accounts** have some simplifications and limitations.
es: A diferencia de los Friends, las **Cuentas retail** tienen algunas simplificaciones y limitaciones.

source: Retail Accounts only route their assigned DDIs
es: Las cuentas Retail solo enrutan sus DDIs asignados

source: Retail Accounts only place externals calls to Contract Peerings
es: Las cuentas Retail solo realizan llamadas externas a través de Contratos de peering

source: Retail Accounts only receive external calls from Contract Peerings
es: Las cuentas Retail sólo reciben llamadas externas desde Contratos de peering

source: Retail Accounts Configuration
es: Configuracion de las cuentas retail

source: These are the configurable settings of *Retail accounts*:
es: Estas son las opciones de configuracion de las *Cuentas retail*:

source: Name
es: Nombre

source: Name of the **retail account**. This name must be unique in the whole brand so it's recommended to use some kind of secuential identifier. This will also be used in SIP messages (sent **From User**).
es: Nombre de la **cuenta retail**. Este nombre ha de ser único en toda la marca por lo que se recomienda emplear algun identificador secuencial. También se empleará en los mensajes SIP (enviado como usuaro en la cabecera **From**).

source: Description
es: Descripcion

source: Optional. Extra information for this *retail account*.
es: Opcional. Información extra para esta *cuenta retail*

source: Password
es: Contraseña

source: When the *retail account* send requests, IvozProvider will authenticate it using this password. Like in other SIP agents in IvozProvider **using password IS A MUST**.
es: Cuando una *cuenta retail* envia peticiones, IvozProvider se autenticará empleando esta contraseña. Como en otros agentes SIP en IvozProvider **emplear contraseña ES OBLIGATORIO**.

source: Direct connection
es: Conexión directa

source: If you choose 'Yes' here, you'll have to fill the protocol, address and port where this *retail account* can be contacted.
es: Si elijes 'Sí' aquí, tendras que informar el protocol, dirección y puerto donde se enviarán las peticiones de esta *cuenta retail*.

source: Fallback Outgoing DDI
es: DDI Saliente alternativo

source: External calls from this *retail account* will be presented with this DDI, **unless the source presented matches a DDI belonging to the account**.
es: Las llamadas externas de esta *cuenta retail* presentarán este DDI, **a no ser que el DDI presentado sea uno de los asociados a la cuenta**.

source: Country and Area code
es: Pais y Código de area

source: Used for number transformation from and to this retail account.
es: Empleado para las transformaciones numéricas de esta cuenta retail.

source: Allowed codecs
es: Codecs permitidos

source: Like a other SIP entities, *retail accounts* will talk the selected codec.
es: Como otras entidades SIP, las *cuentas retail* hablarán en el códec seleccionado.

source: From domain
es: Dominio From

source: Request from IvozProvider to this account will include this domain in the From header.
es: Las peticiones desde IvozProvider a esta cuenta incluirán este dominio en la cabecera From.

source: Asterisk as an account client
es: Asterisk como cliente de cuenta retail

source: At the other end of a account can be any kind of SIP entity. This section takes as example an Asterisk PBX system using SIP channel driver that wants to connect to IvozProvider.
es: En el otro extremo de una cuenta puede haber cualquier entidad. Esta seccion toma como ejemplo una PBX Asterisk usando su driver de canal SIP que deseamos conectar a IvozProvider

source: Account register
es: Registro cuenta

source: If the system can not be directly access, Asterisk will have to register in the platform (like a terminal will do).
es: En caso de no estar directamente visible, el Asterisk tendrá que registrarse en IvozProvider (al igual que hacen los terminales).

source: Configuration will be something like this:
es: La configuración sería tal que:

source: Account peer
es: peer cuenta

source: *Account clients* MUST NOT challenge IvozProvider. That's why the *insecure* setting is used here.
es: Los clientes tras cuentas no pueden desafiar a IvozProvider, al igual que un terminal no desafía a IvozProvider cuando éste le llama. De ahí el insecure.

source: Retail DDIs
es: DDIs Retail

source: DDIs are the external entry point from Contract Peerings to Retail Clients that can be routed through Retail Accounts.
es: Los DDIs son el punto de entrada externa desde Contratos de peering a Clientes Retail que se enrutarán a través de Cuentas de Retail.

source: DDI filters
es: Filtros DDI

source: We can assign an **external call filter** configured in :ref:`previous section <retail_filters>`. Contrary to Virtual PBX External Call fiters, Retail DDIs filters only allow static redirection to another external number.
es: Podemos asignar un **filtro de entrada** configurado en :ref:`la anterior sección <retail_filters>`. Al contrario que los filtros externos disponibles en las PBX Virtuales, los filtros de los DDI de Retail tan solo proporcionan un desvío estático a un número externo.

source: Retail DDI routes
es: Rutas de DDI Retail

source: Retail DDIs can only be routed to a :ref:`Retail Accounts <retail_accounts>` or :ref:`Virtual Fax <faxing_system>`.
es: Los DDI de Retail solo pueden ser enrutados a :ref:`Cuentas Retail <retail_accounts>` o :ref:`Faxes Virtuales <faxing_system>`.

source: Routing a DDI through a Retail account will allow to place external calls from that account presenting that DDI as origin.
es: Enrutar un DDI a través de una Cuenta Retail permitirá realizar llamadas externas desde esa cuenta presentando dicho DDI como origen.

source: Recordings
es: Grabaciones

source: If Retail Client has *Recordings* feature enabled, DDIs can also record incoming and/or outgoing calls.
es: Si el Cliente Retail tiene la feature *Grabaciones* habilitada, los DDIs también podrán grabar las llamadas salientes y/o entrantes·

source: Retail DDI filters
es: Filtros DDI Retail

source: Retail External Filters can be assigned to DDIs to temporary forward calls to an external number.
es: Los Filtros Externos de Retail pueden asignarse a DDIs permitiendo un desvío temporal a números externos.

source: Filters Configuration
es: Configuración de Filtros

source: This are the configurable settings of *Retail external filters*:
es: Estas son las opciones configurables de los *Filtros externos de Retail*:

source: Name of the filter.
es: Nombre del filtro.

source: Number
es: Número

source: External Destination for this filter.
es: Destino externo para este filtro.

source: Calls forwarded by a filter will keep the original caller identification, adding the fordwarding info in a SIP *Diversion* header.
es: Las llamadas desviadas por un filtro mantendrán la identificación original del llamante, añadiendo los datos del desviador en una cabecera SIP *Diversion*.

source: Retail Configuration
es: Configuración Retail

source: Retail clients are a special type of company that only provide a connectivity service with contract peerings through retail accounts.
es: Los clientes Retail son un tipo especial de compañía que solo provee un servicio de conectividad con los contratos de peering a través de cuentas retail.

source: Contrary to the Virtual PBX companies, all Retail clients use the brand domain to unequivocally identify their accounts. You'll need to configure Brand's domain to use this feature.
es: Al contrario que las compañías de PBX virtual, todos los clientes Retail emplean el dominio de marca para identificar de manera inequívoca sus cuentas. Será preciso configurar el dominio de Marca para emplear esta funcionalidad.

source: Retail clients can be enabled per Brand basis via Features.
es: Los clientes Retail pueden ser habilitados en las Marcas a través de Features.

source: The goal of this section will be describe each of the configuration settings associated with Retail clients included in IvozProvider.
es: El objetivo de esta sección será describir cada una de las opciones de configuración asociadas a los clientes Retail incluidas en IvozProvider.

source: Retail concepts
es: Cuentas Retail

source: Additional retail features
es: Funcionalidades adicionales retail
