Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/security.po
Languages: es

source: Security elements
es: Elementos de seguridad

source: Firewall
es: Cortafuegos

source: **IvozProvider does not currently include a firewall** but...
es: **IvozProvider actualmente no viene con un cortafuegos configurado** pero...

source: We **strongly encourage any production installation to implement a firewall** to protect the platform from the wild Internet.
es: **Recomendamos encarecidamente que las instalaciones en producción cuenten con un cortafuegos** que protejan la plataforma del salvaje Internet.

source: The protection method could be:
es: Los metodos de protección podrían ser:

source: Local firewall based on `iptables <https://www.netfilter.org/>`_
es: Cortafuegos locales basados en `iptables <https://www.netfilter.org/>`_

source: External firewall
es: Cortafuegos externos

source: Both
es: Ambos

source: Exposed ports/services
es: Servicios/Puertos expuestos

source: These are the **ports IvozProvider needs to expose** to work properly:
es: Estos son los puertos que **IvozProvider necesita exponer** para funcionar correctamente:

source: **SIP signalling**:
es: **Señalizacion SIP**:

source: Port 5060 (TCP/UDP)
es: Puerto 5060 (TCP/UDP)

source: Port 5061 (TCP)
es: Puerto 5061 (TCP)

source: Port 7060 (TCP/UDP) y 7061 TCP (just in case both ProxyUsers and ProxyTrunks share IP)
es: Puerto 7060 (TCP/UDP) y 7061 TCP (para casos en que ambos proxies compartan la misma dirección IP)

source: **RTP audioflow**:
es: **Flujo de audio RTP**:

source: Port range 13000-19000 UDP
es: Rango de puertos 13000-19000 UDP

source: **Web portal and provisioning**:
es: **Portal web y provisión**:

source: Ports TCP 443, 1443 y 2443
es: Puertos TCP 443, 1443 y 2443

source: We recommend using **iptables geoIP module** to drop connections from countries where we don't have any users.
es: Recomendamos emplear el **módulo GeoIP de iptales** para rechazar tráfico de paises en los que no se tenga ningun usuario.

source: Authorized company IP ranges
es: Rangos de IP autorizados por empresa

source: During the Company creating process, we skipped the security mechanism that **limits the IP addresses or ranges that the company terminals can use in their terminals**.
es: En el proceso de creación de empresas nos saltamos deliberademente un mecanismo de seguridad que **limita las direcciones IP o rangos de red que pueden utilizar las credenciales de los terminales de una empresa concreta**.

source: This can be activated in the section **Brand configuration** > **Company**:
es: Se puede activar en la sección **Configuración de Marca** > **Empresas**:

source: Rest of the users won't be allowed to connect from another network, even if the credentials are valid.
es: Todo usuario que quiera conectarse desde una red no incluida no podrá, a pesar de disponer de unas credenciales válidas.

source: Once the filter has been activated you **MUST** add networks or valid IP addresses, otherwise, all the calls will be rejected.
es: Una vez activado el filtrado, **es obligatorio** añadir redes o direcciones válidas o, por el contrario, todas las llamadas se rechazarán:

source: Both IP addresses or ranges can be used, in CIDR format (IP/mask):
es: Se pueden añadir direcciones IP y rangos de direcciones, en formato CIDR (IP/mask)

source: This mechanism limits the origin of the users of a company, it doesn't filter origin from **Contract Peerings**.
es: Este mecanismo limita los orígenes de los usuarios de una empresa, no filtra en absoluto los orígenes de los **Contratos de Peering**.

source: Roadwarrior users
es: Usuarios remotos

source: Some companies have roadwarrior users that travel often and connect from external networks, forcing Companies to disable the IP filter security mechanism.
es: Algunos usuarios de ciertas empresas viajan con mucha frecuencia y necesitan llamar desde redes externas no controladas. Estos usuarios obligan a la empresa a desactivar el mecanismo de protección de IP.

source: To solve this issue, there is a user option called **Calls for non-granted IPs** that enables these users to call from non-granted IPs while their companies are still protected with IP filter mechanism.
es: Para solventar este problema, en la sección de Usuarios existe la opción **Llamadas desde IPs no autorizadas** que permite que ciertos usuarios llamen desde redes no permitidas mientras su empresa sigue protegida con el mecanismo de protección de IP.

source: When users like theese call from non-granted IPs, their amount of concurrent outgoing calls are limited to 1, 2 or 3 to avoid being a security breach.
es: Para evitar que estos usuarios signifiquen una brecha de seguridad, el número de llamadas que pueden hacer desde redes no autorizadas se limita a 1, 2 ó 3.

source: Only calls generated by this kind of user (both internals and externals) are counted and limited, received calls are not affected by this setting (they are controlled with **MaxCalls** setting).
es: Solo se cuentan y se limitan las llamadas generadas por estos usuarios (tanto las internas como las externas), la recepción de llamadas no se ve afectada por esta funcionalidad (sí por el parámetro **Límite de llamadas**).

source: To sum up, with this feature:
es: En resumen, con esta funcionalidad:

source: There are users that are allowed to make a fixed amount of calls from non-granted IPs.
es: Ciertos usuarios pueden realizar un determinado número de llamadas desde IPs no autorizadas.

source: This calls from non-granted IPs are counted and limited.
es: Estas llamadas se cuentan y se limitan.

source: Example 1 - Company without IP check
es: Ejemplo 1 - Compañía sin mecanismo de protección de IP

source: It doesn't matter if the user is allowed to make calls from non-granted IPs, as there are no non-granted IPs.
es: Al no estar el mecanismo activado, el valor de este parámetro no aplica.

source: Example 2 - Company with IP check
es: Ejemplo 2- Compañía con mecanismo de protección de IP

source: If the user is calling from one of the allowed IPs, it doesn't matter if the user is allowed to make calls from non-granted IPs: this calls are not counted nor limited.
es: Si el usuario llamada desde una IP autorizada, el valor de este parámetro no aplica: la llamada se permite y no se cuenta.

source: If the user is NOT calling from one of the allowed IPs, it is verified the amount of calls that this user is allowed to make. If the user is allowed to make calls from non-granted IPs and has not exceeded his limit, the call is granted and counted.
es: Si el usuario llama desde una IP NO autorizada, se verifica el valor de este parámetro y, en caso de tener un valor 1, 2 ó 3 y de no haber superado este límite, la llamada se permite y se cuenta. Si no, se rechaza la llamada.

source: If **Calls for non-granted IPs** is set to *None* the user must fulfill the IP policy of his company.
es: Si el valor de **Llamadas desde IPs no autorizadas** se configura a *Ninguna* el usuario tendrá que cumplir la política de IPs de su empresa, cualquiera que sea.

source: IvozProvider comes with an *anti-flooding* mechanism to avoid that a single sender can deny the platform service by sending lots of requests. Both *proxies* (users and trunks) use this mechanism, that **limits the number of requests from an origin address in a time lapse**.
es: IvozProvider incorpora un mecanismo de *anti-flooding* que evita que un emisor sature nuestra plataforma enviando peticiones. Ambos *proxies* (usuarios y salida) incorporan este mecanismo, que **limita el número de peticiones desde un dirección origen en un tramo concreto de tiempo**.

source: When an origin reaches this limit, the proxy will stop sending responses for a period of time. After this time, the requests will be again handled normally.
es: Cuando un origen llega al límite, el proxy dejará de contestarle durante un tiempo dado. Pasado ese tiempo, volverá a contestarle con normalidad

source: Some origins are automatically excluded from this *anti-flooding* mechanism:
es: Ciertos orígenes que están automáticamente excluidos de este mecanismo de *anti-flooding*:

source: Application Servers from the platform.
es: Servidores de aplicación de la plataforma.

source: Company authorized IP addresses or ranges (see previous section).
es: IPs o rangos autorizados de empresas (ver sección anterior).

source: Global operator of the platform can also add exceptions to this mechanism in the section **Global configuration** > **Antiflood trusted IPs**.
es: El operador global puede añadir otras direcciones que queden excluidas de este mecanismo por medio del apartado **Configuración global** > **IPs de confianza**

source: Concurrent call limit
es: Límite de llamadas concurrentes

source: This mechanism limits the number of concurrent calls for a company/retail account. It can also be configured at brand level.
es: Este mecanismo limita las llamadas de un cliente (vPBX/retail). También se puede configurar a nivel de marca.

source: Brand and company/retail limits are not related anyhow. The one that is reached first will prevent new calls.
es: Los límites de marca y de empresa (vPBX/retail) no están relacionados de ninguna manera (es decir, si una marca tiene 10, la suma de llamadas de sus empresas puede sumar más de 10). Aplicará el límite que antes sea alcanzado.

source: The value configured will be used in two independent counters:
es: El valor configurado se utilizará en dos contadores independientes:

source: Calls generated by the company / retail client (e.g. user making a call)
es: Llamadas generadas por la compañía (e.g. un usuario realiza una llamada)

source: Calls received by a company / retail client (e.g. someone from the PSTN calling to a DDI)
es: Llamadas recibidas por la compañía (e.g. alguien de la PSTN llamando a un DDI de la compañía)

source: vPBX with 10 maxcalls
es: vPBX con límite de 10 llamadas

source: Their users can place 10 calls and can handle 10 external calls to their DDIs.
es: Sus usuarios pueden realizar 10 llamadas desde sus teléfonos y atender otras 10 entrantes externas a sus DDIs.

source: To disable this mechanism, set its value to 0.
es: Para desactivar este mecanismo, basta con fijar el valor a 0.
