Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/security_and_maintenance.po
Languages: es

source: Troubleshooting
es: Resolución de problemas

source: This section talks about included and non-included (but recommended and shipped in all production IvozProvider installations maintained by `Irontec <https://www.irontec.com>`_) tools to troubleshoot any problem you may have:
es: Esta sección habla sobre herramientas incluidas y no incluidas (pero recomendadas he incluidas en todas las instalaciones de IvozProvider mantenidas por `Irontec <https://www.irontec.com>`_) útiles para la resolución de cualquier problema que pueda surgir:

source: Log viewer
es: Visor de logs

source: Although all production IvozProvider installations maintained by `Irontec <https://www.irontec.com>`_ include a `ELK stack <https://www.elastic.co/elk-stack>`_, `journalctl <https://www.freedesktop.org/software/systemd/man/journalctl.html>`_ is currently the unique tool shipped with IvozProvider to inspect logs generated by different elements of the solution in the past.
es: Aunque todas las instalaciones mantenidas por `Irontec <https://www.irontec.com>`_ incluyen un visor de logs basado en un `stack ELK <https://www.elastic.co/elk-stack>`_, `journalctl <https://www.freedesktop.org/software/systemd/man/journalctl.html>`_ es la única herramientas incluida en IvozProvider que permite analizar los logs generados por los diferentes elementos que componen la solución.

source: Asterisk CLI
es: CLI de Asterisk

source: Asterisk CLI gives tons of realtime information too and are formatted beautifully to detect possible configuration errors:
es: El CLI de Asterisk proporciona mucha información realtime sobre lo que está pasando y están formateados de una forma que permite la detección rápida de errores:

source: You can access Asterisk CLI typing *ast* in the shell.
es: Para acceder a la línea de comandos de Asterisk basta con ejecutar *ast* en la consola.

source: Kamailio realtime log viewing
es: Visualización en tiempo real de logs de Kamailio

source: You can see Kamailio logs in realtime too typing *kamtail-proxyusers* and *kamtail-proxytrunks* in the shell:
es: Los logs de Kamailio se pueden ver en tiempo real ejecutando *kamtail-proxyusers* y *kamtail-proxytrunks* en la consola:

source: Other tools
es: Otras herramientas

source: Although IvozProvider does not include any of the tools mentioned here, we consider them crucial for dealing with production environments.
es: Aunque IvozProvider no incluye ninguna de las herramientas mencionadas aquí, las consideramos cruciales para diagnosticar cualquier error en entornos productivos.

source: We list here tools configured in all production IvozProvider installations maintained by `Irontec <https://www.irontec.com>`_.
es: Listamos a continuación las herramientas configuradas en los entornos productivos mantenidos por `Irontec <https://www.irontec.com>`_.

source: Metrics viewer
es: Visor de métricas

source: `Chronograf web interface <https://www.influxdata.com/time-series-platform/chronograf/>`_ showing information collected by remaining `TICK Stack components <https://www.influxdata.com/time-series-platform/>`_, allow us to show:
es: La interfaz web de `Chronograf <https://www.influxdata.com/time-series-platform/chronograf/>`_ muestra la información recolectada por el resto de componentes de `stack TICK <https://www.influxdata.com/time-series-platform/>`_:

source: Realtime system metrics.
es: Métricas de sistema en tiempo real.

source: Realtime VoIP metrics.
es: Métricas VoIP en tiempo real.

source: Custom dashboard per profile.
es: Tableros configurables por perfil.

source: `Kapacitor component <https://www.influxdata.com/time-series-platform/kapacitor/>`_ allows setting alarms when anomalous metrics happen or certain thresholds are exceeded.
es: `Kapacitor <https://www.influxdata.com/time-series-platform/kapacitor/>`_ permite configurar alarmas cuando se detectan patrones anómalos o se superan ciertos umbrales.

source: Active monitoring
es: Monitorización activa

source: All IvozProvider installations maintained by `Irontec <https://www.irontec.com>`_ are thoroughly monitored to solve problems as soon as possible and to prevent future problems when possible.
es: Todas las instalaciones de IvozProvider mantenidas por `Irontec <https://www.irontec.com>`_ se monitorizan a conciencia para anticiparse a los problemas o resolverlos tan pronto como sucedan.

source: Analyzing SIP traffic
es: Analizador de tráfico SIP

source: Although all production IvozProvider installations maintained by `Irontec <https://www.irontec.com>`_ include a `Homer SIP Capture Server <https://www.sipcapture.org/>`_, it is not installed in the standalone version of IvozProvider. The reason behind this is that we prefer awesome SIPCAPTURE stack running on an additional machine.
es: A pesar de que todos los entornos productivos mantenidos por `Irontec <https://www.irontec.com>`_ incluyen un `Homer SIP Capture <https://www.sipcapture.org/>`_, no se instala en la versión standalone de IvozProvider. El motivo por el que no se instala es porque consideramos mejor instalarlo en una máquina adicional.

source: `sngrep Ncurses SIP Messages flow viewer developed by Irontec <https://github.com/irontec/sngrep>`_ is currently the preferred tool to inspect SIP traffic included in IvozProvider.
es: El visor SIP en Ncurses `sngrep <https://github.com/irontec/sngrep>`_ desarrollado por Irontec es la herramienta preferida para analizar la señalización SIP de las llamadas de IvozProvider.

source: See live SIP traffic (all):
es: Ver todo el tráfico SIP:

source: See live SIP traffic related to calls:
es: Ver todo el tráfico SIP relacionado con llamadas:

source: See live SIP traffic and capture RTP too:
es: Ver todo el tráfico SIP y capturar el tráfico RTP asociado:

source: For more reference, visit `sngrep official site <https://github.com/irontec/sngrep>`_.
es: Para más información, visitar `la web oficial de sngrep <https://github.com/irontec/sngrep>`_.

source: Other capturing tools
es: Otras herramientas de captura

source: Although sngrep is our preferred capturing tool, IvozProvider ships other tools to capture SIP/RTP traffic, such as `tcpdump <http://www.tcpdump.org>`_ and `ngrep <http://ngrep.sourceforge.net>`_.
es: Aunque sngrep es nuestra herramienta de captura favorita, IvozProvider incluye otras herramientas para capturar tráfico SIP/RTP, como por ejemplo `tcpdump <http://www.tcpdump.org>`_ y `ngrep <http://ngrep.sourceforge.net>`_.

source: Both SIP Proxies included in IvozProvider installation, KamUsers for SIP signalling with clients and KamTrunks for SIP signalling with providers, use `PIKE module <http://kamailio.org/docs/modules/5.1.x/modules/pike.html>`_ to avoid DoS attacks.
es: Ambos SIP proxies incluidos en la instalación de IvozProvider, KamUsers para la señalización con los clientes y Kamtrunks para la señalización con proveedores, utilizan el `módulo PIKE <http://kamailio.org/docs/modules/5.1.x/modules/pike.html>`_ para evitar ataques de denegación de servicio.

source: This module keeps trace of all incoming request's IP source and blocks the ones that exceed the limit on a given time interval.
es: Este módulo controla todas los mensajes SIP recibidos de cada origen IP y bloquea aquellos orígenes que superen cierto límite en un intervalo de muestreo concreto.

source: **IPs are not blocked permanently**, they are allowed again as soon as their incoming request don't exceed the limit on upcoming time interval.
es: **Las IPs no se bloquean permanentemente**, se volverán a permitir mensajes de dichos orígenes tan pronto como transcurra un período de muestreo en el que no superen el umbral.

source: Current configuration parameters are:
es: Los parámetros actuales son:

source: **Sampling time interval**: 2 seconds.
es: **Período de muestreo**: 2 segundos.

source: **Threshold per time unit**: 30 requests.
es: **Número máximo de peticiones**: 30.

source: This means that *any IP address that sends more than 30 requests in a 2-second-time-interval will be blocked (ignored) until next 2-second-time-interval in which this origin tries less than 30 requests*.
es: Esto significa que *cualquier dirección IP que envíe más de 30 peticiones en un tramo de 2 segundos se bloqueará (ignorando sus mensajes) hasta que transcurran 2 segundos en los que el origen envíe menos de 30 peticiones*.

source: Antiflooding excluded sources
es: Orígenes excluídos del mecanismo antiflooding:

source: These sources are not evaluated against antiflood:
es: Estos orígenes no se evalúan contra el antiflood:

source: Both KamUsers and KamTrunks:
es: Tanto en KamUsers como en Kamtrunks:

source: IvozProvider components
es: Componentes internos de IvozProvider

source: IPs in :ref:`Antiflood trusted IPs`
es: IP en la sección :ref:`Antiflood trusted IPs`

source: IPs in :ref:`Clients authorized IPs <client_authorized_ip_ranges>` (vPBX, retail, residential)
es: IPs en :ref:`IPs autorizadas por cliente <client_authorized_ip_ranges>` (vPBX, retail, residencial)

source: Wholesale clients' IP addresses
es: Direcciones IPs de los clientes wholesale

source: IPs and ranges added in :ref:`Clients authorized IPs <client_authorized_ip_ranges>` will be excluded from antiflood, even if **Filter by IP address** is disabled.
es: Las direcciones IP y los rangos añadidos en :ref:`IPs autorizadas por cliente <client_authorized_ip_ranges>` se excluirán del antiflood, aunque el **Filtrado por IP** esté desactivado.

source: DDI Providers' IP addresses
es: Direcciones IP de los Proveedores de DDIs

source: On a typical NAT scenario with hundreds of UACs sharing the same public IP address, this IP should be static and should be added to :ref:`Clients authorized IPs <client_authorized_ip_ranges>` list to avoid been blocked by antiflooding (e.g. after lights out, etc.)
es: En el escenario clásico tras NAT en el que cientos de terminales SIP presentan la misma dirección IP pública, esta IP debe ser estática y debe ser añadida a :ref:`IPs autorizadas por cliente <client_authorized_ip_ranges>` para evitar que sea bloqueada por el mecanismo de antiflooding (tras un apagón eléctrico o similar).

source: Authorized IP ranges
es: Rangos de IPs autorizadas

source: :ref:`Virtual PBX clients <vPBX clients>`, :ref:`retail clients` and :ref:`residential clients` can add IP addresses or ranges (in CIDR format) with the combination of **Filter by IP address** field and **List of authorized sources** subsection.
es: Los :ref:`clientes vPBX`, :ref:`clientes retail` y :ref:`clientes residenciales` pueden añadir direcciones o rangos de direcciones IPs (en formato CIDR) con la combinación de la opción **Filtrado por IP** y la subsección **Lista de orígenes autorizados**.

source: On :ref:`wholesale clients` there is no **Filter by IP address** field as this type of clients are authenticated by IP, making filling **List of wholesale addresses** mandatory.
es: Los :ref:`clientes wholesale` no disponen de la opción **Filtrado IP** ya que este tipo de clientes se autentica por IP y hace que sea obligatorio completar la lista de direcciones IP.

source: When **Filter by IP address** is enabled, users won't be allowed to connect from another network, even if they have valid SIP credentials.
es: Cuando el **Filtrado por IP** está activado, los usuarios no podrán llamar desde otros orígenes, a pesar de tener unas credenciales SIP válidas.

source: Once the filter has been activated you **MUST** add networks or valid IP addresses, otherwise, all the calls will be rejected.
es: Una vez que el filtrado se ha activado **SE DEBEN** añadir redes o IPs válidas. En caso contrario, todas las llamadas se rechazarán.

source: Roadwarrior users
es: Usuarios remotos

source: Some vPBX clients have roadwarrior users that travel often and connect from external networks, forcing Clients to disable the IP filter security mechanism.
es: Algunos clientes vPBX tienen usuarios roadwarriors que viajan con frecuencia y se conectan desde redes externas, forzando a los clientes a deshabilitar el **Filtrado por IP**.

source: To solve this issue, there is a user option called **Calls from non-granted IPs** that enables these users to call from non-granted IPs while remaining users' credentials are still protected with IP filter mechanism.
es: Para solucionar este problema, existe una opción de usuario llamada **Llamadas desde IPs no autorizadas** que permite a ciertos usuarios realizar un número concreto de llamadas desde redes remotas, haciendo que las credenciales del resto de usuarios solo se puedan utilizar desde las redes autorizadas.

source: When users like these call from non-granted IPs, their amount of concurrent outgoing calls are limited to 1, 2 or 3 to avoid being a security breach.
es: Cuando estos usuarios llaman desde IPs no autorizadas, el número de llamadas salientes concurrentes se limitará a 1, 2 o 3, evitando que supongan una brecha de seguridad.

source: Only **generated calls** (both internals and externals) are limited, received calls are not affected by this setting.
es: Solo se limitarán las **llamadas generadas** (internas y externas), la recepción de llamadas no se verán afectadas por este parámetro.

source: To sum up, with this feature:
es: En resumen, con esta funcionalidad:

source: There are users that are allowed to make a fixed amount of calls from non-granted IPs.
es: Existen usuarios que pueden realizar un número limitado de llamadas desde IPs no autorizadas.

source: These calls from non-granted IPs are counted and limited.
es: Estas llamadas desde redes no autorizadas se cuentan y se limitan.

source: Example 1 - Client without IP check
es: Ejemplo 1 - Cliente sin Filtrado de IP

source: It doesn't matter if the user is allowed to make calls from non-granted IPs, as there are no non-granted IPs.
es: No importa si el usuario puede realizar llamadas desde redes no autorizadas, al no existir redes autorizadas.

source: Example 2 - Client with IP check
es: Ejemplo 2- Cliente con Filtrado de IP

source: If the user is calling from one of the allowed IPs, it doesn't matter if the user is allowed to make calls from non-granted IPs: this calls are not counted nor limited.
es: Si el usuario llamada desde una IP permitida, no importa si puede llamar o no desde redes no autorizadas: las llamadas desde IPs permitidas no se limitan.

source: If the user is NOT calling from one of the allowed IPs, it is verified the amount of calls that this user is allowed to make. If the user is allowed to make calls from non-granted IPs and has not exceeded his limit, the call is granted and counted.
es: Si el usuario llamada desde una IP NO autorizada, se verifica cuántas llamadas puede realizar saltándose el filtrado de IPs. Si el usuario puede realizar llamadas desde IPs no autorizadas y no ha llegado a su límite, la llamada se permite y se cuenta.

source: To sum up, if **Calls from non-granted IPs** is set to *None* the user must fulfill the IP policy of the client.
es: En resumen, si **Llamadas desde IPs no autorizadas** se configura a *Ninguna* el usuario tiene que cumplir la política de seguridad del cliente.

source: Concurrent call limit
es: Límite de llamadas concurrentes

source: This mechanism **limits the number of concurrent calls** of each client/brand.
es: Este mecanismo **limita el número de llamadas concurrentes** de cada cliente/marca.

source: Both incoming external calls and outgoing external calls will be limited.
es: Se limitan tanto las llamadas externas salientes como las entrantes.

source: It can be configured at two levels:
es: Se puede configurar a dos niveles:

source: At Brand level with **Max calls** setting.
es: A nivel de Marca con la opción **Límite de llamadas**.

source: At Client level with **Max calls** setting.
es: A nivel de Cliente con la opción **Límite de llamadas**.

source: A brand clients' *Max calls* sum may be bigger than brand's *Max calls* value, there is no control to avoid this situation.
es: La suma de los **Límites de llamadas** de todos los clientes de una marca puede superar el **Limite de llamadas** de la marca. No existe un control para evitar esta situación.

source: These counters are independent. Whenever one of this counter reaches its limit, call will be denied. This means that a call from a client that has not exceeded it own *Max call* setting may be denied if brand's limit has been exceeded.
es: Estos contadores son independientes. Cuando cualquiera de ellos llegue a su límite, la llamada se rechazará. Esto significa que una llamada de un cliente que no haya superado su límite puede ser rechazada porque su marca sí que ha llegado a su límite.

source: To disable this mechanism, set its value to 0.
es: Para desactivar este mecanismo, configurar su valor a 0.

source: Firewall
es: Cortafuegos

source: **IvozProvider does not currently include a firewall** but...
es: **IvozProvider no incluye ningún cortafuegos** pero...

source: We **strongly encourage any production installation to implement a firewall** to protect the platform from the wild Internet.
es: **Recomendamos encarecidamente implementar un cortafuegos en todo entorno productivo** para proteger la plataforma de los ataques de Internet.

source: The protection method could be:
es: El método de protección puede ser:

source: Local firewall based on `iptables <https://www.netfilter.org/>`_
es: Un firewall local basado en `iptables <https://www.netfilter.org/>`_

source: External firewall
es: Firewall perimetral

source: Both
es: Ambos

source: Exposed ports/services
es: Puertos/Servicios expuestos

source: These are the **ports IvozProvider needs to expose** to work properly:
es: Estos son los **puertos que IvozProvider necesita exponer** para funcionar correctamente:

source: **SIP signalling**:
es: **Señalización SIP**:

source: Port 5060 (TCP/UDP)
es: Puerto 5060 (TCP/UDP)

source: Port 5061 (TCP)
es: Puerto 5061 (TCP)

source: Port 7060 (TCP/UDP) y 7061 TCP (just in case both ProxyUsers and ProxyTrunks share IP)
es: Puerto 7060 (TCP/UDP) y 7061 TCP (si KamUsers y KamTrunks comparten un única IP pública)

source: **RTP audioflow**:
es: **Tráfico RTP**:

source: Port range 13000-19000 UDP
es: Rango de puertos 13000-19000 UDP

source: **Web portal and provisioning**:
es: **Acceso a portales web y provisión de terminales**:

source: Ports TCP 443, 1443 y 2443
es: Puertos TCP 443, 1443 y 2443

source: We recommend using **iptables geoIP module** to drop connections from countries where we don't have any clients.
es: Recomendamos utilizar el **módulo geoIP de iptables** para rechazar conexiones de países en los que no tengamos clientes.

source: Security
es: Seguridad

source: IvozProvider is designed to be exposed to Internet, having public IPs on some profile's NICs.
es: IvozProvider está diseñado para ser expuesto a Internet, teniendo IPs públicas directamente configuradas en las tarjetas de red de algunos perfiles.

source: This section talks about included and non-included (but recommended and shipped in all production IvozProvider installations maintained by `Irontec <https://www.irontec.com>`_) security mechanisms:
es: Esta sección habla sobre mecanismos de seguridad incluidos y no incluidos (pero recomendados he incluidos en todas las instalaciones de IvozProvider mantenidas por `Irontec <https://www.irontec.com>`_):
