Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/api_rest/multilevel.po
Languages: es

source: Multi-level API
es: API multinivel

source: IvozProvider API is divided in same three levels as the web administration portal plus user API:
es: La API de IvozProvider está dividida en los mismos tres niveles que el portal de administración web más la API de usuario:

source: Brand
es: Marca

source: Client
es: Cliente

source: User
es: Usuario

source: This split allows different roles with different responsibilities to be integrated against it without compromising security (read, edit, update or delete the data they should not).
es: Esta división permite que diferentes roles con diferentes responsabilidades se integren sin comprometer la seguridad (leer, editar, actualizar o eliminar los datos que no deberían).

source: If you check out `security policies <https://github.com/irontec/ivozprovider/blob/bleeding/web/rest/brand/config/api/raw/provider.yml>`_ (read_access_control and write_access_control attributes), you’ll see that we apply read filters and write validations based on user information (token). One single API approach would require a complex validations more prone to failure, introduce errors and require huge queries that would impact the performance.
es: Si revisas las `políticas de seguridad <https://github.com/irontec/ivozprovider/blob/bleeding/web/rest/brand/config/api/raw/provider.yml>`_ (atributos read_access_control y write_access_control), verás que aplicamos filtros de lectura y validaciones de escritura basadas en la información del usuario (token). Un enfoque de API único requeriría validaciones complejas más propensas a fallos, introducir errores y requerir consultas enormes que afectarían el rendimiento.

source: That is why we split it into three APIs with **impersonate mechanism** to move between them. This mechanism is explained in :ref:`Use Case` section.
es: Es por eso que lo dividimos en tres APIs con **mecanismo de suplantación** para moverse entre ellas. Este mecanismo se explica en la sección :ref:`Caso de Uso <Use Case>`.

source: In order to access to each level, **you will need a corresponding level URL and credentials**:
es: Para acceder a cada nivel, **necesitarás una URL y credenciales correspondientes al nivel**:

source: God API access
es: Acceso a la API God

source: Credentials: God credentials defined in :ref:`Main operators`.
es: Credenciales: Credenciales God definidas en :ref:`Operadores principales <Main operators>`.

source: Brand API access
es: Acceso a la API de Marca

source: Credentials: Brand credentials defined in :ref:`Brand operators`.
es: Credenciales: Credenciales de Marca definidas en :ref:`Operadores de marca <Brand operators>`.

source: Client API access
es: Acceso a la API de Cliente

source: Credentials: Client credentials defined in :ref:`Client operators`.
es: Credenciales: Credenciales de Cliente definidas en :ref:`Operadores de cliente <Client operators>`.

source: User API access
es: Acceso a la API de Usuario

source: Credentials: User credentials defined in :ref:`users`.
es: Credenciales: Credenciales de Usuario definidas en :ref:`usuarios <users>`.

source: All credentials usernames are unique at brand level. This is why *username + brand URL* duple is needed to identify a user (both in API and in web portal).
es: Todos los nombres de usuario de las credenciales son únicos a nivel de marca. Es por eso que se necesita el dúo *nombre de usuario + URL de la marca* para identificar a un usuario (tanto en la API como en el portal web).

source: As both brand and client URLs are internally linked to the same brand (client within that brand), it is also possible to access to client API using a brand URL + /api/client.
es: Como tanto las URLs de marca como de cliente están vinculadas internamente a la misma marca (cliente dentro de esa marca), también es posible acceder a la API de cliente usando una URL de marca + /api/client.
