Repository: irontec/ivozprovider
Catalog: portals/application/languages/*/*.po
Languages: es_es

source: Please, chose a file to import
es_es: Por favor, seleccione un fichero a importar

source: Parse file and import
es_es: Cargar fichero e importar

source: Close
es_es: Cerrar

source: Fields with * are required
es_es: Los campos con * son obligatorios

source: ignore
es_es: ignorar

source: Ignore first line.
es_es: Ignorar primera linea.

source: Yes, continue!
es_es: Si, ¡continua!

source: Import process enqueued
es_es: Proceso de importación encolado.

source: is a required field
es_es: es un campo obligatorio

source: An error occurred
es_es: Ha ocurrido un error

source: An error occurred: check files format and content.
es_es: Ha ocurrido un error: compruebe el formato y contenido de los ficheros.

source: but following errors ocurred
es_es: pero ocurrieron los siguientes errores.

source: <a download="template.txt">Download</a>
es_es: <a download="template.txt">Descargar</a>

source: Cancel
es_es: Cancelar

source: Select the brand you want to emulate.
es_es: Seleccione la marca que desea emular

source: Select Brand
es_es: Seleccione Marca

source: You have to emulate a brand to be able to emulate a company
es_es: Debe emular una marca para poder emular una compañía

source: Select the company you want to emulate
es_es: Seleccione la compañía que desea emular

source: Are you sure that you want to emulate the %s "%2s"?
es_es: ¿Quieres emular %s de %2s?

source: Cannot invoice calls from today in the future.
es_es: No se pueden crear facturas en el dia actual o futuro.

source: There are unbilled calls before in date.
es_es: Hay llamadas no facturadas anteriores a la fecha inicio.

source: Invoice has been enqueued. It will be generated as soon as posible.
es_es: La factura se ha encolado. Se generará lo antes posible.

source: Invoices enqueued:
es_es: Facturas encoladas:

source: Invoices have been enqueued. They will be generated as soon as posible.
es_es: Las facturas han sido encoladas. Se generarán lo antes posible.

source: Loading <textarea style="display: none">
es_es: Cargando <textarea style="display: none">

source: Restore default template
es_es: Restaurar plantilla por defecto

source: This template is going to be tested<br /><textarea name="currentCode" rows="8" cols="80" readonly></textarea>
es_es: La siguiente plantilla va a ser probada<br /><textarea name="currentCode" rows="8" cols="80" readonly></textarea>

source: The terminal model must be saved before you can test the code
es_es: El modelo de terminal debe ser guardado antes de probar la plantilla

source: Test the code
es_es: Probar plantilla

source: Results
es_es: Resultados

source: Tarificator Job started
es_es: Lanzada tarea de tarificación.

source: Tarificate Calls?
es_es: ¿Tarificar llamadas?

source: No Plan found
es_es: Plan no encontrado

source: Please, type a phone number
es_es: Por favor, introduzca un número de telefono

source: Please, type a duration in seconds
es_es: Por favor, introduzca una duración en segundos

source: seconds
es_es: segundos

source: Invoiced calls can't be metered again
es_es: Las llamadas facturadas no pueden ser tarificadas de nuevo

source: Please select only uninvoiced calls
es_es: Por favor seleccione solo llamadas no facturadas

source: Username
es_es: Nombre de usuario

source: Pass
es_es: Contraseña

source: Password
es_es: Contraseña

source: User
es_es: Usuario

source: Name
es_es: Nombre

source: Lastname
es_es: Apellido

source: Street
es_es: Calle

source: PostalCode
es_es: Código postal

source: Postalcode
es_es: Código postal

source: Postal code
es_es: Código postal

source: Zipcode
es_es: Código postal

source: Zip code
es_es: Código postal

source: Province
es_es: Provincia

source: City
es_es: Ciudad

source: Country
es_es: País

source: Account
es_es: Cuenta

source: Role
es_es: Rol

source: Path
es_es: Ruta

source: Size
es_es: Tamaño

source: Image
es_es: Imagen

source: Active
es_es: Activo

source: Created on
es_es: Creado

source: Starttime
es_es: Tiempo de inicio

source: Start time
es_es: Tiempo de inicio

source: Endtime
es_es: Fecha fin

source: End time
es_es: Fecha fin

source: Date
es_es: Fecha

source: Interval
es_es: Intervalo

source: Iden
es_es: Identificador

source: Value
es_es: Valor

source: Description
es_es: Descripción

source: Type
es_es: Tipo

source: Price
es_es: Precio

source: Quantity
es_es: Cantidad

source: Template
es_es: Plantilla

source: Yes
es_es: Si

source: Unassigned
es_es: Sin asignar

source: Allow
es_es: Permitir

source: List of %s
es_es: Listado de %s

source: Edit %s
es_es: Editar %s

source: List of %s %2s
es_es: Listado de %s %2s

source: Edit %s %2s
es_es: Editar %s %2s

source: Add %s
es_es: Añadir %s

source: Delete %s
es_es: Borrar %s

source: %s successfully deleted.
es_es: %s borrado satisfactoriamente.

source: Help
es_es: Ayuda

source: Access denied
es_es: Acceso denegado

source: Insert your username
es_es: Introduce tu nombre de usuario

source: Insert your username or email address
es_es: Introduzca su nombre de usuario o dirección de email

source: unlimited
es_es: ilimitado

source: oversized
es_es: sobrelimitado

source: shared
es_es: compartido

source: Destination patterns
es_es: Patrones de destinos

source: Brand is not set
es_es: Marca no seleccionada

source: Invalid value for autopause
es_es: Valor inválido para autopause

source: Invalid value for ringinuse
es_es: Valor inválido para ringinuse

source: Invalid value for type
es_es: Valor inválido

source: Invalid value for fullTargetType
es_es: Valor invalido para fullTargetType

source: Application server
es_es: Servidor de Aplicación

source: Options
es_es: Opciones

source: Queue member
es_es: Miembro de cola

source: Queue
es_es: Cola

source: Number data
es_es: Información número

source: Filters data
es_es: Información filtrado

source: Routing data
es_es: Información enrutado

source: Brand operator
es_es: Operador de Marca

source: Add %s %2s
es_es: Añadir %s %2s

source: Personal data
es_es: Datos personales

source: Login info
es_es: Información Login

source: Brand service
es_es: Servicio de marca

source: Brand URL
es_es: Portal

source: Brand
es_es: Marca

source: Basic data
es_es: Configuración básica

source: SIP domains
es_es: Dominios SIP

source: Locales
es_es: Localización

source: Invoice data
es_es: Datos de facturación

source: Mail data
es_es: Configuración mail

source: Emulate Brand %s
es_es: Emular Marca %s

source: Calendar
es_es: Calendario

source: Call ACL
es_es: Permiso llamada

source: ACL data
es_es: Datos permisos

source: Patterns
es_es: Patrones

source: Call ACL Rel rel pattern
es_es: Patrón de permisos de llamada

source: Add pattern to %2s
es_es: Añadir patrón a %2s

source: Edit pattern of %s
es_es: Editar patrón de %s

source: Call ACL Rel pattern
es_es: Patrón ACL

source: Call ACL pattern
es_es: Patrón permisos llamada

source: Add %s %2S
es_es: Añadir %s

source: Call forward setting
es_es: Opción de desvío

source: Company
es_es: Empresa

source: Server data
es_es: Configuración Servidor

source: Externally rated options
es_es: Tarificación externa

source: Emulate Company %s
es_es: Emular Compañía %s

source: Import %s
es_es: Importar %s

source: Company admin
es_es: Administrador de empresa

source: Company service
es_es: Servicio

source: Conference room
es_es: Sala de conferencias

source: Authentication data
es_es: Datos de autenticación

source: Recording data
es_es: Grabaciones

source: Additional configuration
es_es: Configuración Adicional

source: Main platform view
es_es: Vista general de la plataforma

source: Domain
es_es: Dominio

source: View %s %2s
es_es: Ver %s %2s

source: Extension
es_es: Extensión

source: External call filter rel calendar
es_es: Filtro de entrada externo

source: External call filter
es_es: Filtro de entrada externo

source: Send new %s
es_es: Enviar nuevo %s

source: Fax
es_es: Fax Virtual

source: Outbound configuration
es_es: Configuración Saliente

source: Inbound configuration
es_es: Configuración Entrante

source: List of Incoming %s %s
es_es: Listado de %s entrantes %2s

source: List of Outgoing %s %s
es_es: Listado de %s salientes %2s

source: View Incoming %s %s
es_es: Ver entrantes %s %s

source: Featuresrelbrand
es_es: Funcionalidad de Marca

source: Featuresrelcompany
es_es: Funcionalidad de Compañía

source: Fixed cost
es_es: Coste fijo

source: Fixed costs rel invoice
es_es: Coste fijo para factura

source: Outgoing Configuration
es_es: Configuración Saliente

source: Advanced Configuration
es_es: Configuración Avanzada

source: Friendspattern
es_es: Patrón de friends

source: Generic call ACL pattern
es_es: Patrón de permiso genérico

source: Holiday date
es_es: Festivo

source: Hunt group
es_es: Grupo de salto

source: No answer configuration
es_es: Configuración No Contesta

source: I v r common
es_es: IVR genérico

source: Basic configuration
es_es: Configuración básica

source: Error configuration
es_es: Configuración Error

source: I v r custom entry
es_es: IVR a medida

source: Entry information
es_es: Información de registro

source: Routing configuration
es_es: Configuración de enrutado

source: I v r custom
es_es: IVR a medida

source: Invoice template
es_es: Plantilla de factura

source: Template testing
es_es: Prueba de plantilla

source: Invoices
es_es: Facturas

source: Invoice(s)
es_es: Factura(s)

source: invoice
es_es: Factura

source: Generate %s
es_es: Genear %s

source: call
es_es: llamada

source: Tarificate %s
es_es: Tarificar %s

source: Billable call
es_es: Llamada facturable

source: Basic information
es_es: Información básica

source: Details
es_es: Detalles

source: Kam dispatcher
es_es: Balanceador

source: Trusted IP address
es_es: Dirección IP de confianza

source: Media relay
es_es: Servidor de media

source: Transformation
es_es: Transformación numérica

source: Kam trunks lcr rule target
es_es: Destino regla LCR

source: Kam trunks uacreg
es_es: Registro saliente

source: Main Settings
es_es: Configuración principal

source: Optional Settings
es_es: Configuraciones Opcionales

source: Authorized source
es_es: Red autorizada

source: Language
es_es: Lenguaje

source: Lcr rule
es_es: Regla LCR

source: Locution
es_es: Locución

source: Main operator
es_es: Operador de Plataforma

source: Media relay set
es_es: Servidor de Media

source: Music on hold
es_es: Música en espera

source: Outgoing routing
es_es: Ruta saliente

source: Call destination
es_es: Destino llamada

source: Outgoing route
es_es: Enrutado saliente

source: Failover and load-balancing
es_es: Contingencia y balanceo de carga

source: Call registry
es_es: Registro de llamada

source: Type of call
es_es: Tipo de llamada

source: Call parties
es_es: Participantes

source: Refer information
es_es: Información sobre transferencias

source: Forwarding information
es_es: Información desvío

source: Additional information
es_es: Información adicional

source: Peer server
es_es: Servidor

source: Basic Settings
es_es: Configuración básica

source: Authentication Settings
es_es: Opciones de Autenticación

source: Source number header
es_es: Cabecera de Origen de llamada

source: R-URI customization pre-transformations
es_es: Transformaciones R-URI previas a las transformaciones numéricas

source: From optional customization
es_es: Personalización de la cabecera From

source: Peering contract
es_es: Contrato de Peering

source: Transformation ruleset groups trunk
es_es: Transformación numérica

source: Pick up group
es_es: Grupo de captura

source: Pricing plan
es_es: Plan de precio

source: Target pattern
es_es: Patron de destino

source: Find a %s
es_es: Encontrar un %s

source: Test %s
es_es: Probar %s

source: <p><b>Metric:</b> In case that two pricing plans were matched plan with lower metric will be applied.</p>
es_es: <p><b>Métrica:</b> En caso de que multiples planes de precio apliquen, se empleará el de menor métrica.</p>

source: price
es_es: Precio

source: Do you want to delete this %s from %2s?
es_es: ¿Quieres eliminar %s de %2s?

source: Simulate a call
es_es: Simular una llamada

source: Proxy trunk
es_es: Proxy de Salida

source: Basic Info
es_es: Configuración básica

source: Proxy user
es_es: Proxy de Usuarios

source: Queuemember
es_es: Miembro de cola

source: Announce
es_es: Anuncio

source: Members configuration
es_es: Configuración miembros

source: Timeout configuration
es_es: Configuración no contesta

source: Full Queue configuration
es_es: Configuración Cola llena

source: Recording
es_es: Grabación

source: Routing pattern group
es_es: Grupo de patrones de destino

source: Routing pattern groups rel pattern
es_es: Patrón de destino

source: Routing pattern
es_es: Patrón de destino

source: Schedule
es_es: Horario

source: Service
es_es: Servicio

source: Pricing pattern
es_es: Patrón de precio

source: Terminal manufacturer
es_es: Fabricante de Terminales

source: Terminal model
es_es: Model de Terminales

source: Load file
es_es: Cargar fichero

source: Restore last backup
es_es: Restaurar último backup

source: Login Info
es_es: Información de login

source: Connection Info
es_es: Configuración de conexión

source: Provisioning Info
es_es: Provisioning

source: Timezone
es_es: Zona Horaria

source: Numeric transformation group
es_es: Grupo de transformaciones numéricas

source: Automatic creation of rules
es_es: Creación automática de reglas

source: Caller In transformations
es_es: Transf. Llamante Entrada

source: Callee In transformations
es_es: Transf. Llamado Entrada

source: Caller Out transformations
es_es: Transf. Llamante Salida

source: Callee Out transformations
es_es: Transf. Llamado Salida

source: Boss-Assistant
es_es: Jefe Asistente

source: Voicemail
es_es: Buzón de voz

source: hunt group
es_es: Grupo de Captura

source: Join to %s %2s
es_es: Unirse a %s %2s

source: Edit Join of %s
es_es: Editar Union de %s

source: Need help?
es_es: ¿Necesita ayuda?

source: Templates help
es_es: Ayuda sobre plantillas

source: Advanced Setting, read carefully
es_es: Opciones avanzadas, leer cuidadosamente

source: There is an inconditional call forward with that call type. You can't add call forwards
es_es: Existe un desvío incondicional con ese tipo de llamada. No puedes añadir desvíos.

source: There are already call forwards with that call type. You can't add inconditional call forward
es_es: Ya existen desvíos con ese tipo de llamada. No puedes añadir un desvío incondicional.

source: There is already a busy call forward with that call type.
es_es: Ya existe un desvío si ocupado con ese tipo de llamada.

source: There is already a noAnswer call forward with that call type.
es_es: Ya existe un desvío si no contesta con ese tipo de llamada.

source: There is already a userNotRegistered call forward with that call type.
es_es: Ya existe un desvío si usuario no registrado con ese tipo de llamada.

source: Error reloading modules. Please reload modules manually.
es_es: Error recargando módulos. Por favor recarge módulos manualmente.

source: There is a call forward with that call type. You can't add this call forward
es_es: Existe un desvío de llamada con ese tipo de llamada. No puedes añadir este desvío.

source: 'Valid From' must be earlier than 'Valid to'
es_es: 'Válido desde' debe ser anterior a 'Válido hasta'

source: You can't create a pricing plan that starts in de past
es_es: No es posible crear un Plan de precios en el pasado

source: There are unmetered calls.
es_es: Hay llamadas no tarificadas.

source: There are invoices in the same range of date.
es_es: Ya existen facutras en el mismo rango de fechas.

source: There are unbilled calls after out date.
es_es: Hay llamadas no facturadas posteriores a la fecha fin.

source: 'Out date' must be equal or greater than 'In date'.
es_es: 'Fecha fin' debe ser igual o mayor que 'fecha inicio'.

source: Invalid IP address, discarding value.
es_es: Dirección IP inválida: el valor será ignorado.

source: Wrong mask, discarding value.
es_es: Máscara de red inválida: el valor será ignorado.

source: Wrong mask, it should be at least /24.
es_es: Máscara invalida. Debería ser al menos /24

source: When Outbound Proxy is used, SIP Proxy must not include a port.
es_es: Cuando se emplea Proxy de salida, el Proxy SIP no debe incluir puerto.

source: Template field can not be null.
es_es: El campo plantilla no puede estar vacio.

source: Platform Configuration
es_es: Configuración de Plataforma

source: Antiflood trusted IP
es_es: IP de confianza

source: Parsed CDR
es_es: Histórico de llamadas

source: Brand Configuration
es_es: Configuración de Marca

source: Brands
es_es: Marcas

source: Portal URL
es_es: URL Portal

source: Numeric transformation
es_es: Transformación numérica

source: Outgoing Routing
es_es: Ruta saliente

source: Pricing Plan
es_es: Plan de precios

source: Invoice templates
es_es: Plantillas de facturas

source: Company Configuration
es_es: Configuración de Empresa

source: Admin
es_es: Adminsitrador

source: IVR common
es_es: IVR Génerico

source: IVR custom
es_es: IVR a medida

source: Faxes
es_es: Fax

source: Control Panel
es_es: Panel de control

source: Ip
es_es: Dirección IP

source: Transport
es_es: Transporte

source: Member
es_es: Miembro

source: Penalty
es_es: Prioridad

source: Companyid
es_es: Compañia

source: Autopause
es_es: Autopausar

source: yes
es_es: Si

source: Strategy
es_es: Estrategia

source: leastrecent
es_es: Menos reciente

source: fewestcalls
es_es: Menos atendidas

source: random
es_es: Aleatoriamente

source: rrmemory
es_es: Secuencialmente (memoria)

source: linear
es_es: Secuencialmente (una vez)

source: rrordered
es_es: Round Robin

source: Weight
es_es: Peso

source: Service id
es_es: Servicio

source: Brand id
es_es: Marca

source: Code
es_es: Código

source: Klear theme
es_es: Tema de Klear

source: User theme
es_es: Tema

source: Url type
es_es: Tipo

source: brand
es_es: Marca

source: admin
es_es: Administrador

source: user
es_es: Usuario

source: Delete file
es_es: Borrar fichero

source: Trunks SIP domain
es_es: Dominio SIP

source: Default timezone
es_es: Zona horaria

source: Postal address
es_es: Dirección postal

source: Town
es_es: Ciudad

source: Registry data
es_es: Información de registro

source: From name
es_es: Nombre a mostrar

source: Name shown as source when sending mails (e.g. IvozProvider Notifications). Leave empty to disable.
es_es: Nombre mostrado como origen en los correos salientes (e.g. Notificaciones IvozProvider).

source: From address
es_es: Dirección origen

source: Mail address shown as source when sending mails. MTA must allow this value.
es_es: Dirección origen mostrada en los correos salientes. El MTA tiene que permitir este valor.

source: Max disk usage (in MB)
es_es: Máximo espacio en disco (en MB)

source: Max disk usage in megabytes this brand can use. When limit has been reached, oldest brand's recordings will be removed. Set to zero to allow unlimited disk usage.
es_es: Máximo espacio en megabytes que puede emplear esta marca. Una vez alcanzado el límite, las grabaciones más antiguas de la marca serán eliminadas. Introducir cero para permitir uso ilimitado.

source: Disk usage
es_es: Uso de disco

source: Disk usage notification email
es_es: Notificaciones de uso de disco

source: Email address that will be notified when 80% of the configured limit has been reached.
es_es: Dirección email que será notificada cuando se alcance el 80% del límite configurado.

source: Default policy
es_es: Acción por defecto

source: allow
es_es: Permitir

source: deny
es_es: Rechazar

source: Call ACL Patterns
es_es: Patrón permisos llamada

source: Priority
es_es: Prioridad

source: Policy
es_es: Acción

source: Reg exp
es_es: Expr. regular

source: User id
es_es: Usuario

source: Call type
es_es: Tipo de llamada

source: internal
es_es: interna

source: external
es_es: externa

source: both
es_es: ambas

source: Call forward type
es_es: Tipo desvío

source: inconditional
es_es: Incondicional

source: noAnswer
es_es: Perdida

source: busy
es_es: Ocupado

source: userNotRegistered
es_es: No registrado

source: Target type
es_es: Tipo de ruta

source: number
es_es: Número

source: extension
es_es: Extensión

source: voicemail
es_es: Buzón de voz

source: Number value
es_es: Número

source: Voice mail user
es_es: Buzón de voz

source: No answer timeout
es_es: Timeout no contesta

source: Id
es_es: Identificador

source: Application server id
es_es: AS

source: Dispatch to any AS
es_es: Enrutar a cualquier AS

source: External max call
es_es: Lim. llamadas

source: Invoice language
es_es: Lenguaje factura

source: Outbound prefix
es_es: Prefijo de salida

source: Country code
es_es: Código de País

source: Areacode
es_es: Código de Area

source: Default Area code for users in this company
es_es: Código de Area por defecto para los usuarios de esta compañía

source: Media relay Set
es_es: Servidores de Media

source: Filter by IP address
es_es: Filtrado por IP

source: Add IPs or network if enabled. Otherwise all calls will be rejected.
es_es: Si el filtro esta habilitado, añada IPs o redes, sino todas las llamadas serán rechazadas.

source: On-demand call recording
es_es: Grabación bajo demanda

source: Disabled
es_es: Deshabilitado

source: Using BXFER or INFO
es_es: Empleando BXFER o INFO

source: Using DTMFs (read WARNING)
es_es: Empleando DTMFs (lea la advertencia)

source: Externally rater custom options
es_es: Opciones adicionales tarificación externa

source: Max disk usage in megabytes this company can use. When limit has been reached, oldest recordings will be removed. Leave empty to allow unlimited disk usage.
es_es: Máximo espacio en megabytes que puede emplear esta compañía. Una vez alcanzado el límite, las grabaciones más antiguas de la compañía serán eliminadas. Introducir cero para permitir uso ilimitado.

source: Company id
es_es: Compañia

source: Timezone id
es_es: Zona horaria

source: Pin protected
es_es: Con contraseña

source: Pin code
es_es: Contraseña

source: Max member
es_es: Miembros máximos

source: Zone
es_es: Zona

source: Calling code
es_es: Código postal

source: External call filter id
es_es: Filtro de entrada

source: Route type
es_es: Enrutar

source: IVRCommon
es_es: IVR Genérico

source: IVRCustom
es_es: IVR a medida

source: huntGroup
es_es: Grupo de Salto

source: ConferenceRoom
es_es: Sala de Conferencias

source: Record call
es_es: Grabar llamada

source: inbound
es_es: entrante

source: outbound
es_es: saliente

source: Local legislation may enforce to announce the call recording to both parties, act responsibly
es_es: La legislación vigente obliga a avisar a los participantes antes de grabar, actúa con responsabilidad.

source: Displayname
es_es: Texto en pantalla

source: This value will be displayed in the called terminals
es_es: Valor que se mostrará en el terminal llamado

source: I v r common id
es_es: IVR Genérico

source: I v r custom id
es_es: IVR a medida

source: Hunt group id
es_es: Grupo de salto

source: Fax id
es_es: Fax

source: Target
es_es: Destino

source: Peering contract id
es_es: Contrato de Peering

source: Country id
es_es: País

source: Company's default
es_es: Usar configuración empresa

source: Scope
es_es: Ámbito

source: company
es_es: Empresa

source: Points to
es_es: Direcciona a

source: proxyusers
es_es: Proxy de Entrada

source: proxytrunks
es_es: Proxy de Salida

source: Number
es_es: Número

source: Filter id
es_es: Filtro

source: Calendar id
es_es: Calendario

source: Schedule id
es_es: Calendario

source: Welcome locution
es_es: Locución Bienvenida

source: Holiday locution
es_es: Locución Festivo

source: Out of schedule locution
es_es: Locución fuera horario

source: Holiday target type
es_es: Tipo desvío festivo

source: Holiday number
es_es: Número

source: Holiday extension
es_es: Extensión

source: Holiday voice mail user
es_es: Buzón de voz
