Repository: irontec/ivozprovider
Catalog: portals/application/languages/*/*.po
Languages: es_es

source: Out of schedule target type
es_es: Tipo desvío fuera horario

source: Out of schedule number
es_es: Número

source: Out of schedule extension
es_es: Extensión

source: Out of schedule voice mail user
es_es: Buzón de voz

source: Schedules
es_es: Horarios

source: Caledars
es_es: Calendario

source: Holiday target
es_es: Destino Festivo

source: Out of schedule target
es_es: Destino si fuera horario

source: Black list reg exp
es_es: Expresion regular lista negra

source: Incoming numbers that match this expression will be always REJECTED without checking this filter configuration.
es_es: Los orígenes que cumplan la expresión regular se RECHAZARÁN sin verificar la configuración de este filtro.

source: White list reg exp
es_es: Expresión regular lista blanca

source: Incoming numbers that match this expression will be always ACCEPTED without checking this filter configuration.
es_es: Los orígenes que cumplan la expresión regular se ACEPTARÁN sin verificar la configuración de este filtro.

source: Send by email
es_es: Enviar por email

source: Outgoing DDI
es_es: DDI de salida

source: Calldate
es_es: Fecha

source: Source
es_es: Origen

source: Destination
es_es: Destino

source: In
es_es: Entrada

source: Out
es_es: Salida

source: Page
es_es: Páginas

source: pending
es_es: Pendiente

source: completed
es_es: Completado

source: inprogress
es_es: En curso

source: Brandid
es_es: Marca

source: Cost
es_es: Coste

source: Invoice id
es_es: Factura

source: e.g. 8.8.8.8
es_es: por. ej. 8.8.8.8

source: Port
es_es: Puerto

source: Auth needed
es_es: Requiere autenticación

source: Minimal length 10, including 3 uppercase letters, 3 lowercase letters, 3 digits and one character in '!@#$%^&*()-+'
es_es: Mínima longitud 10, incluyendo 3 letras en mayúsculas, 3 en minúsculas, 3 dígitos y un caracter especial '!@#$%^&*()-+'

source: Allow all outgoing calls
es_es: Permitir todas las llamadas salientes

source: Disallowed codecs
es_es: Codecs rechazados

source: Allowed codecs
es_es: Codecs permitidos

source: CallerID update method
es_es: Modo actualización

source: Update CallerID?
es_es: ¿Actualización Pantalla?

source: Direct connectivity
es_es: Conectividad Directa

source: Listen to MoH
es_es: Escuchar Música

source: Event date
es_es: Fecha evento

source: ringAll
es_es: A todos

source: Linear (once)
es_es: Secuencialmente (una vez)

source: roundRobin
es_es: Secuencialmente (∞)

source: Ring all timeout
es_es: Tiempo máximo sonando

source: Timeout target type
es_es: Enrutado timeout

source: No answer locution id
es_es: Loc. No contesta

source: Timeout number value
es_es: Número

source: Timeout extension id
es_es: Extensión

source: Timeout voice mail user id
es_es: Buzón de voz

source: Timeout time
es_es: Timeout

source: Welcome locution id
es_es: Loc. Bienvenida

source: Error locution id
es_es: Loc. Error

source: Success locution id
es_es: Loc. Éxito

source: Time in seconds the IVR will wait after playing the welcome locution or dialing a digit
es_es: Tiempo en segundos que el IVR esperará tras reproducir la locucion de bienvenida o presionar un dígito.

source: Max digits
es_es: Longitud máxima

source: Max number of digits the caller can enter. Set to 0 to disable.
es_es: Número máximo de dígitos que el llamante puede introducir. 0 para deshabilitar.

source: Error target type
es_es: Enrutado error

source: Error number value
es_es: Número

source: Error extension id
es_es: Extensión

source: Error voice mail user id
es_es: Buzón de voz

source: Timeout target
es_es: Destino si timeout

source: Error target
es_es: Destino error

source: Entry
es_es: Entrada

source: Target number value
es_es: Número

source: Target extension id
es_es: Extensión

source: Target voice mail user id
es_es: Buzón de voz

source: In date
es_es: Fecha inicio

source: Out date
es_es: Fecha fin

source: Tax rate
es_es: Impuesto

source: Total with tax
es_es: Total con Impuesto

source: waiting
es_es: Esperando

source: processing
es_es: Procesando

source: created
es_es: Creado

source: Pdf file
es_es: Fichero PDF

source: Fixed costs
es_es: Costes fijos

source: Duration
es_es: Duración

source: Caller
es_es: Llamante

source: Callee
es_es: Llamado

source: Callidhash
es_es: Hash

source: Peeringcontractid
es_es: Contrato de Peering

source: Externallyrated
es_es: Tarificación externa

source: Metered
es_es: Tarificado

source: Pricingplanname
es_es: Nombre

source: Targetpatternid
es_es: Patrón de destino

source: Targetpatternname
es_es: Patrón de destino

source: As address
es_es: Direccion Servidor de Aplicación

source: Externally rated
es_es: Tarificación externa

source: Metering date
es_es: Fecha de tarificación

source: Pricing plan id
es_es: Plan de precios

source: Attr
es_es: Descripción

source: IP
es_es: Dirección IP

source: Numeric value
es_es: Valor numérico

source: e.g. udp:127.0.0.1:22222
es_es: p.ej. udp:127.0.0.1:22222

source: Media relay sets id
es_es: Servidor de media

source: Ip addr
es_es: Dirección IP

source: Mask
es_es: Máscara

source: Pr
es_es: Prioridad

source: Match op
es_es: Operador

source: Match exp
es_es: Buscar

source: Match len
es_es: Longitud

source: Subst exp
es_es: Substituir

source: Repl exp
es_es: Reemplazar

source: Did
es_es: DDI

source: Domain id
es_es: Dominio

source: Last modified
es_es: Última modificación

source: Lcr id
es_es: LCR

source: Prefix
es_es: Prefijo

source: Stopper
es_es: No continuar

source: Enabled
es_es: Habilitado

source: L username
es_es: Nombre de usuario

source: Auth username
es_es: Usuario

source: Registrar Server URI
es_es: URI Servidor de registro

source: Uri scheme
es_es: Esquema URI

source: Outgoing routing id
es_es: Ruta de salida

source: Pattern
es_es: Patrón

source: Uploaded file
es_es: Fichero original

source: File for play
es_es: Fichero convertido

source: Group
es_es: Grupo

source: Select destination pattern
es_es: Patrón destino

source: Select destination group
es_es: Grupo patrones destino

source: Dialed number
es_es: Número marcado

source: Strip N digits from the beginning of the callee
es_es: Quitar N dígitos del número destino

source: Prepend this field to callee (after stripping)
es_es: Añadir este campo como prefijo del número destino (después de quitar los dígitos del campo Strip)

source: Send PAI
es_es: Enviar PAI

source: Send RPID
es_es: Enviar RPID

source: Auth password
es_es: Contraseña

source: Transformation ruleset groups trunks
es_es: Transformacion numérica

source: Users
es_es: Usuarios

source: Pick up group id
es_es: Grupo de captura

source: Pricing plan name
es_es: Nombre

source: Valid from
es_es: Válido desde

source: Valid to
es_es: Válido hasta

source: Metric
es_es: Métrica

source: Connection charge
es_es: Coste de conexión

source: Charge period
es_es: Período de facturación

source: Per minute charge
es_es: Coste por minuto

source: In case that two patterns were matched pattern with lower metric will be applied.
es_es: En caso de que múltiples patrones apliquen, se empleará el que tenga menor métrica.

source: Price pattern
es_es: Patrón de precio

source: Members of lower penalty will be called first. Higher penalty members will be contacted if no members of current penalty are available
es_es: Los miembros con menor prioridad serán llamados primero. Si no hay miembros disponibles en una prioridad, se contactarán a los miembros de la siguiente prioridad.

source: Max wait time
es_es: Tiempo máximo en cola

source: If no queue member answers before time this seconds, the timeout queue logic will be activated. Leave empty to disable.
es_es: Si ningún miembro de la cola contesta en estos segundos, se activará la lógica de no contesta. Dejar vacío para deshabilitar.

source: Timeout Locution
es_es: Locución no contesta

source: Timeout route
es_es: Enrutar no contesta

source: Timeout number
es_es: Número

source: Timeout Extension
es_es: Extensión

source: Timeout VoiceMail
es_es: Buzón de voz

source: Max queue length
es_es: Tamaño cola

source: Max number of unattended calls that this queue can have. When this value has been reached, full queue logic will be activated on new calls. Leave empty to disable.
es_es: Número máximo de llamadas sin atender que pueden esperar en la cola. Cuando se ha alcanzado este valor, se activará el tratamiento cola llena para las nuevas llamadas. Dejar vacío para deshabilitar.

source: Full queue Locution
es_es: Locución cola llena

source: Full queue route
es_es: Ruta cola llena

source: Full number
es_es: Número

source: Full extension
es_es: Extensión

source: Full voicemail
es_es: Buzón de voz

source: Periodic Annouce Locution
es_es: Locución periódica

source: Locution periodically played to calls that are queued
es_es: Reproduce periódicamente una locución a las llamadas esperando en la cola

source: Periodic Announce Frequency
es_es: Frecuencia locución periódica

source: Member rest seconds
es_es: Descanso miembro

source: Time in seconds that member won't be disturbed after attending a queue call
es_es: Tiempo en segundos que el miembro no será molestado tras atender una llamada de cola

source: Member call seconds
es_es: Duración llamada a miembro

source: Time in seconds queue calls will ring members
es_es: Tiempo en segundos que se llamará a cada miembro de la cola

source: Ring All
es_es: A todos

source: Least recent
es_es: Menos reciente

source: Fewest Calls
es_es: Menos atendidas

source: When one member is part of multiples queues, calls from queues with higher weight will be attended first
es_es: Cuando un miembro está en varias colas, se atenderán primero las llamadas de las colas con mayor peso

source: On-demand
es_es: Bajo demanda

source: Recorded file
es_es: Fichero grabado

source: Listen to File
es_es: Escuchar fichero

source: Routing pattern id
es_es: Patrón

source: Routing pattern group id
es_es: Grupo de patrones

source: Time in
es_es: Inicio

source: Time out
es_es: Fin

source: Monday
es_es: Lunes

source: Tuesday
es_es: Martes

source: Wednesday
es_es: Miércoles

source: Thursday
es_es: Jueves

source: Friday
es_es: Viernes

source: Saturday
es_es: Sábado

source: Sunday
es_es: Domingo

source: Prefix must be numeric-only
es_es: El prefijo debe ser numérico

source: Generic URL Pattern
es_es: Patrón de URL genérica

source: Generic template
es_es: Plantilla genérica

source: Use <strong>$this->terminalModel</strong> to access the model data.
es_es: Usar <strong>$this->terminalModel</strong> para acceder a los datos del modelo. En caso de error, para saber la línea exacta en la que se encuentra hay que restarle 70 a la línea devuelta en el mensaje.

source: Specific URL Pattern
es_es: Patrón de URL específica

source: Variable part of the URL is enclosed between braces, p.e. /t26p/{mac}.cfg
es_es: La parte variable de la url se pone entre llaves, por ejemplo /t26p/{mac}.cfg

source: Use <string>$this->terminalModel</strong> to access model data, <strong>$this->terminal</strong> to access terminal data, <strong>$this->user</strong> for the user and <strong>$this->company</strong> for the company.
es_es: Usar <strong>$this->terminalModel</strong> para acceder a los datos del modelo, <strong>$this->terminal</strong> para los datos del terminal, <strong>$this->user</strong> para el usuario y <strong>$this->company</strong> para la empresa. En caso e error, para saber la línea exacta en la que se encuentra hay que restarle 70 a la línea devuelta en el mensaje.

source: Terminal model id
es_es: Modelo de terminal

source: Last provision date
es_es: Última provisión

source: Comment
es_es: Comentario

source: Time zone label
es_es: Zona Horaria

source: Caller in
es_es: Llamante entrante

source: Callee in
es_es: Llamado entrante

source: Caller out
es_es: Llamante saliente

source: Callee out
es_es: Llamado saliente

source: Generate rules?
es_es: ¿Generar reglas?

source: International Code
es_es: Código de llamada internacional

source: National number length
es_es: Longitud números nacionales

source: Do not disturb
es_es: No molestar

source: Is boss
es_es: Jefe

source: Assistant
es_es: Asistente

source: Exception boos assistant reg exp
es_es: Whitelist jefe/asistente

source: Max call
es_es: Límite llamadas

source: Call waiting
es_es: Llamada en espera

source: Voicemail enabled
es_es: Buzón de voz

source: Voicemail send mail
es_es: Notificar por email

source: Voicemail attach sound
es_es: Adjuntar audio del mensaje

source: Pick Up Groups
es_es: Grupos de captura

source: Hunt groups joinned
es_es: Grupos de salto

source: Module
es_es: Módulo

source: Mapper name
es_es: Nombre mapper
