Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/client/vpbx/routing_tools/calendars.po
Languages: es

source: Calendars
es: Calendarios

source: Calenders are used to define what days are considered as holiday. Like schedules, multiples calendars can be combined.
es: Los calendarios se utilizan para definir qué días se consideran festivos. Al igual que los horarios, se pueden combinar múltiples calendarios.

source: Calendar Holidays
es: Festivos del calendario

source: Calendar creation process only requires a name. Once created, we can add what days will be holidays using the buttons in its row:
es: El proceso de creación del calendario solo requiere un nombre. Una vez creado, podemos agregar qué días serán festivos usando los botones en su fila:

source: Name
es: Nombre

source: Unique name to identify this holiday date
es: Nombre único para identificar esta fecha festiva

source: Locution
es: Locución

source: Override default External call filter holiday locution
es: Sobrescribir la locución festiva predeterminada del filtro de llamadas externas

source: Event Date
es: Fecha del evento

source: Day of the calendar to be marked as holiday
es: Día del calendario que se marcará como festivo

source: Whole day event
es: Evento de todo el día

source: Enable this to create an event that lasts all the day
es: Habilite esto para crear un evento que dure todo el día

source: Time In/Time out
es: Hora de inicio/fin

source: For not whole day events, specify the time interval the event will be active
es: Para eventos que no duran todo el día, especifique el intervalo de tiempo en que el evento estará activo

source: Routing options
es: Opciones de enrutamiento

source: Override default External call filter holiday routing
es: Sobrescribir el enrutamiento festivo predeterminado del filtro de llamadas externas

source: Calendars logic is opposite to Schedulers: If a day is not defined as holiday in any of the calendars, it will considered a normal day and no filtering will be applied.
es: La lógica de los calendarios es opuesta a la de los horarios: Si un día no está definido como festivo en ninguno de los calendarios, se considerará un día normal y no se aplicará ningún filtro.

source: Holidays without special locutions will apply the external call filter holiday locution.
es: Los festivos sin locuciones especiales aplicarán la locución festiva del filtro de llamadas externas.

source: Holidays without special routing will apply the external call filter holiday routing.
es: Los festivos sin enrutamiento especial aplicarán el enrutamiento festivo del filtro de llamadas externas.

source: In addition, once a date has been created, there is the possibility of importing more dates from a file. This option is found in the date list menu and is called *Import from CSV*. Also a range of dates may be added with *Add Holiday date range* menu option.
es: Además, una vez creada una fecha, existe la posibilidad de importar más fechas desde un archivo. Esta opción se encuentra en el menú de la lista de fechas y se llama *Importar desde CSV*. También se puede agregar un rango de fechas con la opción de menú *Agregar rango de fechas festivas*.

source: CSV Import Format
es: Formato de importación CSV

source: This option is found in the date list menu and is called *Import from CSV*.
es: Esta opción se encuentra en el menú de la lista de fechas y se llama *Importar desde CSV*.

source: The CSV file for importing holidays must contain the following columns *(Fields marked with * are required )*:
es: El archivo CSV para importar los festivos debe contener las siguientes columnas (Campos marcados con * son requeridos):

source: Name*
es: Nombre*

source: Name of the holiday
es: Nombre del festivo

source: Date*
es: Fecha*

source: Event date in YYYY-MM-DD format
es: Fecha del evento en formato YYYY-MM-DD

source: The columns must be separated by semicolons (;) and strings must be enclosed in double quotes (""). The escape character is backslash (\\).
es: Las columnas deben estar separadas por puntos y comas (;) y las cadenas deben estar encerradas en comillas dobles (""). El carácter de escape es la barra invertida (\\).

source: Example CSV file
es: Ejemplo de fichero CSV

source: Special schedules
es: Horarios especiales

source: Calendars can also be used to override some time periods with a different schedule. This can be handy if vPBX has a summer schedule or other types of schedule based events.
es: Los calendarios también se pueden usar para sobrescribir algunos períodos de tiempo con un horario diferente. Esto puede ser útil si vPBX tiene un horario de verano u otros tipos de eventos basados en horarios.

source: Special schedules can define a custom Scheduler and override External Call filters configurations:
es: Los horarios especiales pueden definir un programador personalizado y sobrescribir las configuraciones de los filtros de llamadas externas:

source: Start Date
es: Fecha de inicio

source: Since when the schedules will override the filters configuration
es: Desde cuándo los horarios sobrescribirán la configuración de los filtros

source: End Date
es: Fecha de fin

source: Last day of the period (included)
es: Último día del período (incluido)

source: Schedules
es: Horarios

source: Schedules that will be used in the defined period
es: Horarios que se utilizarán en el período definido

source: In case of Out of schedule, this locution that will be played. Leave empty to use External call filter's locution.
es: En caso de fuera de horario, esta locución se reproducirá. Dejar vacío para usar la locución del filtro de llamadas externas.

source: Route options
es: Opciones de ruta

source: Override default external call filter Out of schedule options
es: Sobrescribir las opciones predeterminadas del filtro de llamadas externas fuera de horario

source: Difference between non-whole day event and special schedules
es: Diferencia entre evento de no todo el día y horarios especiales

source: In order to understand the difference between these two features it is important to know the order of call filter logic:
es: Para entender la diferencia entre estas dos características, es importante conocer el orden de la lógica del filtro de llamadas:

source: **1. Is current day marked as holiday?**
es: **1. ¿Está marcado el día actual como festivo?**

source: This is where non-whole day event applies, making the answer to the question above possitive during defined period.
es: Aquí es donde se aplica el evento de no todo el día, haciendo que la respuesta a la pregunta anterior sea positiva durante el período definido.

source: Yes: apply holiday logic defined in the calendar event or in External Call Filter.
es: Sí: aplicar la lógica festiva definida en el evento del calendario o en el filtro de llamadas externas.

source: No: proceed to question 2.
es: No: proceder a la pregunta 2.

source: **2. Is current time marked as out-of-schedule?**
es: **2. ¿Está marcada la hora actual como fuera de horario?**

source: This is where special schedules applies, overriding schedules of External Call Filter with the one defined in calendar period.
es: Aquí es donde se aplican los horarios especiales, sobrescribiendo los horarios del filtro de llamadas externas con el definido en el período del calendario.

source: Yes: apply out-of-schedule logic defined in the special schedules or in External Call Filter.
es: Sí: aplicar la lógica fuera de horario definida en los horarios especiales o en el filtro de llamadas externas.

source: No: proceed with standard logic.
es: No: proceder con la lógica estándar.

source: Example
es: Ejemplo

source: Configuration of a given day:
es: Configuración de un día dado:

source: Non-whole day event: 8:00-15:00
es: Evento de no todo el día: 8:00-15:00

source: Special schedule: 13:00-17:00
es: Horario especial: 13:00-17:00

source: Cases:
es: Casos:

source: Call at 7:00: out of schedule due to special schedule.
es: Llamada a las 7:00: fuera de horario debido a horario especial.

source: Call at 9:00: holiday logic due to non-whole day event.
es: Llamada a las 9:00: lógica festiva debido a evento de no todo el día.

source: Call at 14:00: holiday logic due to non-whole day event.
es: Llamada a las 14:00: lógica festiva debido a evento de no todo el día.

source: Call at 16:00: normal logic.
es: Llamada a las 16:00: lógica normal.

source: Call at 18:00: out of schedule due to special schedule.
es: Llamada a las 18:00: fuera de horario debido a horario especial.
