Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/billing/destination_rates.po
Languages: es

source: Destination Rates
es: Tarifas de Destino

source: A *Destination rate* groups some prefixes with their cost details.
es: Una *tarifa de destino* agrupa algunos prefijos con sus detalles de costo.

source: They only have two fields:
es: Solo tienen dos campos:

source: Name
es: Nombre

source: Name to reference the destination rate
es: Nombre para referenciar la tarifa de destino

source: Description
es: Descripción

source: Additional details
es: Detalles adicionales

source: Currency
es: Moneda

source: All rates imported/added will use this currency
es: Todas las tarifas importadas/agregadas usarán esta moneda

source: Deductible Connection Fee
es: Tarifa de Conexión Deducible

source: Set to 'No' for typical fee charged at call establishment. Set to 'Yes' to enable minimal-cost-alike behaviour (read below).
es: Configurar en 'No' para la tarifa típica cobrada al establecer la llamada. Configurar en 'Sí' para habilitar el comportamiento similar al costo mínimo (leer abajo).

source: Destination rate names are not shown to the final client, you can use whatever makes sense to you.
es: Los nombres de las tarifas de destino no se muestran al cliente final, puedes usar lo que tenga sentido para ti.

source: Deductible Connection Fee (Minimal Cost)
es: Tarifa de Conexión Deducible (Costo Mínimo)

source: When Destination Rate has *Deductible Connection Fee* set to yes, all rates' Connection Fee will behave like Minimal Cost.
es: Cuando la Tarifa de Destino tiene *Tarifa de Conexión Deducible* configurada en sí, todas las tarifas de Conexión se comportarán como Costo Mínimo.

source: This is underlying logic:
es: Esta es la lógica subyacente:

source: When call is established, Connection Fee of matched prefix is charged.
es: Cuando se establece la llamada, se cobra la Tarifa de Conexión del prefijo coincidente.

source: When call is hung up:
es: Cuando se cuelga la llamada:

source: Total cost without connection fee is calculated (CostWithoutConnectionFee):
es: Se calcula el costo total sin la tarifa de conexión (CostWithoutConnectionFee):

source: If is greater than connection fee, connection fee is subtracted from total cost.
es: Si es mayor que la tarifa de conexión, la tarifa de conexión se resta del costo total.

source: Final connection fee: 0
es: Tarifa de conexión final: 0

source: Final cost: CostWithoutConnectionFee
es: Costo final: CostWithoutConnectionFee

source: If is lower than connection fee, connection fee is adjusted so that total cost is equal to connection fee.
es: Si es menor que la tarifa de conexión, la tarifa de conexión se ajusta para que el costo total sea igual a la tarifa de conexión.

source: Final connection fee: ConnectionFee - CostWithoutConnectionFee
es: Tarifa de conexión final: ConnectionFee - CostWithoutConnectionFee

source: Final cost: ConnectionFee
es: Costo final: ConnectionFee

source: In both cases, cost difference is refunded to affected balances.
es: En ambos casos, la diferencia de costo se reembolsa a los saldos afectados.

source: Connection fee 0.01 - Total cost 0.21
es: Tarifa de conexión 0.01 - Costo total 0.21

source: Cost without connection fee: 0.20
es: Costo sin tarifa de conexión: 0.20

source: As 0.20 > 0.01:
es: Como 0.20 > 0.01:

source: Call cost is reduced to 0.20
es: El costo de la llamada se reduce a 0.20

source: 0.01 is refunded to affected balances
es: 0.01 se reembolsa a los saldos afectados

source: Connection fee 0.01 - Total cost 0.013
es: Tarifa de conexión 0.01 - Costo total 0.013

source: Cost without connection fee: 0.003
es: Costo sin tarifa de conexión: 0.003

source: As 0.003 < 0.01:
es: Como 0.003 < 0.01:

source: Call cost is reduced to 0.01
es: El costo de la llamada se reduce a 0.01

source: 0.003 is refunded to affected balances
es: 0.003 se reembolsa a los saldos afectados

source: This setting guarantees a minimal cost of 0.01.
es: Esta configuración garantiza un costo mínimo de 0.01.

source: Add rates manually
es: Agregar tarifas manualmente

source: Brand operator can add rates by hand, filling these fields (**List of rates** subsection):
es: El operador de la marca puede agregar tarifas manualmente, llenando estos campos (**Lista de tarifas** subsección):

source: Destination
es: Destino

source: Pre-created destination that specifies a concrete prefix.
es: Destino pre-creado que especifica un prefijo concreto.

source: Connection charge
es: Cargo de conexión

source: The amount that is charged just for call establishment.
es: La cantidad que se cobra solo por el establecimiento de la llamada.

source: Interval start
es: Inicio del intervalo

source: When should the billing engine start rating the calls. If you set it to 10, first 10 seconds will be for free.
es: Cuándo debe el motor de facturación comenzar a calificar las llamadas. Si lo configuras en 10, los primeros 10 segundos serán gratis.

source: Per minute rate
es: Tarifa por minuto

source: Price per minute of conversation.
es: Precio por minuto de conversación.

source: Charge period
es: Período de cobro

source: Increase cost every seconds? Or in 10 second intervals? Or every minute?
es: ¿Aumentar el costo cada segundos? ¿O en intervalos de 10 segundos? ¿O cada minuto?

source: A call with less duration that the one defined in interval start will have the price of the **Connection fee**.
es: Una llamada con una duración menor a la definida en el inicio del intervalo tendrá el precio de la **Tarifa de Conexión**.

source: All decimals must use point as decimal delimiter. 4 decimals precision is used.
es: Todos los decimales deben usar punto como delimitador decimal. Se usa una precisión de 4 decimales.

source: How it works
es: Cómo funciona

source: Call cost/price is increased by (*Per minute rate* / 60 ) * *charge period* every *charge period* seconds:
es: El costo/precio de la llamada se incrementa en (*Tarifa por minuto* / 60 ) * *período de cobro* cada *período de cobro* segundos:

source: If *billing period* is set to 1, every second the price will be increased *price per minute* divided by 60 (bill by seconds).
es: Si el *período de facturación* se establece en 1, cada segundo el precio se incrementará *precio por minuto* dividido por 60 (facturación por segundos).

source: If *billing period* is set to 60, every minute the price will be increased *price per minute* (bill by minutes).
es: Si el *período de facturación* se establece en 60, cada minuto el precio se incrementará *precio por minuto* (facturación por minutos).

source: Importing a CSV file
es: Importando un archivo CSV

source: At this point, the brand operator may have noticed that adding thousands of rates would be a really annoying and time consuming task, as there are 254 countries, each of them with their mobile networks, landline networks, special service numbers, etc.
es: En este punto, el operador de la marca puede haber notado que agregar miles de tarifas sería una tarea realmente molesta y que consume mucho tiempo, ya que hay 254 países, cada uno con sus redes móviles, redes fijas, números de servicios especiales, etc.

source: That's why the creation of destination rates is done using a `CSV <https://es.wikipedia.org/wiki/CSV>`_ file.
es: Es por eso que la creación de tarifas de destino se realiza utilizando un archivo `CSV <https://es.wikipedia.org/wiki/CSV>`_.

source: The first step is creating an empty *Destination rate* to import the prices in and using **Import rates** option.
es: El primer paso es crear una *tarifa de destino* vacía para importar los precios y usar la opción **Importar tarifas**.

source: We can select which column contains which field, in case we want to import a `CSV <https://es.wikipedia.org/wiki/CSV>`_ file in a non-recommended format. We can also decide whether to import the first line or discard it as it may have titles instead of data.
es: Podemos seleccionar qué columna contiene qué campo, en caso de que queramos importar un archivo `CSV <https://es.wikipedia.org/wiki/CSV>`_ en un formato no recomendado. También podemos decidir si importar la primera línea o descartarla ya que puede tener títulos en lugar de datos.

source: The importing process is done in background, letting the brand operator continue doing other stuff while it is finished.
es: El proceso de importación se realiza en segundo plano, permitiendo al operador de la marca continuar haciendo otras cosas mientras se termina.

source: CSV format
es: Formato CSV

source: Although the import window allows importing non-recommended format CSV files, we encourage you to import a file in the proposed format, as it will make this process much easier:
es: Aunque la ventana de importación permite importar archivos CSV en formatos no recomendados, te recomendamos importar un archivo en el formato propuesto, ya que hará este proceso mucho más fácil:

source: Comma is the only allowed separator character.
es: La coma es el único carácter separador permitido.

source: Single quotes are not supported.
es: Las comillas simples no son compatibles.

source: You can find a sample CSV for importing `here <https://raw.githubusercontent.com/ irontec/ivozprovider/bleeding/web/portal/brand/samples/billing/pricesSample.csv>`_.
es: Puedes encontrar un CSV de muestra para importar `aquí <https://raw.githubusercontent.com/ irontec/ivozprovider/bleeding/web/portal/brand/samples/billing/pricesSample.csv>`_.

source: The order of the columns should be:
es: El orden de las columnas debe ser:

source: Destination name
es: Nombre del destino

source: If they contain any comma, they MUST be quoted with double quotes. Otherwise, double quotes are optional.
es: Si contienen alguna coma, DEBEN estar entre comillas dobles. De lo contrario, las comillas dobles son opcionales.

source: Destination prefix
es: Prefijo del destino

source: MUST start with + sign.
es: DEBE comenzar con el signo +.

source: If same prefix is used in multiple times in CSV file, import process will fail.
es: Si el mismo prefijo se usa varias veces en el archivo CSV, el proceso de importación fallará.

source: MUST use point as decimal separator.
es: DEBE usar punto como separador decimal.

source: Given in seconds, only integers greater or equal 1 are supported.
es: Dado en segundos, solo se admiten enteros mayores o iguales a 1.

source: Once the import process is over, we only have to include this destination rate into some rating plan and bind it to the clients/carriers we want following the procedure explained in :ref:`Rating plans`.
es: Una vez que el proceso de importación haya terminado, solo tenemos que incluir esta tarifa de destino en algún plan de tarifas y vincularlo a los clientes/carriers que queramos siguiendo el procedimiento explicado en :ref:`Planes de tarifas <Rating plans>`.

source: Re-importing a CSV file
es: Reimportando un archivo CSV

source: Once a CSV (first.csv) is imported into an empty destination-rates row, you can **import another CSV** (second.csv).
es: Una vez que un CSV (first.csv) se importa en una fila de tarifas de destino vacía, puedes **importar otro CSV** (second.csv).

source: However, it is **important to understand what happens** when you do so:
es: Sin embargo, es **importante entender lo que sucede** cuando lo haces:

source: Prefixes in both CSV will get its rate **updated** with second's CSV one.
es: Los prefijos en ambos CSV tendrán su tarifa **actualizada** con la del segundo CSV.

source: Prefixes existing only in the first CSV file will be **kept**.
es: Los prefijos que existen solo en el primer archivo CSV se **mantendrán**.

source: Prefixes existing only in the second CSV file will be **added**.
es: Los prefijos que existen solo en el segundo archivo CSV se **agregarán**.

source: Downloading CSV using *Imported file* option will always download **last imported CSV file** (no the combination of both as described above).
es: Descargar CSV usando la opción *Archivo importado* siempre descargará **el último archivo CSV importado** (no la combinación de ambos como se describe arriba).

source: Note that if both *first.csv* and *second.csv* contain exactly the same prefixes, resulting destination-rate will be as we had only imported *second.csv*. And downloading *Imported file* will download *second.csv*, that is exactly the current state of destination-rate.
es: Ten en cuenta que si tanto *first.csv* como *second.csv* contienen exactamente los mismos prefijos, la tarifa de destino resultante será como si solo hubiéramos importado *second.csv*. Y descargar *Archivo importado* descargará *second.csv*, que es exactamente el estado actual de la tarifa de destino.
