Repository: irontec/ivozprovider
Catalog: doc/sphinx/locale/*/LC_MESSAGES/administration_portal/brand/settings/notification_templates.po
Languages: es

source: Notification Templates
es: Plantillas de Notificación

source: Brand administrators can configure the notifications sent by IvozProvider:
es: Los administradores de la marca pueden configurar las notificaciones enviadas por IvozProvider:

source: Email sent when a new voicemail is received
es: Correo electrónico enviado cuando se recibe un nuevo buzón de voz

source: Email sent when a new fax is received
es: Correo electrónico enviado cuando se recibe un nuevo fax

source: Email sent when a balance is below configured threshold
es: Correo electrónico enviado cuando el saldo está por debajo del umbral configurado

source: Email sent when an automatic invoice is generated
es: Correo electrónico enviado cuando se genera una factura automática

source: Email sent when scheduled CDR CSVs are generated
es: Correo electrónico enviado cuando se generan CSVs de CDR programados

source: Email sent when max daily usage is reached
es: Correo electrónico enviado cuando se alcanza el uso máximo diario

source: Email sent with access credentials
es: Correo electrónico enviado con credenciales de acceso

source: When no custom notification is configured, default ones will be used
es: Cuando no se configura una notificación personalizada, se usarán las predeterminadas

source: Notifications are created in two steps: Create a notification type and add contents to the notification for each required language.
es: Las notificaciones se crean en dos pasos: Crear un tipo de notificación y agregar contenido a la notificación para cada idioma requerido.

source: Creating a new notification
es: Creando una nueva notificación

source: Brand administrators can create new notification templates in **Brand configuration** > **Notification templates**:
es: Los administradores de la marca pueden crear nuevas plantillas de notificación en **Configuración de la marca** > **Plantillas de notificación**:

source: Fields are nearly self-explanatory:
es: Los campos son casi autoexplicativos:

source: Name
es: Nombre

source: Used to identify this notification template
es: Usado para identificar esta plantilla de notificación

source: Type
es: Tipo

source: Determine the notification type. Each notification type has its own substitution variables available to replace the contents of the subject and body.
es: Determina el tipo de notificación. Cada tipo de notificación tiene sus propias variables de sustitución disponibles para reemplazar el contenido del asunto y el cuerpo.

source: Adding Notification contents
es: Agregando contenido de notificación

source: Once the notification has been created, you can add different language contents. IvozProvider will automatically use the proper language based on the destination:
es: Una vez que se ha creado la notificación, puedes agregar contenido en diferentes idiomas. IvozProvider usará automáticamente el idioma adecuado según el destino:

source: For Voicemails, the user language will be used
es: Para los buzones de voz, se usará el idioma del usuario

source: For Faxes, the client language will be used.
es: Para los faxes, se usará el idioma del cliente.

source: Configurable fields of each content:
es: Campos configurables de cada contenido:

source: Language
es: Idioma

source: Language of the contents.
es: Idioma del contenido.

source: From Name
es: Nombre del remitente

source: The from name used while sending emails (p.e. IvozProvider Voicemail Notifications)
es: El nombre del remitente utilizado al enviar correos electrónicos (p.e. Notificaciones de Buzón de Voz de IvozProvider)

source: From Address
es: Dirección del remitente

source: The from address used while sending emails (p.e. no-reply@ivozprovider.com)
es: La dirección del remitente utilizada al enviar correos electrónicos (p.e. no-reply@ivozprovider.com)

source: Substitution variables
es: Variables de sustitución

source: Available variables that can be used in subject and body that will be replaced before sending the email. Each notification type has its own variables.
es: Variables disponibles que se pueden usar en el asunto y el cuerpo que serán reemplazadas antes de enviar el correo electrónico. Cada tipo de notificación tiene sus propias variables.

source: Subject
es: Asunto

source: Subject of the email to be sent. You can include Substitution variables here.
es: Asunto del correo electrónico a enviar. Puedes incluir variables de sustitución aquí.

source: Body type
es: Tipo de cuerpo

source: Body of the mail can be both plaintext or html.
es: El cuerpo del correo puede ser tanto texto plano como html.

source: Body
es: Cuerpo

source: Body of the email to be sent. You can include Substitution variables here.
es: Cuerpo del correo electrónico a enviar. Puedes incluir variables de sustitución aquí.

source: There is no need to create all content languages. If custom notification has some languages not defined the default contents will be used for that notification type.
es: No es necesario crear todos los idiomas del contenido. Si la notificación personalizada no tiene algunos idiomas definidos, se usarán los contenidos predeterminados para ese tipo de notificación.

source: Using variables in notification contents
es: Agregando contenido de notificación

source: You can use variables in the subject and body of the email. Each notification type has its own set of variables that can be used. The variables are replaced with the corresponding value before sending the email notification.
es: Puedes usar variables en el asunto y el cuerpo del correo electrónico. Cada tipo de notificación tiene su propio conjunto de variables que se pueden usar. Las variables se reemplazan con el valor correspondiente antes de enviar la notificación por correo electrónico.

source: **Voicemail Notifications**
es: **Notificaciones de Buzón de Voz**

source: Voicemail User name
es: Nombre del usuario del buzón de voz

source: Received date
es: Fecha de recepción

source: Voicemail duration
es: Duración del buzón de voz

source: Caller name
es: Nombre del llamante

source: Caller number
es: Número del llamante

source: Voicemail Number
es: Número del buzón de voz

source: **Fax Notifications**
es: **Notificaciones de Fax**

source: Virtual Fax name
es: Nombre del fax virtual

source: Fax PDF filename
es: Nombre del archivo PDF del fax

source: Fax PDF page count
es: Número de páginas del PDF del fax

source: Origin number
es: Número de origen

source: Received DDI number
es: Número DDI recibido

source: Received Date
es: Fecha de recepción

source: **Invoice Notifications**
es: **Notificaciones de Factura**

source: Company name
es: Nombre de la empresa

source: Start date
es: Fecha de inicio

source: End date
es: Fecha de fin

source: Total amount with taxes
es: Monto total con impuestos

source: Currency
es: Moneda

source: **Low Balance Notifications**
es: **Notificaciones de Saldo Bajo**

source: Company or carrier name
es: Nombre de la empresa o del operador

source: Current balance amount
es: Monto actual del saldo

source: **Call CSV Notifications**
es: **Notificaciones de CSV de Llamadas**

source: **Max Daily Usage Notifications**
es: **Notificaciones de Uso Máximo Diario**

source: Company max daily usage
es: Uso máximo diario de la empresa

source: Assigning templates to clients
es: Asignando plantillas a clientes

source: Once the notification has been configured for the desired languages, Brand administrator can assign it to the client that will use it. This can be done in the Notification configuration section of each client. If client has no notification configured, brand notifications will be used for that client instead. If brand has no notification configured, default notifications will be used.
es: Una vez que la notificación ha sido configurada para los idiomas deseados, el administrador de la marca puede asignarla al cliente que la usará. Esto se puede hacer en la sección de configuración de notificaciones de cada cliente. Si el cliente no tiene una notificación configurada, se usarán las notificaciones de la marca para ese cliente. Si la marca no tiene una notificación configurada, se usarán las notificaciones predeterminadas.
